       IDENTIFICATION DIVISION.
       PROGRAM-ID. prog.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  TST-VARS.
           03 TST-NUMBER         PIC  9(6).
           03 TST-NUMBER-SIGNED  PIC S9(6).
           03 TST-DECIMAL        PIC  9(2)V9(4).
           03 TST-DECIMAL-SIGNED PIC S9(2)V9(4).
       77     ZERO-DECIMAL       PIC  9(2)V9(4) VALUE ZERO.
       77     ZERO-NUMBER        PIC  9(6)      VALUE ZERO.

       PROCEDURE DIVISION.
           MOVE SPACES TO TST-VARS

           IF TST-NUMBER > 0
              DISPLAY "TST-NUMBER IS > 0".
           IF TST-NUMBER NOT = 0
              DISPLAY "TST-NUMBER IS NOT 0".
           IF TST-NUMBER < 0
              DISPLAY "TST-NUMBER IS < 0".

           IF TST-NUMBER-SIGNED > 0
              DISPLAY "TST-NUMBER-SIGNED IS > 0".
           IF TST-NUMBER-SIGNED NOT = 0
              DISPLAY "TST-NUMBER-SIGNED IS NOT 0".
           IF TST-NUMBER-SIGNED < 0
              DISPLAY "TST-NUMBER-SIGNED IS < 0".

           IF TST-DECIMAL > 0
              DISPLAY "TST-DECIMAL IS > 0".
           IF TST-DECIMAL NOT = 0
              DISPLAY "TST-DECIMAL IS NOT 0".
           IF TST-DECIMAL < 0
              DISPLAY "TST-DECIMAL IS < 0".

           IF TST-DECIMAL-SIGNED > 0
              DISPLAY "TST-DECIMAL-SIGNED IS > 0".
           IF TST-DECIMAL-SIGNED NOT = 0
              DISPLAY "TST-DECIMAL-SIGNED IS NOT 0".
           IF TST-DECIMAL-SIGNED < 0
              DISPLAY "TST-DECIMAL-SIGNED IS < 0".

           IF TST-NUMBER > ZERO-NUMBER
              DISPLAY "TST-NUMBER IS > ZERO-NUMBER".
           IF TST-NUMBER NOT = ZERO-NUMBER
              DISPLAY "TST-NUMBER IS NOT ZERO-NUMBER".
           IF TST-NUMBER < ZERO-NUMBER
              DISPLAY "TST-NUMBER IS < ZERO-NUMBER".

           IF TST-NUMBER-SIGNED > ZERO-NUMBER
              DISPLAY "TST-NUMBER-SIGNED IS > ZERO-NUMBER".
           IF TST-NUMBER-SIGNED NOT = ZERO-NUMBER
              DISPLAY "TST-NUMBER-SIGNED IS NOT ZERO-NUMBER".
           IF TST-NUMBER-SIGNED < ZERO-NUMBER
              DISPLAY "TST-NUMBER-SIGNED IS < ZERO-NUMBER".

           IF TST-DECIMAL > ZERO-NUMBER
              DISPLAY "TST-DECIMAL IS > ZERO-NUMBER".
           IF TST-DECIMAL NOT = ZERO-NUMBER
              DISPLAY "TST-DECIMAL IS NOT ZERO-NUMBER".
           IF TST-DECIMAL < ZERO-NUMBER
              DISPLAY "TST-DECIMAL IS < ZERO-NUMBER".

           IF TST-DECIMAL-SIGNED > ZERO-NUMBER
              DISPLAY "TST-DECIMAL-SIGNED IS > ZERO-NUMBER".
           IF TST-DECIMAL-SIGNED NOT = ZERO-NUMBER
              DISPLAY "TST-DECIMAL-SIGNED IS NOT ZERO-NUMBER".
           IF TST-DECIMAL-SIGNED < ZERO-NUMBER
              DISPLAY "TST-DECIMAL-SIGNED IS < ZERO-NUMBER".

           IF TST-NUMBER > ZERO-DECIMAL
              DISPLAY "TST-NUMBER IS > ZERO-DECIMAL".
           IF TST-NUMBER NOT = ZERO-DECIMAL
              DISPLAY "TST-NUMBER IS NOT ZERO-DECIMAL".
           IF TST-NUMBER < ZERO-DECIMAL
              DISPLAY "TST-NUMBER IS < ZERO-DECIMAL".

           IF TST-NUMBER-SIGNED > ZERO-DECIMAL
              DISPLAY "TST-NUMBER-SIGNED IS > ZERO-DECIMAL".
           IF TST-NUMBER-SIGNED NOT = ZERO-DECIMAL
              DISPLAY "TST-NUMBER-SIGNED IS NOT ZERO-DECIMAL".
           IF TST-NUMBER-SIGNED < ZERO-DECIMAL
              DISPLAY "TST-NUMBER-SIGNED IS < ZERO-DECIMAL".

           IF TST-DECIMAL > ZERO-DECIMAL
              DISPLAY "TST-DECIMAL IS > ZERO-DECIMAL".
           IF TST-DECIMAL NOT = ZERO-DECIMAL
              DISPLAY "TST-DECIMAL IS NOT ZERO-DECIMAL".
           IF TST-DECIMAL < ZERO-DECIMAL
              DISPLAY "TST-DECIMAL IS < ZERO-DECIMAL".

           IF TST-DECIMAL-SIGNED > ZERO-DECIMAL
              DISPLAY "TST-DECIMAL-SIGNED IS > ZERO-DECIMAL".
           IF TST-DECIMAL-SIGNED NOT = ZERO-DECIMAL
              DISPLAY "TST-DECIMAL-SIGNED IS NOT ZERO-DECIMAL".
           IF TST-DECIMAL-SIGNED < ZERO-DECIMAL
              DISPLAY "TST-DECIMAL-SIGNED IS < ZERO-DECIMAL".

           GOBACK.
