       IDENTIFICATION   DIVISION.
       PROGRAM-ID.      callee2.
       PROCEDURE        DIVISION.
           DISPLAY 'STOP WITH 2' WITH NO ADVANCING
           STOP RUN RETURNING 2.
