       IDENTIFICATION   DIVISION.
       PROGRAM-ID.      prog.
       PROCEDURE        DIVISION.
       A01 SECTION.
       A011.
          CONTINUE.
