       IDENTIFICATION   DIVISION.
       PROGRAM-ID.      callee.
       DATA             DIVISION.
       WORKING-STORAGE  SECTION.
       01 DISP-VALS.
          05 DISP-VAL   PIC 9 VALUE 0.
          05 DISP-IDX   PIC 9 VALUE 0.
       01 WRK-X.
          05 WRK-VAR    PIC 9 VALUE 0 OCCURS 1 INDEXED BY WRK-IDX.
       PROCEDURE        DIVISION.
           DISPLAY SPACE WITH NO ADVANCING UPON SYSOUT.
           ADD  1 TO WRK-VAR(1)
           SET  WRK-IDX UP BY 1
           SET  DISP-IDX TO WRK-IDX.
           MOVE WRK-VAR(1) TO DISP-VAL.
           DISPLAY DISP-VALS WITH NO ADVANCING UPON SYSOUT.
           GOBACK.
