       IDENTIFICATION DIVISION.
       PROGRAM-ID. prog.
       DATA  DIVISION.
       WORKING-STORAGE SECTION.
       01  TST.
           05 DEPT-SUB        PIC 9(7)V999 VALUE 18536.232.
           05 DEPT-COST-YTD   PIC 9(5)V999 VALUE 18536.232.
           05 DL-PROD-COST    PIC $$$,$$9.99.
       77  WFLT  PIC $$$,$$9.99.

       PROCEDURE DIVISION.
           MOVE 18536.23 TO WFLT.
           DISPLAY "WFLT IS " WFLT.
           MULTIPLY DEPT-COST-YTD BY 1 GIVING DL-PROD-COST ROUNDED.
           DISPLAY "COST IS " DL-PROD-COST.
           STOP RUN.
