       IDENTIFICATION DIVISION.
       PROGRAM-ID. prog.

       PROCEDURE DIVISION.
       MAIN.
           CALL "_SUB-PROG_NOW" USING 'X'.
           STOP RUN.
