       >>TURN EC-BOUND-SUBSCRIPT CHECKING ON
       IDENTIFICATION DIVISION.
       PROGRAM-ID. prog.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  x VALUE "12345!".
           03  y PIC X OCCURS 5 TIMES.
           03  z PIC X.
       01  idx PIC 99 VALUE 6.

       PROCEDURE DIVISION.
       >>TURN EC-BOUND-SUBSCRIPT CHECKING OFF
           DISPLAY y (idx) WITH NO ADVANCING
       >>TURN EC-BOUND-SUBSCRIPT CHECKING ON WITH LOCATION
       >>TURN EC-BOUND, EC-PROGRAM CHECKING OFF
           DISPLAY y (idx) WITH NO ADVANCING
       >>TURN EC-BOUND-SUBSCRIPT CHECKING ON
           DISPLAY y (idx) WITH NO ADVANCING
           .
