       IDENTIFICATION   DIVISION.
       PROGRAM-ID.      prog.
       PROCEDURE        DIVISION.
           DISPLAY ""135,151,151"bar"195,194,234" = foobarBAZ"
           STOP RUN.
