       IDENTIFICATION   DIVISION.
       PROGRAM-ID.      prog.
       PROCEDURE        DIVISION.
           DISPLAY ""135,151,151"bar"195,194,0""
           DISPLAY ""135,257""
           DISPLAY ""135,x,194,1""
           DISPLAY ""135,,155,""
           DISPLAY ""135  155 " "

           STOP RUN.
