       IDENTIFICATION  DIVISION.
       PROGRAM-ID.     prog.

       DATA            DIVISION.
       WORKING-STORAGE SECTION.
       01  x           PIC X.
       01  nat         PIC N.
       01  n           PIC 9.

       PROCEDURE       DIVISION.
           MOVE X''  TO x
           MOVE H''  TO n
           MOVE Z''  TO x
           MOVE L''  TO x
           MOVE N""  TO nat
           MOVE NX'' TO nat
           MOVE B""  TO n
           MOVE BX"" TO n
           .
