       IDENTIFICATION DIVISION.
       PROGRAM-ID. DOUBLE-OPEN.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
          SELECT FILE1 ASSIGN TO "./file1.txt"
            FILE STATUS STAT-FILE1.
          SELECT FILE2 ASSIGN TO "./file2.txt"
            FILE STATUS STAT-FILE2.
       DATA DIVISION.
       FILE SECTION.
       FD FILE1.
         01 FS-FILE1 PIC X(10).
       FD FILE2.
         01 FS-FILE2 PIC X(10).
       WORKING-STORAGE SECTION.
	 01  STAT-FILE1               PIC XX.
	 01  STAT-FILE2               PIC XX.
       PROCEDURE DIVISION.
       DECLARATIVES.
       F-FILE1 SECTION. USE AFTER ERROR PROCEDURE ON FILE1.
       DEB-FILE1.
         DISPLAY "ERROR ON FILE1".
          DISPLAY "  STAT-FILE1: " STAT-FILE1.
          DISPLAY "  STAT-FILE2: " STAT-FILE2.
       F-FILE2 SECTION. USE AFTER ERROR PROCEDURE ON FILE2.
       DEB-FILE2.
         DISPLAY "ERROR ON FILE2".
         DISPLAY "  STAT-FILE1: " STAT-FILE1.
         DISPLAY "  STAT-FILE2: " STAT-FILE2.
       END DECLARATIVES.
       PROGRAMME SECTION.
       MAIN.
          OPEN INPUT FILE1
	             FILE2.
          DISPLAY "READ FILE1".
          READ FILE1.
          DISPLAY "READ FILE2".
          READ FILE2.
          DISPLAY "CLOSE FILES".
          CLOSE FILE1
                FILE2.
          DISPLAY "DELETE FILES".
          DELETE FILE FILE1
                      FILE2.
          STOP RUN.
