       IDENTIFICATION DIVISION.
       PROGRAM-ID. NESTED-FILES.
       PROCEDURE DIVISION.
         CALL    "NESTED-PROGRAM-1".
         CALL    "NESTED-PROGRAM-2".
         STOP RUN.

       IDENTIFICATION DIVISION.
       PROGRAM-ID. NESTED-PROGRAM-1.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
         SELECT FILE-EXT ASSIGN "./TEST-FILE" FILE STATUS IS WSFS.
       DATA DIVISION.
       FILE SECTION.
       FD FILE-EXT GLOBAL.
       01 FILE-EXT-REC PIC X(5).
       WORKING-STORAGE SECTION.
       01  WSFS              PIC X(2).
       PROCEDURE DIVISION.
       DECLARATIVES.
       P01 SECTION.
      * This one is GLOBAL and should be called from within nested programs
          USE GLOBAL AFTER ERROR PROCEDURE ON FILE-EXT.
       P0101.
          DISPLAY "ERROR ON FILE-EXT".
       P02 SECTION.
          USE AFTER ERROR PROCEDURE ON OUTPUT.
       P0201.
          DISPLAY "ERROR ON OUTPUT".
       END DECLARATIVES.
       MAIN SECTION.
         OPEN OUTPUT FILE-EXT.
         CALL    "NESTED-PROGRAM-1-1".
	 DISPLAY "CLOSING FILE DESCRIPTOR".
         CLOSE FILE-EXT.
         CALL    "NESTED-PROGRAM-1-2".
         GOBACK.

       IDENTIFICATION DIVISION.
       PROGRAM-ID. NESTED-PROGRAM-1-1.
       PROCEDURE DIVISION.
         NESTED-PROGRAM .
	 DISPLAY "ENTERING NESTED-PROGRAM-1-1".
	 DISPLAY "TRYING TO WRITE".
         WRITE FILE-EXT-REC FROM "Hello".
	 DISPLAY "EXITING NESTED-PROGRAM-1-1".
         GOBACK.
       END PROGRAM NESTED-PROGRAM-1-1.

       IDENTIFICATION DIVISION.
       PROGRAM-ID. NESTED-PROGRAM-1-2.
       PROCEDURE DIVISION.
         NESTED-PROGRAM .
	 DISPLAY "ENTERING NESTED-PROGRAM-1-2".
	 DISPLAY "TRYING TO WRITE".
         WRITE FILE-EXT-REC FROM "Hello".
	 DISPLAY "EXITING NESTED-PROGRAM-1-2".
         GOBACK.
       END PROGRAM NESTED-PROGRAM-1-2.

       END PROGRAM NESTED-PROGRAM-1.

       IDENTIFICATION DIVISION.
       PROGRAM-ID. NESTED-PROGRAM-2.
       PROCEDURE DIVISION.
         GOBACK.
       END PROGRAM NESTED-PROGRAM-2.

       END PROGRAM NESTED-FILES.
