       IDENTIFICATION DIVISION.
       FUNCTION-ID.   func.

       DATA           DIVISION.
       LINKAGE        SECTION.
       01  any-len    PIC X ANY LENGTH.

       PROCEDURE      DIVISION RETURNING any-len.
           CONTINUE
           .
       END FUNCTION   func.
