       IDENTIFICATION DIVISION.
       FUNCTION-ID. func.
       
       END FUNCTION func.
       
       IDENTIFICATION DIVISION.
       PROGRAM-ID. prog.
       
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  x PIC 999 VALUE 124.
       END PROGRAM prog.
