       IDENTIFICATION DIVISION.
       PROGRAM-ID. prog.

       PROCEDURE DIVISION.
           CONTINUE
           .

       IDENTIFICATION DIVISION.
       FUNCTION-ID. f.
       END FUNCTION f.
