       IDENTIFICATION   DIVISION.
       PROGRAM-ID.      prog.
       ENVIRONMENT DIVISION.
       DATA             DIVISION.
       WORKING-STORAGE  SECTION.
       PROCEDURE        DIVISION.
           DISPLAY FUNCTION PI.
           DISPLAY FUNCTION PI ( ).
           DISPLAY FUNCTION PI (1).
           DISPLAY FUNCTION ABS.
           DISPLAY FUNCTION ABS (1).
           DISPLAY FUNCTION ABS (1, 2).
           DISPLAY FUNCTION DAY-TO-YYYYDDD.
           DISPLAY FUNCTION DAY-TO-YYYYDDD (6000).
           DISPLAY FUNCTION DAY-TO-YYYYDDD (6000,50).
           DISPLAY FUNCTION DAY-TO-YYYYDDD (6000,50,1600).
           DISPLAY FUNCTION DAY-TO-YYYYDDD (6000,50,1600,500).
           DISPLAY FUNCTION MAX ().
           DISPLAY FUNCTION MAX (6000).
           DISPLAY FUNCTION SUBSTITUTE ('A' 'B' 'C' 'D').
           STOP RUN.
