       IDENTIFICATION   DIVISION.
       PROGRAM-ID.      prog.
       ENVIRONMENT DIVISION.
       DATA             DIVISION.
       WORKING-STORAGE  SECTION.
       PROCEDURE        DIVISION.
           DISPLAY FUNCTION CHAR (66)(1:2).
           DISPLAY FUNCTION NUMVAL-C (123)(1:2).
           DISPLAY FUNCTION REVERSE ("TESTME")(-1:1).
           DISPLAY FUNCTION REVERSE ("TESTME")(1:0).
           STOP RUN.
