       PROGRAM-ID. prog.
       END PROGRAM prog.

       IDENTIFICATION DIVISION.
       FUNCTION-ID. alpha.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SPECIAL-NAMES.
           ALPHABET gamma IS ASCII
           .
       REPOSITORY.
           FUNCTION alpha
           PROGRAM prog
           PROGRAM prog
           PROGRAM prog AS "alpha"
           FUNCTION prog
           FUNCTION gamma
           .
       END FUNCTION alpha.
