       IDENTIFICATION   DIVISION.
       PROGRAM-ID.      a.
       PROCEDURE        DIVISION.
           DISPLAY "job" WITH NO ADVANCING END-DISPLAY
           STOP RUN WITH NORMAL STATUS.
