       IDENTIFICATION DIVISION.
       PROGRAM-ID. prog.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 T0 PIC X VALUE "X".
       01 T1 REDEFINES T0 PIC X GLOBAL.
       PROCEDURE DIVISION.
          DISPLAY T1.
