       IDENTIFICATION   DIVISION.
       PROGRAM-ID.      prog.
       DATA             DIVISION.
       WORKING-STORAGE  SECTION.
       01  A.
            05 B.
                10 C PIC X.
           04 D.
            05 E PIC X.
            05 F PIC X.
           04 D2.
            05 E2 PIC X.
           04 D3.
            05 E3 PIC X.
       PROCEDURE        DIVISION.
           STOP RUN.
