       IDENTIFICATION   DIVISION.
       PROGRAM-ID.      prog3.
       PROCEDURE        DIVISION.
           MOVE 'unknown' TO CURRENT-DATE
           STOP RUN.
