       IDENTIFICATION   DIVISION.
       PROGRAM-ID.      prog2.
       DATA             DIVISION.
       WORKING-STORAGE  SECTION.
       01 G.
         02 X             PIC X.
         02 X REDEFINES X PIC X.
         02 Y             PIC 9.
