       IDENTIFICATION DIVISION.
       PROGRAM-ID. PDTESTR.

       DATA DIVISION.
       WORKING-STORAGE SECTION.

      * DATA-AREA

       77  FLD0001A                       PIC  9(08)V9(19)
                   VALUE  72210483.5706116943150334464.
       77  FLD0001B                       PIC  9(01)      
                   VALUE  0.

       77  FLD0002A                       PIC  9(05)V9(26)
                   VALUE  83954.98773698940597753903603006.
       77  FLD0002B                       PIC  9(05)V9(27)
                   VALUE  85526.912891598327881581553810974.

       77  FLD0003A                       PIC  9(01)      
                   VALUE  0.
       77  FLD0003B                       PIC  9(10)V9(08)
                   VALUE  4976916625.40136914.

       77  FLD0004A                       PIC S9(08)V9(03)
                   VALUE +31348416.669.
       77  FLD0004B                       PIC  9(05)V9(01)
                   VALUE  16799.5.

       77  FLD0005A                       PIC S9(07)V9(01)
                   VALUE +2337334.8.
       77  FLD0005B                       PIC S9(09)V9(03)
                   VALUE +324331791.973.

       77  FLD0006A                       PIC  9(04)      
                   VALUE  1169.
       77  FLD0006B                       PIC  9(03)V9(31)
                   VALUE  912.5850054312464321171205483551602.

       77  FLD0007A                       PIC S9(04)      
                   VALUE +1123.
       77  FLD0007B                       PIC S9(08)V9(02)
                   VALUE -27032151.91.

       77  FLD0008A                       PIC  9(01)      
                   VALUE  0.
       77  FLD0008B                       PIC S9(03)      
                   VALUE -091.

       77  FLD0009A                       PIC  9(10)V9(07)
                   VALUE  4695987895.4491957.
       77  FLD0009B                       PIC  9(05)V9(28)
                   VALUE  87164.4396861416259625343627703841.

       77  FLD0010A                       PIC  9(03)V9(32)
                   VALUE  932.59120224122482589734772773226723.
       77  FLD0010B                       PIC S9(09)V9(06)
                   VALUE +401314086.816856.

       77  FLD0011A                       PIC  9(09)V9(04)
                   VALUE  356168291.4830.
       77  FLD0011B                       PIC  9(04)V9(29)
                   VALUE  8869.25340695890795927880390081554.

       77  FLD0012A                       PIC  9(03)      
                   VALUE  087.
       77  FLD0012B                       PIC  9(08)V9(19)
                   VALUE  71485769.2486604356929547066.

       77  FLD0013A                       PIC  9(06)V9(25)
                   VALUE  829630.0004717120923913853403064.
       77  FLD0013B                       PIC  9(07)V9(02)
                   VALUE  2497013.60.

       77  FLD0014A                       PIC  9(09)V9(13)
                   VALUE  592943121.2490873237541.
       77  FLD0014B                       PIC  9(06)V9(01)
                   VALUE  186764.7.

       77  FLD0015A                       PIC  9(07)V9(23)
                   VALUE  7984732.71412134533164817185024.
       77  FLD0015B                       PIC  9(10)V9(08)
                   VALUE  4953047329.19498391.

       77  FLD0016A                       PIC  9(05)V9(28)
                   VALUE  87275.9557853607148558694461826235.
       77  FLD0016B                       PIC S9(10)V9(06)
                   VALUE +4316165362.791636.

       77  FLD0017A                       PIC  9(01)      
                   VALUE  0.
       77  FLD0017B                       PIC  9(04)V9(30)
                   VALUE  8983.341087204116393039043941826093.

       77  FLD0018A                       PIC  9(07)V9(21)
                   VALUE  7619026.805277494540646898713.
       77  FLD0018B                       PIC S9(01)      
                   VALUE -0.

       77  FLD0019A                       PIC S9(10)V9(08)
                   VALUE -4930528885.68236813.
       77  FLD0019B                       PIC S9(09)V9(06)
                   VALUE +402620216.542097.

       77  FLD0020A                       PIC  9(09)V9(15)
                   VALUE  643887452.720044328735582.
       77  FLD0020B                       PIC  9(09)V9(11)
                   VALUE  552340679.26366126055.

       77  FLD0021A                       PIC  9(01)V9(36)
                   VALUE  9.880441680787707126043528660375159233.
       77  FLD0021B                       PIC S9(01)      
                   VALUE -0.

       77  FLD0022A                       PIC  9(06)V9(24)
                   VALUE  810040.192546636172998830716096.
       77  FLD0022B                       PIC  9(07)V9(21)
                   VALUE  7610660.641468062204140210269.

       77  FLD0023A                       PIC  9(02)      
                   VALUE  06.
       77  FLD0023B                       PIC  9(02)V9(34)
                   VALUE  95.1865432391802879230624512274516746.

       77  FLD0024A                       PIC  9(09)V9(03)
                   VALUE  329406009.124.
       77  FLD0024B                       PIC S9(09)V9(06)
                   VALUE +410668612.232476.

       77  FLD0025A                       PIC S9(01)      
                   VALUE +0.
       77  FLD0025B                       PIC  9(07)V9(02)
                   VALUE  2497488.27.

       77  FLD0026A                       PIC  9(01)      
                   VALUE  0.
       77  FLD0026B                       PIC S9(09)V9(05)
                   VALUE -383757196.20564.

       77  FLD0027A                       PIC  9(09)V9(13)
                   VALUE  601026867.0937520818498.
       77  FLD0027B                       PIC  9(06)V9(25)
                   VALUE  815849.1045356750515082921992870.

       77  FLD0028A                       PIC  9(04)V9(29)
                   VALUE  8794.72782911061568000832266989164.
       77  FLD0028B                       PIC S9(01)      
                   VALUE +0.

       77  FLD0029A                       PIC  9(05)      
                   VALUE  13697.
       77  FLD0029B                       PIC  9(09)V9(17)
                   VALUE  684374480.18294422258378517.

       77  FLD0030A                       PIC S9(01)      
                   VALUE +0.
       77  FLD0030B                       PIC  9(08)V9(18)
                   VALUE  70264210.169553353857452293.

       77  FLD0031A                       PIC  9(01)      
                   VALUE  0.
       77  FLD0031B                       PIC  9(08)V9(18)
                   VALUE  70450280.588407820925311852.

       77  FLD0032A                       PIC  9(10)V9(10)
                   VALUE  5269599769.4606222516.
       77  FLD0032B                       PIC S9(09)V9(03)
                   VALUE +322379197.669.

       77  FLD0033A                       PIC  9(09)V9(15)
                   VALUE  641903038.069859710468278.
       77  FLD0033B                       PIC  9(09)V9(03)
                   VALUE  318353502.142.

       77  FLD0034A                       PIC S9(02)      
                   VALUE -05.
       77  FLD0034B                       PIC S9(07)V9(01)
                   VALUE +2126766.9.

       77  FLD0035A                       PIC  9(06)V9(25)
                   VALUE  816285.5924199176049782522568420.
       77  FLD0035B                       PIC  9(07)V9(01)
                   VALUE  2276316.1.

       77  FLD0036A                       PIC  9(01)V9(36)
                   VALUE  9.789384107274801127829277902492322027.
       77  FLD0036B                       PIC  9(05)V9(27)
                   VALUE  84790.535447228665422159110676147.

       77  FLD0037A                       PIC  9(10)V9(11)
                   VALUE  5559560836.79804091701.
       77  FLD0037B                       PIC S9(05)      
                   VALUE -15352.

       77  FLD0038A                       PIC  9(02)V9(34)
                   VALUE  95.5897506417712539139586169767426326.
       77  FLD0038B                       PIC  9(06)V9(25)
                   VALUE  819342.2486726212872198971126636.

       77  FLD0039A                       PIC  9(04)V9(29)
                   VALUE  8933.20399454893721014059337903745.
       77  FLD0039B                       PIC  9(06)V9(01)
                   VALUE  205344.3.

       77  FLD0040A                       PIC S9(06)      
                   VALUE -162227.
       77  FLD0040B                       PIC S9(03)      
                   VALUE +101.

       77  FLD0041A                       PIC  9(09)V9(17)
                   VALUE  687709210.19485042879892944.
       77  FLD0041B                       PIC  9(10)V9(09)
                   VALUE  5032246021.307608119.

       77  FLD0042A                       PIC  9(07)V9(22)
                   VALUE  7680734.5400734650109342283030.
       77  FLD0042B                       PIC  9(10)V9(10)
                   VALUE  5398987461.4943655917.

       77  FLD0043A                       PIC S9(08)V9(02)
                   VALUE -28038049.48.
       77  FLD0043B                       PIC  9(04)V9(30)
                   VALUE  9102.051349475740460448491830902639.

       77  FLD0044A                       PIC  9(06)V9(01)
                   VALUE  206224.3.
       77  FLD0044B                       PIC  9(09)V9(04)
                   VALUE  359534215.7883.

       77  FLD0045A                       PIC  9(08)V9(02)
                   VALUE  28592495.81.
       77  FLD0045B                       PIC  9(09)V9(05)
                   VALUE  377058873.76830.

       77  FLD0046A                       PIC  9(01)      
                   VALUE  0.
       77  FLD0046B                       PIC  9(05)V9(27)
                   VALUE  86000.025910646182847330010190489.

       77  FLD0047A                       PIC  9(08)V9(02)
                   VALUE  26966592.97.
       77  FLD0047B                       PIC  9(10)V9(08)
                   VALUE  4982239515.90845814.

       77  FLD0048A                       PIC  9(05)V9(26)
                   VALUE  83962.84254838164429202151950448.
       77  FLD0048B                       PIC S9(05)V9(01)
                   VALUE -17309.9.

       77  FLD0049A                       PIC  9(09)V9(16)
                   VALUE  677621907.0336453320635428.
       77  FLD0049B                       PIC  9(01)V9(36)
                   VALUE  9.784571866912429305429554915463086217.

       77  FLD0050A                       PIC  9(09)V9(03)
                   VALUE  329667670.988.
       77  FLD0050B                       PIC  9(09)V9(06)
                   VALUE  408790070.710566.

       77  FLD0051A                       PIC  9(09)V9(15)
                   VALUE  643375703.689413991348544.
       77  FLD0051B                       PIC  9(04)V9(30)
                   VALUE  9064.871948640588206203005938732530.

       77  FLD0052A                       PIC  9(09)V9(04)
                   VALUE  367200483.8576.
       77  FLD0052B                       PIC  9(09)V9(11)
                   VALUE  550990476.15163754265.

       77  FLD0053A                       PIC  9(07)V9(01)
                   VALUE  2260324.6.
       77  FLD0053B                       PIC S9(09)V9(04)
                   VALUE -361176713.4701.

       77  FLD0054A                       PIC S9(01)      
                   VALUE +0.
       77  FLD0054B                       PIC  9(09)V9(03)
                   VALUE  319288758.232.

       77  FLD0055A                       PIC  9(09)V9(14)
                   VALUE  622232417.66982828604426.
       77  FLD0055B                       PIC  9(08)V9(17)
                   VALUE  68254498.02012105715576240.

       77  FLD0056A                       PIC  9(07)V9(01)
                   VALUE  2161993.9.
       77  FLD0056B                       PIC  9(08)V9(02)
                   VALUE  27806089.73.

       77  FLD0057A                       PIC  9(03)V9(32)
                   VALUE  929.20878243011406638629523513372987.
       77  FLD0057B                       PIC S9(02)      
                   VALUE -06.

       77  FLD0058A                       PIC  9(02)V9(34)
                   VALUE  96.6574119281082611010447180888149887.
       77  FLD0058B                       PIC S9(09)V9(04)
                   VALUE +343623662.0368.

       77  FLD0059A                       PIC  9(07)V9(02)
                   VALUE  2566438.61.
       77  FLD0059B                       PIC  9(09)V9(14)
                   VALUE  625762300.58564874525472.

       77  FLD0060A                       PIC  9(01)V9(36)
                   VALUE  9.888752946983269120906356874911580234.
       77  FLD0060B                       PIC  9(06)      
                   VALUE  159150.

       77  FLD0061A                       PIC  9(03)      
                   VALUE  095.
       77  FLD0061B                       PIC  9(06)V9(25)
                   VALUE  816564.2123096498172785118185856.

       77  FLD0062A                       PIC  9(10)V9(11)
                   VALUE  5579259193.81647705819.
       77  FLD0062B                       PIC  9(09)V9(13)
                   VALUE  602304146.8914084317631.

       77  FLD0063A                       PIC S9(07)V9(01)
                   VALUE +2106925.6.
       77  FLD0063B                       PIC  9(08)V9(19)
                   VALUE  73193550.7264897311507922950.

       77  FLD0064A                       PIC  9(06)V9(25)
                   VALUE  828553.1635867423583263757791428.
       77  FLD0064B                       PIC S9(04)      
                   VALUE +1113.

       77  FLD0065A                       PIC  9(08)V9(02)
                   VALUE  26934154.73.
       77  FLD0065B                       PIC S9(04)      
                   VALUE +1223.

       77  FLD0066A                       PIC  9(01)      
                   VALUE  0.
       77  FLD0066B                       PIC  9(05)V9(27)
                   VALUE  85085.260849998822774153950376785.

       77  FLD0067A                       PIC S9(03)      
                   VALUE -091.
       77  FLD0067B                       PIC S9(01)      
                   VALUE +0.

       77  FLD0068A                       PIC  9(06)V9(25)
                   VALUE  838055.6814082209537986045688739.
       77  FLD0068B                       PIC  9(01)      
                   VALUE  0.

       77  FLD0069A                       PIC  9(10)V9(08)
                   VALUE  4880885916.76487937.
       77  FLD0069B                       PIC  9(03)      
                   VALUE  097.

       77  FLD0070A                       PIC  9(08)V9(18)
                   VALUE  69654747.914044090606466852.
       77  FLD0070B                       PIC S9(06)V9(01)
                   VALUE -192591.5.

       77  FLD0071A                       PIC  9(02)      
                   VALUE  05.
       77  FLD0071B                       PIC  9(04)      
                   VALUE  1269.

       77  FLD0072A                       PIC  9(01)V9(36)
                   VALUE  9.925387953744267965916492357791867107.
       77  FLD0072B                       PIC  9(09)V9(15)
                   VALUE  655377323.717403204028641.

       77  FLD0073A                       PIC  9(01)V9(36)
                   VALUE  9.812328554525302504174533169134519994.
       77  FLD0073B                       PIC  9(08)V9(18)
                   VALUE  70717230.890474991333860543.

       77  FLD0074A                       PIC  9(03)V9(32)
                   VALUE  925.84903592679257400277492706663906.
       77  FLD0074B                       PIC  9(01)V9(36)
                   VALUE  9.839916331263631743553332853480242192.

       77  FLD0075A                       PIC  9(10)V9(10)
                   VALUE  5446083738.8683014381.
       77  FLD0075B                       PIC S9(07)V9(01)
                   VALUE +2205661.8.

       77  FLD0076A                       PIC S9(07)V9(02)
                   VALUE +2412584.18.
       77  FLD0076B                       PIC  9(02)V9(34)
                   VALUE  95.1877730461857529675739897356834262.

       77  FLD0077A                       PIC  9(10)V9(08)
                   VALUE  4971042025.86989840.
       77  FLD0077B                       PIC  9(05)V9(28)
                   VALUE  87747.7884783979700245026833727024.

       77  FLD0078A                       PIC  9(06)V9(01)
                   VALUE  186044.2.
       77  FLD0078B                       PIC  9(10)V9(10)
                   VALUE  5264094377.6727222580.

       77  FLD0079A                       PIC  9(09)V9(15)
                   VALUE  638119223.314542294289708.
       77  FLD0079B                       PIC S9(03)      
                   VALUE +101.

       77  FLD0080A                       PIC  9(07)V9(23)
                   VALUE  7905587.67133311302011122734256.
       77  FLD0080B                       PIC S9(09)V9(04)
                   VALUE -363247849.5626.

       77  FLD0081A                       PIC  9(01)V9(36)
                   VALUE  9.951308658902108250643436804239172488.
       77  FLD0081B                       PIC  9(09)V9(04)
                   VALUE  367206952.3371.

       77  FLD0082A                       PIC S9(08)V9(02)
                   VALUE -26324419.10.
       77  FLD0082B                       PIC  9(07)V9(22)
                   VALUE  7666475.1738066827524420432382.

       77  FLD0083A                       PIC  9(09)V9(14)
                   VALUE  631384121.39469823891602.
       77  FLD0083B                       PIC S9(07)V9(02)
                   VALUE -2518657.33.

       77  FLD0084A                       PIC  9(04)V9(29)
                   VALUE  8913.08379718931953483718189090723.
       77  FLD0084B                       PIC  9(09)V9(06)
                   VALUE  405118244.918866.

       77  FLD0085A                       PIC  9(05)      
                   VALUE  15779.
       77  FLD0085B                       PIC  9(10)V9(06)
                   VALUE  4354227755.611629.

       77  FLD0086A                       PIC  9(01)V9(36)
                   VALUE  9.766547774737049936177868403319735080.
       77  FLD0086B                       PIC  9(10)V9(11)
                   VALUE  5711670223.78104349833.

       77  FLD0087A                       PIC  9(09)V9(14)
                   VALUE  617158605.01368802193411.
       77  FLD0087B                       PIC  9(04)      
                   VALUE  1168.

       77  FLD0088A                       PIC  9(10)V9(12)
                   VALUE  5809468198.000283800652.
       77  FLD0088B                       PIC  9(09)V9(03)
                   VALUE  327927843.481.

       77  FLD0089A                       PIC  9(06)V9(24)
                   VALUE  802942.222446262787727278009697.
       77  FLD0089B                       PIC  9(03)V9(31)
                   VALUE  913.0556640200002682661306607769802.

       77  FLD0090A                       PIC S9(08)V9(02)
                   VALUE -28271627.31.
       77  FLD0090B                       PIC S9(08)V9(03)
                   VALUE -29023436.992.

       77  FLD0091A                       PIC  9(09)V9(07)
                   VALUE  438808038.0901770.
       77  FLD0091B                       PIC  9(08)V9(18)
                   VALUE  69809163.794725925811235356.

       77  FLD0092A                       PIC S9(07)V9(01)
                   VALUE +2146587.0.
       77  FLD0092B                       PIC  9(06)V9(25)
                   VALUE  828676.9901534452031910404912196.

       77  FLD0093A                       PIC  9(06)V9(25)
                   VALUE  831848.6927757260396276706160278.
       77  FLD0093B                       PIC  9(07)V9(23)
                   VALUE  7909193.25337388512409120266966.

       77  FLD0094A                       PIC  9(07)V9(01)
                   VALUE  2260698.5.
       77  FLD0094B                       PIC  9(10)V9(10)
                   VALUE  5308926344.5354850645.

       77  FLD0095A                       PIC  9(07)V9(22)
                   VALUE  7681159.7607563408818265315858.
       77  FLD0095B                       PIC  9(06)V9(25)
                   VALUE  835614.2190518044410296738533361.

       77  FLD0096A                       PIC  9(01)      
                   VALUE  0.
       77  FLD0096B                       PIC  9(05)V9(28)
                   VALUE  87505.3049076218392166026660561328.

       77  FLD0097A                       PIC  9(03)      
                   VALUE  085.
       77  FLD0097B                       PIC  9(07)V9(22)
                   VALUE  7663819.4132902548449948199049.

       77  FLD0098A                       PIC  9(05)V9(28)
                   VALUE  87637.1310136299430659789777564583.
       77  FLD0098B                       PIC  9(08)V9(04)
                   VALUE  33500668.0379.

       77  FLD0099A                       PIC S9(10)V9(08)
                   VALUE -4946809917.70565292.
       77  FLD0099B                       PIC S9(08)V9(03)
                   VALUE +30007106.715.

       77  FLD0100A                       PIC  9(10)V9(09)
                   VALUE  5148281813.288457797.
       77  FLD0100B                       PIC  9(09)V9(14)
                   VALUE  609442213.66168171982735.

       77  FLD0101A                       PIC S9(07)V9(02)
                   VALUE -2605358.58.
       77  FLD0101B                       PIC S9(07)V9(02)
                   VALUE -2515761.93.

       77  FLD0102A                       PIC  9(05)      
                   VALUE  13880.
       77  FLD0102B                       PIC  9(09)V9(14)
                   VALUE  626009568.32775289662151.

       77  FLD0103A                       PIC  9(03)V9(32)
                   VALUE  929.51599988912647631877916865050792.
       77  FLD0103B                       PIC  9(01)      
                   VALUE  0.

       77  FLD0104A                       PIC  9(07)V9(01)
                   VALUE  2254306.3.
       77  FLD0104B                       PIC S9(10)V9(08)
                   VALUE -4810300752.02174334.

       77  FLD0105A                       PIC S9(08)V9(03)
                   VALUE -29081388.428.
       77  FLD0105B                       PIC  9(08)V9(02)
                   VALUE  27558698.77.

       77  FLD0106A                       PIC S9(02)      
                   VALUE -07.
       77  FLD0106B                       PIC S9(08)V9(02)
                   VALUE -26362185.29.

       77  FLD0107A                       PIC  9(09)V9(16)
                   VALUE  677462443.7557797973497031.
       77  FLD0107B                       PIC  9(08)V9(19)
                   VALUE  71705910.5997380985542122289.

       77  FLD0108A                       PIC  9(09)V9(14)
                   VALUE  610210882.31341436003418.
       77  FLD0108B                       PIC S9(08)V9(02)
                   VALUE -28421053.19.

       77  FLD0109A                       PIC S9(04)      
                   VALUE +1136.
       77  FLD0109B                       PIC  9(04)V9(30)
                   VALUE  9020.720262660837374113498299266211.

       77  FLD0110A                       PIC  9(07)V9(23)
                   VALUE  7940109.55673497886841971649118.
       77  FLD0110B                       PIC  9(08)V9(18)
                   VALUE  69721135.284383173313926818.

       77  FLD0111A                       PIC  9(09)V9(03)
                   VALUE  326472185.831.
       77  FLD0111B                       PIC  9(10)V9(09)
                   VALUE  5255901748.964217912.

       77  FLD0112A                       PIC  9(08)V9(19)
                   VALUE  71238052.4624002697819946661.
       77  FLD0112B                       PIC S9(08)V9(02)
                   VALUE -27133920.74.

       77  FLD0113A                       PIC  9(04)V9(30)
                   VALUE  9092.566324157485002643852567416615.
       77  FLD0113B                       PIC  9(04)      
                   VALUE  1277.

       77  FLD0114A                       PIC  9(09)V9(07)
                   VALUE  437805064.1539988.
       77  FLD0114B                       PIC  9(05)V9(01)
                   VALUE  17667.3.

       77  FLD0115A                       PIC  9(02)V9(34)
                   VALUE  96.2362934933669089687668929400388151.
       77  FLD0115B                       PIC S9(08)V9(03)
                   VALUE +30236682.408.

       77  FLD0116A                       PIC  9(07)V9(22)
                   VALUE  7646463.4359510952332783517704.
       77  FLD0116B                       PIC  9(01)      
                   VALUE  0.

       77  FLD0117A                       PIC  9(09)V9(14)
                   VALUE  617509561.34001855346582.
       77  FLD0117B                       PIC  9(05)      
                   VALUE  13612.

       77  FLD0118A                       PIC  9(10)V9(10)
                   VALUE  5408402726.5490597358.
       77  FLD0118B                       PIC S9(03)      
                   VALUE -080.

       77  FLD0119A                       PIC S9(08)V9(03)
                   VALUE +30078875.458.
       77  FLD0119B                       PIC  9(07)V9(02)
                   VALUE  2460449.05.

       77  FLD0120A                       PIC  9(06)V9(25)
                   VALUE  830160.1137616416714593015058198.
       77  FLD0120B                       PIC S9(02)      
                   VALUE -07.

       77  FLD0121A                       PIC S9(07)V9(01)
                   VALUE +2338292.2.
       77  FLD0121B                       PIC S9(09)V9(03)
                   VALUE +320991974.822.

       77  FLD0122A                       PIC S9(06)V9(01)
                   VALUE -184951.8.
       77  FLD0122B                       PIC  9(08)V9(02)
                   VALUE  26752619.72.

       77  FLD0123A                       PIC S9(02)      
                   VALUE -05.
       77  FLD0123B                       PIC  9(07)V9(21)
                   VALUE  7502027.502690824523057244732.

       77  FLD0124A                       PIC  9(01)      
                   VALUE  0.
       77  FLD0124B                       PIC S9(10)V9(06)
                   VALUE +4223876720.963152.

       77  FLD0125A                       PIC  9(04)V9(29)
                   VALUE  8800.31826789913984576685379579430.
       77  FLD0125B                       PIC  9(09)V9(15)
                   VALUE  637787216.045794358443288.

       77  FLD0126A                       PIC  9(06)V9(24)
                   VALUE  807990.071015203703552742808824.
       77  FLD0126B                       PIC  9(07)V9(01)
                   VALUE  2285688.0.

       77  FLD0127A                       PIC  9(04)V9(30)
                   VALUE  8981.860178820127993404298649693373.
       77  FLD0127B                       PIC  9(05)V9(28)
                   VALUE  87878.0390073648609572387613297905.

       77  FLD0128A                       PIC  9(10)V9(06)
                   VALUE  4298489587.591516.
       77  FLD0128B                       PIC  9(08)V9(02)
                   VALUE  26904320.50.

       77  FLD0129A                       PIC S9(08)V9(04)
                   VALUE +33460508.1048.
       77  FLD0129B                       PIC  9(09)V9(14)
                   VALUE  629564859.51748508700376.

       77  FLD0130A                       PIC  9(01)      
                   VALUE  0.
       77  FLD0130B                       PIC  9(08)V9(03)
                   VALUE  30500681.275.

       77  FLD0131A                       PIC  9(08)V9(02)
                   VALUE  26916210.05.
       77  FLD0131B                       PIC  9(08)V9(18)
                   VALUE  70626515.642831921848454612.

       77  FLD0132A                       PIC  9(04)      
                   VALUE  1270.
       77  FLD0132B                       PIC  9(07)V9(01)
                   VALUE  2163498.7.

       77  FLD0133A                       PIC  9(01)V9(36)
                   VALUE  9.890353542063604619372085835493635386.
       77  FLD0133B                       PIC S9(07)V9(02)
                   VALUE -2528421.98.

       77  FLD0134A                       PIC  9(08)V9(18)
                   VALUE  70385499.741438917187252855.
       77  FLD0134B                       PIC  9(09)V9(16)
                   VALUE  673960062.4739148226893803.

       77  FLD0135A                       PIC  9(10)V9(07)
                   VALUE  4678335500.0128495.
       77  FLD0135B                       PIC  9(07)V9(02)
                   VALUE  2561321.97.

       77  FLD0136A                       PIC S9(05)      
                   VALUE -15169.
       77  FLD0136B                       PIC  9(08)V9(19)
                   VALUE  72091249.9695820607747975827.

       77  FLD0137A                       PIC S9(08)V9(02)
                   VALUE -27190319.39.
       77  FLD0137B                       PIC  9(03)V9(32)
                   VALUE  921.23024961283406231160597599227912.

       77  FLD0138A                       PIC S9(10)V9(08)
                   VALUE -4824223828.94490853.
       77  FLD0138B                       PIC  9(04)V9(30)
                   VALUE  8976.142294415691003095503219810780.

       77  FLD0139A                       PIC  9(09)V9(03)
                   VALUE  319644653.394.
       77  FLD0139B                       PIC  9(06)V9(25)
                   VALUE  818318.3537620841718762676464393.

       77  FLD0140A                       PIC S9(01)      
                   VALUE +0.
       77  FLD0140B                       PIC  9(03)V9(31)
                   VALUE  913.4502802484925076953459210926666.

       77  FLD0141A                       PIC  9(09)V9(14)
                   VALUE  612266512.11346116987499.
       77  FLD0141B                       PIC  9(06)V9(01)
                   VALUE  198046.5.

       77  FLD0142A                       PIC  9(09)V9(04)
                   VALUE  356201246.7531.
       77  FLD0142B                       PIC S9(04)      
                   VALUE +1134.

       77  FLD0143A                       PIC S9(07)V9(02)
                   VALUE -2608987.15.
       77  FLD0143B                       PIC  9(06)V9(01)
                   VALUE  205887.8.

       77  FLD0144A                       PIC  9(10)V9(11)
                   VALUE  5664625691.64754570216.
       77  FLD0144B                       PIC  9(07)V9(01)
                   VALUE  2170292.3.

       77  FLD0145A                       PIC  9(09)V9(13)
                   VALUE  592809780.4295365813587.
       77  FLD0145B                       PIC  9(09)V9(06)
                   VALUE  416669902.306984.

       77  FLD0146A                       PIC S9(03)      
                   VALUE -091.
       77  FLD0146B                       PIC  9(09)V9(13)
                   VALUE  592675280.7490164309811.

       77  FLD0147A                       PIC  9(03)      
                   VALUE  085.
       77  FLD0147B                       PIC  9(10)V9(05)
                   VALUE  3974420340.21838.

       77  FLD0148A                       PIC  9(04)      
                   VALUE  1189.
       77  FLD0148B                       PIC  9(08)V9(04)
                   VALUE  33583306.9980.

       77  FLD0149A                       PIC  9(05)V9(27)
                   VALUE  86469.811002464236349140946913394.
       77  FLD0149B                       PIC S9(02)      
                   VALUE -05.

       77  FLD0150A                       PIC S9(02)      
                   VALUE -06.
       77  FLD0150B                       PIC  9(01)V9(36)
                   VALUE  9.779789481524289174174668914929497987.

       77  FLD0151A                       PIC  9(09)V9(13)
                   VALUE  602633749.4884196344102.
       77  FLD0151B                       PIC  9(07)V9(22)
                   VALUE  7715228.5011189425389943608024.

       77  FLD0152A                       PIC S9(08)V9(02)
                   VALUE -28005400.65.
       77  FLD0152B                       PIC  9(02)V9(34)
                   VALUE  96.9689035330467796747200281970435753.

       77  FLD0153A                       PIC  9(08)V9(18)
                   VALUE  69246387.672994647033419823.
       77  FLD0153B                       PIC  9(07)V9(22)
                   VALUE  7700147.9845998110906890588012.

       77  FLD0154A                       PIC  9(09)V9(14)
                   VALUE  618531644.61004783714059.
       77  FLD0154B                       PIC  9(10)V9(07)
                   VALUE  4667533939.9326892.

       77  FLD0155A                       PIC  9(10)V9(12)
                   VALUE  5816028861.286740569980.
       77  FLD0155B                       PIC  9(03)V9(31)
                   VALUE  920.9824083062539967770021576143335.

       77  FLD0156A                       PIC  9(02)V9(34)
                   VALUE  95.3830714078202746009083057288080453.
       77  FLD0156B                       PIC  9(04)V9(30)
                   VALUE  9080.971133779824899789900882751680.

       77  FLD0157A                       PIC  9(09)V9(16)
                   VALUE  659745695.0483697735165833.
       77  FLD0157B                       PIC  9(10)V9(06)
                   VALUE  4359875032.276696.

       77  FLD0158A                       PIC S9(09)V9(06)
                   VALUE +412656981.234114.
       77  FLD0158B                       PIC  9(09)V9(14)
                   VALUE  611832243.66474420197192.

       77  FLD0159A                       PIC  9(01)      
                   VALUE  0.
       77  FLD0159B                       PIC  9(09)V9(15)
                   VALUE  643529357.674236912600918.

       77  FLD0160A                       PIC  9(08)V9(20)
                   VALUE  74656107.83998073429756914265.
       77  FLD0160B                       PIC  9(06)V9(01)
                   VALUE  207077.8.

       77  FLD0161A                       PIC  9(07)V9(22)
                   VALUE  7887170.9741627593626134284932.
       77  FLD0161B                       PIC  9(08)V9(19)
                   VALUE  71702582.3615881408024108623.

       77  FLD0162A                       PIC S9(02)      
                   VALUE -07.
       77  FLD0162B                       PIC  9(10)V9(11)
                   VALUE  5668143857.58160899086.

       77  FLD0163A                       PIC  9(09)V9(14)
                   VALUE  618392824.19829444403802.
       77  FLD0163B                       PIC  9(09)V9(15)
                   VALUE  650815786.826470232817598.

       77  FLD0164A                       PIC S9(06)V9(01)
                   VALUE +204076.7.
       77  FLD0164B                       PIC  9(04)      
                   VALUE  1076.

       77  FLD0165A                       PIC  9(09)V9(14)
                   VALUE  610409164.63927785695631.
       77  FLD0165B                       PIC  9(04)      
                   VALUE  1267.

       77  FLD0166A                       PIC  9(07)V9(02)
                   VALUE  2460589.98.
       77  FLD0166B                       PIC  9(05)V9(01)
                   VALUE  17630.0.

       77  FLD0167A                       PIC S9(09)V9(03)
                   VALUE +323253458.962.
       77  FLD0167B                       PIC  9(06)V9(25)
                   VALUE  838285.1322478405142746282763255.

       77  FLD0168A                       PIC S9(04)      
                   VALUE +1200.
       77  FLD0168B                       PIC S9(10)V9(06)
                   VALUE +4326937205.661665.

       77  FLD0169A                       PIC  9(06)V9(25)
                   VALUE  834885.7368063762329768451309064.
       77  FLD0169B                       PIC  9(08)V9(18)
                   VALUE  70699865.109667991980302304.

       77  FLD0170A                       PIC  9(08)V9(19)
                   VALUE  72325482.4666709539293663056.
       77  FLD0170B                       PIC  9(01)V9(36)
                   VALUE  9.863493423765207213094186045054811984.

       77  FLD0171A                       PIC  9(09)V9(16)
                   VALUE  675345293.4675296948086042.
       77  FLD0171B                       PIC  9(10)V9(06)
                   VALUE  4258478422.558273.

       77  FLD0172A                       PIC  9(02)V9(34)
                   VALUE  96.0216523360032936373897882731398567.
       77  FLD0172B                       PIC  9(04)V9(30)
                   VALUE  8999.798406174591702821885519369971.

       77  FLD0173A                       PIC S9(09)V9(06)
                   VALUE +412472914.336663.
       77  FLD0173B                       PIC  9(10)V9(08)
                   VALUE  4786981213.45750904.

       77  FLD0174A                       PIC S9(04)      
                   VALUE +1244.
       77  FLD0174B                       PIC  9(10)V9(09)
                   VALUE  5152586737.087611057.

       77  FLD0175A                       PIC S9(05)      
                   VALUE +13456.
       77  FLD0175B                       PIC S9(02)      
                   VALUE -05.

       77  FLD0176A                       PIC  9(07)V9(23)
                   VALUE  7902178.74582138546379894705751.
       77  FLD0176B                       PIC  9(08)V9(03)
                   VALUE  29797398.003.

       77  FLD0177A                       PIC  9(07)V9(21)
                   VALUE  7618839.577049143496623173632.
       77  FLD0177B                       PIC  9(07)V9(02)
                   VALUE  2373414.07.

       77  FLD0178A                       PIC  9(09)V9(04)
                   VALUE  355502105.3348.
       77  FLD0178B                       PIC S9(08)V9(03)
                   VALUE +31397739.222.

       77  FLD0179A                       PIC  9(09)V9(05)
                   VALUE  388560564.63472.
       77  FLD0179B                       PIC  9(03)      
                   VALUE  099.

       77  FLD0180A                       PIC  9(05)V9(27)
                   VALUE  85946.157652659294079455776227405.
       77  FLD0180B                       PIC  9(10)V9(10)
                   VALUE  5435189439.3573940700.

       77  FLD0181A                       PIC  9(06)V9(01)
                   VALUE  188908.8.
       77  FLD0181B                       PIC S9(10)V9(08)
                   VALUE -4740924741.33910868.

       77  FLD0182A                       PIC  9(10)V9(13)
                   VALUE  6061401860.3468300394609.
       77  FLD0182B                       PIC  9(09)V9(15)
                   VALUE  643493508.008180281620980.

       77  FLD0183A                       PIC  9(07)V9(23)
                   VALUE  7910108.10526126539876656806882.
       77  FLD0183B                       PIC S9(02)      
                   VALUE -05.

       77  FLD0184A                       PIC  9(09)V9(15)
                   VALUE  635945742.812533687526865.
       77  FLD0184B                       PIC S9(07)V9(01)
                   VALUE +2343773.6.

       77  FLD0185A                       PIC  9(05)      
                   VALUE  15666.
       77  FLD0185B                       PIC  9(08)V9(20)
                   VALUE  73935660.38753716096465495866.

       77  FLD0186A                       PIC  9(02)      
                   VALUE  07.
       77  FLD0186B                       PIC  9(05)V9(26)
                   VALUE  84084.08947119312415452441200613.

       77  FLD0187A                       PIC  9(09)V9(13)
                   VALUE  604672028.7423602568921.
       77  FLD0187B                       PIC  9(10)V9(12)
                   VALUE  5893278013.192120301511.

       77  FLD0188A                       PIC  9(08)V9(17)
                   VALUE  68008236.87569536035724127.
       77  FLD0188B                       PIC  9(07)V9(21)
                   VALUE  7537078.198448752264226868646.

       77  FLD0189A                       PIC  9(10)V9(09)
                   VALUE  5115071016.238050827.
       77  FLD0189B                       PIC  9(10)V9(11)
                   VALUE  5668524677.20726727051.

       77  FLD0190A                       PIC  9(07)V9(02)
                   VALUE  2382137.54.
       77  FLD0190B                       PIC  9(09)V9(14)
                   VALUE  627148648.94273569806415.

       77  FLD0191A                       PIC  9(05)      
                   VALUE  13720.
       77  FLD0191B                       PIC  9(06)V9(24)
                   VALUE  803717.168989411478996487403492.

       77  FLD0192A                       PIC  9(01)V9(36)
                   VALUE  9.894259454195439840162862310535274446.
       77  FLD0192B                       PIC  9(09)V9(04)
                   VALUE  358034239.3955.

       77  FLD0193A                       PIC  9(10)V9(06)
                   VALUE  4252943677.090519.
       77  FLD0193B                       PIC  9(09)V9(14)
                   VALUE  612048644.17243076690766.

       77  FLD0194A                       PIC  9(09)V9(06)
                   VALUE  417168379.939779.
       77  FLD0194B                       PIC  9(09)V9(15)
                   VALUE  634454032.998696626499679.

       77  FLD0195A                       PIC  9(08)V9(02)
                   VALUE  26645846.45.
       77  FLD0195B                       PIC  9(05)      
                   VALUE  14921.

       77  FLD0196A                       PIC  9(01)      
                   VALUE  0.
       77  FLD0196B                       PIC S9(05)V9(01)
                   VALUE -18000.7.

       77  FLD0197A                       PIC  9(01)V9(36)
                   VALUE  9.847788375924405590566834689525421708.
       77  FLD0197B                       PIC  9(02)      
                   VALUE  05.

       77  FLD0198A                       PIC  9(09)V9(13)
                   VALUE  593293108.5591157671643.
       77  FLD0198B                       PIC S9(05)      
                   VALUE +14072.

       77  FLD0199A                       PIC  9(07)V9(02)
                   VALUE  2483287.24.
       77  FLD0199B                       PIC  9(07)V9(23)
                   VALUE  7969040.17410605347571106449322.

       77  FLD0200A                       PIC S9(10)V9(08)
                   VALUE -4935972790.60619176.
       77  FLD0200B                       PIC  9(10)V9(07)
                   VALUE  4582475224.7206340.

       77  FLD0201A                       PIC  9(04)      
                   VALUE  1282.
       77  FLD0201B                       PIC  9(07)V9(23)
                   VALUE  7926313.90444417882612526682351.

       77  FLD0202A                       PIC S9(09)V9(04)
                   VALUE -360603443.7503.
       77  FLD0202B                       PIC  9(03)V9(32)
                   VALUE  935.68197555010013122256395945441909.

       77  FLD0203A                       PIC  9(09)V9(14)
                   VALUE  628607663.38264040253847.
       77  FLD0203B                       PIC  9(03)V9(31)
                   VALUE  920.1886012491730104656539879215415.

       77  FLD0204A                       PIC  9(01)V9(35)
                   VALUE  9.73054030732718233664968465745914727.
       77  FLD0204B                       PIC  9(07)V9(01)
                   VALUE  2363275.3.

       77  FLD0205A                       PIC  9(09)V9(15)
                   VALUE  648926914.508991536933990.
       77  FLD0205B                       PIC  9(09)V9(15)
                   VALUE  639814213.238647178094709.

       77  FLD0206A                       PIC  9(06)V9(01)
                   VALUE  186967.7.
       77  FLD0206B                       PIC  9(08)V9(18)
                   VALUE  70826356.466434425840361654.

       77  FLD0207A                       PIC  9(05)V9(26)
                   VALUE  83944.39242287422553445708217623.
       77  FLD0207B                       PIC  9(07)V9(21)
                   VALUE  7607846.993308088334728722657.

       77  FLD0208A                       PIC  9(02)V9(34)
                   VALUE  96.7940040016311842308027735271025449.
       77  FLD0208B                       PIC  9(07)V9(01)
                   VALUE  2151595.4.

       77  FLD0209A                       PIC  9(03)V9(32)
                   VALUE  926.61149050802726900855077474261634.
       77  FLD0209B                       PIC  9(07)V9(23)
                   VALUE  7951784.48263920700789242346218.

       77  FLD0210A                       PIC  9(08)V9(19)
                   VALUE  72323528.1456575562764044207.
       77  FLD0210B                       PIC  9(01)      
                   VALUE  0.

       77  FLD0211A                       PIC  9(01)      
                   VALUE  0.
       77  FLD0211B                       PIC S9(09)V9(07)
                   VALUE +442113770.7554604.

       77  FLD0212A                       PIC  9(10)V9(08)
                   VALUE  4892032792.55731038.
       77  FLD0212B                       PIC S9(09)V9(05)
                   VALUE -372935567.70682.

       77  FLD0213A                       PIC S9(03)      
                   VALUE -082.
       77  FLD0213B                       PIC  9(07)V9(21)
                   VALUE  7525721.770631302875997903356.

       77  FLD0214A                       PIC  9(01)      
                   VALUE  0.
       77  FLD0214B                       PIC  9(09)V9(16)
                   VALUE  666893270.4655321508369070.

       77  FLD0215A                       PIC  9(03)V9(32)
                   VALUE  926.34033699271633999217101518297567.
       77  FLD0215B                       PIC S9(05)V9(01)
                   VALUE -18226.5.

       77  FLD0216A                       PIC S9(08)V9(02)
                   VALUE -28095374.87.
       77  FLD0216B                       PIC  9(08)V9(02)
                   VALUE  28541793.87.

       77  FLD0217A                       PIC  9(08)V9(20)
                   VALUE  74562962.48658396130792880285.
       77  FLD0217B                       PIC S9(09)V9(07)
                   VALUE +444563659.0422049.

       77  FLD0218A                       PIC S9(05)V9(01)
                   VALUE -18094.6.
       77  FLD0218B                       PIC  9(01)V9(36)
                   VALUE  9.867255193327033602201936446363106369.

       77  FLD0219A                       PIC  9(09)V9(12)
                   VALUE  578788992.127507229135.
       77  FLD0219B                       PIC  9(10)V9(10)
                   VALUE  5297903516.0907261836.

       77  FLD0220A                       PIC  9(09)V9(12)
                   VALUE  573343525.907533679841.
       77  FLD0220B                       PIC S9(05)      
                   VALUE +14161.

       77  FLD0221A                       PIC  9(01)      
                   VALUE  0.
       77  FLD0221B                       PIC  9(04)V9(29)
                   VALUE  8789.10367794605407176788958167890.

       77  FLD0222A                       PIC  9(09)V9(14)
                   VALUE  628182805.25174396977661.
       77  FLD0222B                       PIC S9(05)      
                   VALUE -15228.

       77  FLD0223A                       PIC  9(01)      
                   VALUE  0.
       77  FLD0223B                       PIC  9(08)V9(18)
                   VALUE  69950927.082806102497158917.

       77  FLD0224A                       PIC  9(06)V9(25)
                   VALUE  838187.2267509891116787912324070.
       77  FLD0224B                       PIC S9(09)V9(05)
                   VALUE -382169497.04991.

       77  FLD0225A                       PIC  9(05)      
                   VALUE  13797.
       77  FLD0225B                       PIC  9(09)V9(12)
                   VALUE  572598612.808938978169.

       77  FLD0226A                       PIC  9(05)      
                   VALUE  14900.
       77  FLD0226B                       PIC S9(07)V9(01)
                   VALUE +2129995.4.

       77  FLD0227A                       PIC  9(09)V9(14)
                   VALUE  629583055.15940859997670.
       77  FLD0227B                       PIC  9(04)V9(30)
                   VALUE  8983.577034983017961522477889957372.

       77  FLD0228A                       PIC S9(07)V9(01)
                   VALUE +2225916.3.
       77  FLD0228B                       PIC  9(01)V9(36)
                   VALUE  9.739690596877397243957830141880549490.

       77  FLD0229A                       PIC  9(01)V9(36)
                   VALUE  9.870473603260505601753038718015886843.
       77  FLD0229B                       PIC  9(08)V9(20)
                   VALUE  73838029.76208535540081356884.

       77  FLD0230A                       PIC S9(06)V9(01)
                   VALUE +201492.2.
       77  FLD0230B                       PIC S9(02)      
                   VALUE -06.

       77  FLD0231A                       PIC  9(05)V9(28)
                   VALUE  87781.6812716511907233041256404248.
       77  FLD0231B                       PIC S9(08)V9(02)
                   VALUE -27182116.43.

       77  FLD0232A                       PIC  9(09)V9(04)
                   VALUE  356308264.5328.
       77  FLD0232B                       PIC  9(06)V9(25)
                   VALUE  833280.3014261945806495646138500.

       77  FLD0233A                       PIC  9(07)V9(21)
                   VALUE  7552156.809035388551620826547.
       77  FLD0233B                       PIC  9(08)V9(04)
                   VALUE  33739768.3403.

       77  FLD0234A                       PIC  9(08)V9(04)
                   VALUE  33831052.6754.
       77  FLD0234B                       PIC  9(09)V9(13)
                   VALUE  593899144.9424572133253.

       77  FLD0235A                       PIC S9(05)      
                   VALUE +14123.
       77  FLD0235B                       PIC S9(10)V9(08)
                   VALUE -4808329310.19295639.

       77  FLD0236A                       PIC  9(04)V9(29)
                   VALUE  8818.23528289915170574886360554955.
       77  FLD0236B                       PIC  9(08)V9(18)
                   VALUE  70480160.116860446350983693.

       77  FLD0237A                       PIC  9(08)V9(02)
                   VALUE  28742037.59.
       77  FLD0237B                       PIC  9(04)V9(29)
                   VALUE  8850.90488581330880890618573175743.

       77  FLD0238A                       PIC  9(09)V9(15)
                   VALUE  634521096.430120334908053.
       77  FLD0238B                       PIC  9(06)V9(01)
                   VALUE  198396.3.

       77  FLD0239A                       PIC  9(09)V9(16)
                   VALUE  678585779.2924817610824561.
       77  FLD0239B                       PIC  9(09)V9(14)
                   VALUE  614739880.97122655993587.

       77  FLD0240A                       PIC  9(10)V9(06)
                   VALUE  4289853576.446766.
       77  FLD0240B                       PIC  9(06)V9(25)
                   VALUE  833165.4817075836438888813972880.

       77  FLD0241A                       PIC S9(05)      
                   VALUE +14407.
       77  FLD0241B                       PIC  9(09)V9(14)
                   VALUE  608742950.23205993171444.

       77  FLD0242A                       PIC  9(10)V9(12)
                   VALUE  5860383854.989427154791.
       77  FLD0242B                       PIC S9(06)V9(01)
                   VALUE +201770.8.

       77  FLD0243A                       PIC  9(02)V9(34)
                   VALUE  97.0409660969254295181940506154205650.
       77  FLD0243B                       PIC  9(05)V9(28)
                   VALUE  86928.4847432245544318618613033322.

       77  FLD0244A                       PIC S9(01)      
                   VALUE +0.
       77  FLD0244B                       PIC  9(09)V9(13)
                   VALUE  596454149.7067354924865.

       77  FLD0245A                       PIC S9(09)V9(05)
                   VALUE -371716886.14542.
       77  FLD0245B                       PIC  9(09)V9(15)
                   VALUE  636050719.355519267317333.

       77  FLD0246A                       PIC  9(05)V9(28)
                   VALUE  87216.9313623637143528810611314838.
       77  FLD0246B                       PIC  9(06)V9(01)
                   VALUE  208199.5.

       77  FLD0247A                       PIC  9(06)V9(25)
                   VALUE  834494.8214770686600871840710169.
       77  FLD0247B                       PIC  9(08)V9(19)
                   VALUE  73372232.8570783122181353519.

       77  FLD0248A                       PIC  9(04)V9(29)
                   VALUE  8885.56418584546814365410227765096.
       77  FLD0248B                       PIC  9(10)V9(11)
                   VALUE  5683594830.11341870550.

       77  FLD0249A                       PIC  9(09)V9(16)
                   VALUE  678470839.5950102000071524.
       77  FLD0249B                       PIC  9(09)V9(16)
                   VALUE  673175418.3146980707874718.

       77  FLD0250A                       PIC  9(09)V9(15)
                   VALUE  643468324.926731005675151.
       77  FLD0250B                       PIC  9(04)V9(30)
                   VALUE  9057.675398841628089385835664870683.

       77  FLD0251A                       PIC S9(09)V9(06)
                   VALUE +402548910.007195.
       77  FLD0251B                       PIC  9(06)V9(25)
                   VALUE  830149.1080513825338016431487631.

       77  FLD0252A                       PIC S9(05)V9(01)
                   VALUE -18339.3.
       77  FLD0252B                       PIC S9(07)V9(01)
                   VALUE +2343087.3.

       77  FLD0253A                       PIC  9(06)V9(25)
                   VALUE  822593.8518184680026124055984837.
       77  FLD0253B                       PIC  9(07)V9(01)
                   VALUE  2159897.7.

       77  FLD0254A                       PIC  9(10)V9(10)
                   VALUE  5401895692.3872574193.
       77  FLD0254B                       PIC S9(07)V9(02)
                   VALUE +2405256.16.

       77  FLD0255A                       PIC  9(02)V9(34)
                   VALUE  94.8299297085154591080424779647728428.
       77  FLD0255B                       PIC  9(10)V9(10)
                   VALUE  5408143412.7739858030.

       77  FLD0256A                       PIC S9(09)V9(08)
                   VALUE -473179644.06591722.
       77  FLD0256B                       PIC  9(04)V9(30)
                   VALUE  9107.434804383051085707734273455571.

       77  FLD0257A                       PIC  9(09)V9(12)
                   VALUE  577029491.737192756772.
       77  FLD0257B                       PIC S9(03)      
                   VALUE -084.

       77  FLD0258A                       PIC  9(10)V9(12)
                   VALUE  5908893351.960881057394.
       77  FLD0258B                       PIC  9(05)V9(27)
                   VALUE  84978.202175808337237583600654033.

       77  FLD0259A                       PIC  9(03)V9(32)
                   VALUE  937.55337057593879368511124994256533.
       77  FLD0259B                       PIC S9(09)V9(05)
                   VALUE -374669242.27931.

       77  FLD0260A                       PIC  9(05)V9(27)
                   VALUE  86648.984966754782899300835197209.
       77  FLD0260B                       PIC  9(09)V9(13)
                   VALUE  601823310.0433563187436.

       77  FLD0261A                       PIC S9(09)V9(05)
                   VALUE -374213925.47904.
       77  FLD0261B                       PIC  9(09)V9(05)
                   VALUE  379885544.06227.

       77  FLD0262A                       PIC S9(05)V9(01)
                   VALUE -17015.9.
       77  FLD0262B                       PIC  9(09)V9(17)
                   VALUE  687559565.36759821329241049.

       77  FLD0263A                       PIC  9(05)V9(26)
                   VALUE  84046.29767805690265802809335582.
       77  FLD0263B                       PIC S9(02)      
                   VALUE -06.

       77  FLD0264A                       PIC  9(03)V9(32)
                   VALUE  935.78568596491340514376133796758949.
       77  FLD0264B                       PIC  9(05)V9(01)
                   VALUE  17620.4.

       77  FLD0265A                       PIC S9(09)V9(05)
                   VALUE -380334582.15301.
       77  FLD0265B                       PIC  9(01)V9(36)
                   VALUE  9.854231270822284560750858872779645025.

       77  FLD0266A                       PIC  9(05)V9(27)
                   VALUE  84707.693570856212872399737534578.
       77  FLD0266B                       PIC  9(02)V9(34)
                   VALUE  96.1883348354436562566149859776487573.

       77  FLD0267A                       PIC  9(03)      
                   VALUE  087.
       77  FLD0267B                       PIC S9(07)V9(01)
                   VALUE +2348814.4.

       77  FLD0268A                       PIC S9(01)      
                   VALUE -0.
       77  FLD0268B                       PIC  9(06)V9(25)
                   VALUE  821150.0957830146774085733341053.

       77  FLD0269A                       PIC  9(08)V9(18)
                   VALUE  69955495.182247551255727557.
       77  FLD0269B                       PIC  9(01)      
                   VALUE  0.

       77  FLD0270A                       PIC  9(08)V9(18)
                   VALUE  69584936.933990082508216801.
       77  FLD0270B                       PIC S9(04)      
                   VALUE +1200.

       77  FLD0271A                       PIC  9(10)V9(07)
                   VALUE  4478155927.4435323.
       77  FLD0271B                       PIC  9(07)V9(02)
                   VALUE  2371664.59.

       77  FLD0272A                       PIC S9(09)V9(06)
                   VALUE +411514667.070764.
       77  FLD0272B                       PIC S9(10)V9(08)
                   VALUE -4748492295.95657285.

       77  FLD0273A                       PIC  9(10)V9(07)
                   VALUE  4698099460.5024867.
       77  FLD0273B                       PIC S9(10)V9(06)
                   VALUE +4338009792.593093.

       77  FLD0274A                       PIC  9(07)V9(01)
                   VALUE  2190249.4.
       77  FLD0274B                       PIC  9(10)V9(10)
                   VALUE  5271665070.2586675958.

       77  FLD0275A                       PIC  9(04)      
                   VALUE  1157.
       77  FLD0275B                       PIC S9(07)V9(02)
                   VALUE +2422980.94.

       77  FLD0276A                       PIC  9(04)V9(30)
                   VALUE  9021.044697283423507983002309629227.
       77  FLD0276B                       PIC  9(02)V9(33)
                   VALUE  94.591784695476577304873444518307223.

       77  FLD0277A                       PIC  9(01)V9(36)
                   VALUE  9.749582162084949876756923003995325416.
       77  FLD0277B                       PIC  9(10)V9(08)
                   VALUE  4992154586.01645512.

       77  FLD0278A                       PIC  9(10)V9(06)
                   VALUE  4251062706.993476.
       77  FLD0278B                       PIC  9(03)V9(31)
                   VALUE  914.7657257947739983805490737722720.

       77  FLD0279A                       PIC S9(08)V9(02)
                   VALUE -27159201.10.
       77  FLD0279B                       PIC  9(03)V9(32)
                   VALUE  921.08160397424898579998853165307082.

       77  FLD0280A                       PIC  9(07)V9(02)
                   VALUE  2571968.92.
       77  FLD0280B                       PIC  9(08)V9(19)
                   VALUE  71229222.1254675839148262639.

       77  FLD0281A                       PIC S9(09)V9(04)
                   VALUE +342861689.3811.
       77  FLD0281B                       PIC  9(10)V9(07)
                   VALUE  4662459797.7205073.

       77  FLD0282A                       PIC S9(10)V9(07)
                   VALUE -4600147325.4430291.
       77  FLD0282B                       PIC  9(07)V9(22)
                   VALUE  7889304.3658446049271049105300.

       77  FLD0283A                       PIC  9(01)      
                   VALUE  0.
       77  FLD0283B                       PIC S9(05)V9(01)
                   VALUE -18273.9.

       77  FLD0284A                       PIC  9(09)V9(17)
                   VALUE  689733171.20512533939802324.
       77  FLD0284B                       PIC  9(01)      
                   VALUE  0.

       77  FLD0285A                       PIC  9(03)V9(32)
                   VALUE  928.78828230193799520009179104818031.
       77  FLD0285B                       PIC  9(08)V9(20)
                   VALUE  73692142.62351649891158444916.

       77  FLD0286A                       PIC  9(08)V9(18)
                   VALUE  70426964.322731444578806758.
       77  FLD0286B                       PIC  9(07)V9(01)
                   VALUE  2181620.7.

       77  FLD0287A                       PIC S9(07)V9(02)
                   VALUE -2521413.84.
       77  FLD0287B                       PIC  9(06)      
                   VALUE  158585.

       77  FLD0288A                       PIC  9(09)V9(17)
                   VALUE  688074525.02240640246355951.
       77  FLD0288B                       PIC  9(04)V9(29)
                   VALUE  8936.92752615119712089608583482913.

       77  FLD0289A                       PIC S9(03)      
                   VALUE -092.
       77  FLD0289B                       PIC  9(10)V9(11)
                   VALUE  5676330984.14293657540.

       77  FLD0290A                       PIC S9(09)V9(05)
                   VALUE -382951207.35442.
       77  FLD0290B                       PIC S9(03)      
                   VALUE -094.

       77  FLD0291A                       PIC  9(01)V9(36)
                   VALUE  9.859384124391753490002088256005663424.
       77  FLD0291B                       PIC  9(06)V9(25)
                   VALUE  830008.1335268413296191170047677.

       77  FLD0292A                       PIC S9(08)V9(03)
                   VALUE +31020519.916.
       77  FLD0292B                       PIC  9(01)      
                   VALUE  0.

       77  FLD0293A                       PIC S9(03)      
                   VALUE -093.
       77  FLD0293B                       PIC  9(08)V9(03)
                   VALUE  30744484.924.

       77  FLD0294A                       PIC S9(09)V9(06)
                   VALUE +412445339.504106.
       77  FLD0294B                       PIC  9(01)      
                   VALUE  0.

       77  FLD0295A                       PIC S9(07)V9(02)
                   VALUE -2502548.06.
       77  FLD0295B                       PIC S9(07)V9(01)
                   VALUE +2138373.7.

       77  FLD0296A                       PIC S9(06)      
                   VALUE -160918.
       77  FLD0296B                       PIC  9(09)V9(12)
                   VALUE  574303107.736577889141.

       77  FLD0297A                       PIC  9(08)V9(03)
                   VALUE  30843552.269.
       77  FLD0297B                       PIC  9(10)V9(09)
                   VALUE  5180156945.333709295.

       77  FLD0298A                       PIC S9(10)V9(08)
                   VALUE -4831587379.88150510.
       77  FLD0298B                       PIC  9(01)V9(36)
                   VALUE  9.983859909908295859892746193509083241.

       77  FLD0299A                       PIC  9(10)V9(13)
                   VALUE  6064872573.5835784522720.
       77  FLD0299B                       PIC  9(09)V9(16)
                   VALUE  669818284.8844781434038964.

       77  FLD0300A                       PIC  9(08)V9(20)
                   VALUE  73956142.30661028409841151187.
       77  FLD0300B                       PIC  9(09)V9(14)
                   VALUE  624082886.12038953502292.

       77  FLD0301A                       PIC S9(10)V9(07)
                   VALUE -4524568495.0704084.
       77  FLD0301B                       PIC S9(01)      
                   VALUE +0.

       77  FLD0302A                       PIC  9(02)V9(34)
                   VALUE  94.9764690231816866017311440373305231.
       77  FLD0302B                       PIC  9(10)V9(06)
                   VALUE  4291773437.216153.

       77  FLD0303A                       PIC  9(01)V9(36)
                   VALUE  9.998247249142951931233369577967096120.
       77  FLD0303B                       PIC  9(01)      
                   VALUE  0.

       77  FLD0304A                       PIC S9(03)      
                   VALUE -083.
       77  FLD0304B                       PIC  9(10)V9(11)
                   VALUE  5565734306.84127234968.

       77  FLD0305A                       PIC  9(09)V9(03)
                   VALUE  328435884.788.
       77  FLD0305B                       PIC S9(01)      
                   VALUE +0.

       77  FLD0306A                       PIC S9(03)      
                   VALUE -083.
       77  FLD0306B                       PIC S9(10)V9(08)
                   VALUE -4936418970.17687181.

       77  FLD0307A                       PIC  9(10)V9(10)
                   VALUE  5430567751.9659767416.
       77  FLD0307B                       PIC  9(03)V9(32)
                   VALUE  928.08547489686554765597747973515652.

       77  FLD0308A                       PIC  9(09)V9(05)
                   VALUE  377189267.62120.
       77  FLD0308B                       PIC  9(02)V9(34)
                   VALUE  96.4274365663057242414879510761238634.

       77  FLD0309A                       PIC  9(09)V9(03)
                   VALUE  325461096.612.
       77  FLD0309B                       PIC S9(03)      
                   VALUE -093.

       77  FLD0310A                       PIC  9(09)V9(05)
                   VALUE  377541451.37210.
       77  FLD0310B                       PIC  9(09)V9(06)
                   VALUE  416709099.760976.

       77  FLD0311A                       PIC S9(02)      
                   VALUE -06.
       77  FLD0311B                       PIC  9(01)V9(36)
                   VALUE  9.931117203050255914931199185957666486.

       77  FLD0312A                       PIC S9(10)V9(07)
                   VALUE -4631183834.9707568.
       77  FLD0312B                       PIC  9(01)      
                   VALUE  0.

       77  FLD0313A                       PIC  9(05)V9(27)
                   VALUE  86493.365621715367907995641871821.
       77  FLD0313B                       PIC  9(09)V9(05)
                   VALUE  375066571.23058.

       77  FLD0314A                       PIC  9(03)      
                   VALUE  088.
       77  FLD0314B                       PIC  9(08)V9(18)
                   VALUE  69720866.107690404600560896.

       77  FLD0315A                       PIC  9(07)V9(23)
                   VALUE  7933336.74589681625555215305212.
       77  FLD0315B                       PIC  9(09)V9(17)
                   VALUE  688307785.43204196306959374.

       77  FLD0316A                       PIC  9(06)V9(01)
                   VALUE  195827.4.
       77  FLD0316B                       PIC  9(10)V9(11)
                   VALUE  5611864585.06384822086.

       77  FLD0317A                       PIC  9(10)V9(08)
                   VALUE  4983225307.65216153.
       77  FLD0317B                       PIC S9(09)V9(03)
                   VALUE +331361572.492.

       77  FLD0318A                       PIC  9(08)V9(02)
                   VALUE  26926374.69.
       77  FLD0318B                       PIC  9(04)V9(29)
                   VALUE  8825.34717446214034275442372745601.

       77  FLD0319A                       PIC  9(08)V9(18)
                   VALUE  69931441.978879860243978328.
       77  FLD0319B                       PIC  9(09)V9(15)
                   VALUE  650439668.121860714578019.

       77  FLD0320A                       PIC  9(08)V9(19)
                   VALUE  71973495.8824565840274090078.
       77  FLD0320B                       PIC  9(10)V9(11)
                   VALUE  5542215777.53993832615.

       77  FLD0321A                       PIC  9(10)V9(09)
                   VALUE  5005504874.853489161.
       77  FLD0321B                       PIC  9(09)V9(16)
                   VALUE  660163921.0521921263818967.

       77  FLD0322A                       PIC S9(09)V9(07)
                   VALUE +442005310.2249054.
       77  FLD0322B                       PIC  9(09)V9(14)
                   VALUE  617916374.92097983841432.

       77  FLD0323A                       PIC S9(05)      
                   VALUE -15097.
       77  FLD0323B                       PIC  9(01)V9(35)
                   VALUE  9.73366140153258840861383305309573188.

       77  FLD0324A                       PIC  9(10)V9(11)
                   VALUE  5601604504.75820970162.
       77  FLD0324B                       PIC  9(10)V9(10)
                   VALUE  5319146871.9734047443.

       77  FLD0325A                       PIC  9(04)      
                   VALUE  1169.
       77  FLD0325B                       PIC  9(08)V9(19)
                   VALUE  72332591.2353324218528882738.

       77  FLD0326A                       PIC S9(08)V9(03)
                   VALUE +31312044.720.
       77  FLD0326B                       PIC S9(02)      
                   VALUE -05.

       77  FLD0327A                       PIC S9(03)      
                   VALUE -090.
       77  FLD0327B                       PIC S9(07)V9(01)
                   VALUE +2122536.7.

       77  FLD0328A                       PIC  9(08)V9(19)
                   VALUE  71147504.7716873310044150002.
       77  FLD0328B                       PIC S9(09)V9(05)
                   VALUE -393175029.86891.

       77  FLD0329A                       PIC S9(01)      
                   VALUE +0.
       77  FLD0329B                       PIC  9(02)V9(34)
                   VALUE  95.2096907591406971249625712516717612.

       77  FLD0330A                       PIC  9(09)V9(07)
                   VALUE  445280746.1581723.
       77  FLD0330B                       PIC  9(07)V9(23)
                   VALUE  7955244.25555017788980194382020.

       77  FLD0331A                       PIC S9(07)V9(01)
                   VALUE +2232816.8.
       77  FLD0331B                       PIC  9(08)V9(02)
                   VALUE  27670053.03.

       77  FLD0332A                       PIC  9(05)V9(27)
                   VALUE  86562.988696340348315771962006692.
       77  FLD0332B                       PIC  9(09)V9(04)
                   VALUE  355930982.9079.

       77  FLD0333A                       PIC  9(02)V9(34)
                   VALUE  95.6494138775326296908474432711955159.
       77  FLD0333B                       PIC S9(07)V9(02)
                   VALUE +2431333.31.

       77  FLD0334A                       PIC  9(08)V9(03)
                   VALUE  28999492.466.
       77  FLD0334B                       PIC  9(09)V9(03)
                   VALUE  326043905.981.

       77  FLD0335A                       PIC S9(08)V9(03)
                   VALUE +30334218.791.
       77  FLD0335B                       PIC  9(10)V9(09)
                   VALUE  5075855226.668805064.

       77  FLD0336A                       PIC  9(05)V9(27)
                   VALUE  85800.255545984371874368434873758.
       77  FLD0336B                       PIC S9(08)V9(03)
                   VALUE -29245898.644.

       77  FLD0337A                       PIC  9(08)V9(19)
                   VALUE  72003996.5448931451597047725.
       77  FLD0337B                       PIC  9(08)V9(19)
                   VALUE  71409231.4076567258318561925.

       77  FLD0338A                       PIC S9(01)      
                   VALUE -0.
       77  FLD0338B                       PIC  9(10)V9(10)
                   VALUE  5304768900.0456310637.

       77  FLD0339A                       PIC S9(06)      
                   VALUE -160552.
       77  FLD0339B                       PIC  9(09)V9(13)
                   VALUE  594533435.7259434154840.

       77  FLD0340A                       PIC  9(10)V9(09)
                   VALUE  5028381651.473269320.
       77  FLD0340B                       PIC S9(09)V9(04)
                   VALUE -361499697.6055.

       77  FLD0341A                       PIC  9(10)V9(11)
                   VALUE  5676316159.01010966318.
       77  FLD0341B                       PIC  9(09)V9(12)
                   VALUE  572076310.146404809486.

       77  FLD0342A                       PIC S9(07)V9(01)
                   VALUE +2347143.0.
       77  FLD0342B                       PIC S9(10)V9(07)
                   VALUE -4530575977.8135124.

       77  FLD0343A                       PIC  9(08)V9(19)
                   VALUE  72866356.1504289902792663724.
       77  FLD0343B                       PIC  9(06)V9(01)
                   VALUE  195736.6.

       77  FLD0344A                       PIC  9(09)V9(07)
                   VALUE  439744878.9947105.
       77  FLD0344B                       PIC  9(04)V9(29)
                   VALUE  8815.39565612843856179381418769480.

       77  FLD0345A                       PIC  9(01)      
                   VALUE  0.
       77  FLD0345B                       PIC  9(09)V9(06)
                   VALUE  405441574.894889.

       77  FLD0346A                       PIC  9(07)V9(22)
                   VALUE  7807860.0333687642187641131386.
       77  FLD0346B                       PIC  9(09)V9(16)
                   VALUE  674345587.8778652490268541.

       77  FLD0347A                       PIC  9(08)V9(18)
                   VALUE  70165985.253748408556617732.
       77  FLD0347B                       PIC  9(06)      
                   VALUE  158396.

       77  FLD0348A                       PIC  9(08)V9(04)
                   VALUE  33778742.7133.
       77  FLD0348B                       PIC  9(09)V9(12)
                   VALUE  575387126.330844100863.

       77  FLD0349A                       PIC  9(10)V9(09)
                   VALUE  5122785066.779668161.
       77  FLD0349B                       PIC  9(03)V9(32)
                   VALUE  924.84903066843715535583214659709483.

       77  FLD0350A                       PIC  9(02)      
                   VALUE  07.
       77  FLD0350B                       PIC  9(06)V9(25)
                   VALUE  826494.1389960360762501068165875.

       77  FLD0351A                       PIC  9(05)V9(27)
                   VALUE  84942.576912519174303639601930626.
       77  FLD0351B                       PIC  9(10)V9(10)
                   VALUE  5388327188.5283523516.

       77  FLD0352A                       PIC  9(03)V9(32)
                   VALUE  937.88592938035042489985926295048557.
       77  FLD0352B                       PIC  9(06)V9(01)
                   VALUE  195629.8.

       77  FLD0353A                       PIC S9(07)V9(02)
                   VALUE -2544588.73.
       77  FLD0353B                       PIC  9(02)V9(33)
                   VALUE  94.340663054368900652946194895775988.

       77  FLD0354A                       PIC  9(07)V9(01)
                   VALUE  2152460.4.
       77  FLD0354B                       PIC S9(08)V9(03)
                   VALUE -29015200.342.

       77  FLD0355A                       PIC  9(06)V9(01)
                   VALUE  208715.4.
       77  FLD0355B                       PIC S9(05)      
                   VALUE -15428.

       77  FLD0356A                       PIC S9(09)V9(05)
                   VALUE -391398983.37050.
       77  FLD0356B                       PIC  9(05)V9(27)
                   VALUE  84690.187478976841628508509529638.

       77  FLD0357A                       PIC  9(10)V9(10)
                   VALUE  5323345989.0667944591.
       77  FLD0357B                       PIC  9(03)      
                   VALUE  079.

       77  FLD0358A                       PIC  9(08)V9(03)
                   VALUE  29848403.943.
       77  FLD0358B                       PIC  9(09)V9(17)
                   VALUE  688595894.53938552239264936.

       77  FLD0359A                       PIC  9(07)V9(22)
                   VALUE  7654789.5985185210321333215688.
       77  FLD0359B                       PIC  9(01)V9(36)
                   VALUE  9.927521413787718795873615817981772124.

       77  FLD0360A                       PIC S9(09)V9(06)
                   VALUE +400277612.276280.
       77  FLD0360B                       PIC  9(08)V9(02)
                   VALUE  26666225.04.

       77  FLD0361A                       PIC  9(06)V9(25)
                   VALUE  823089.8044061112361902132761315.
       77  FLD0361B                       PIC  9(05)V9(27)
                   VALUE  84762.044237681810621154454565839.

       77  FLD0362A                       PIC S9(01)      
                   VALUE -0.
       77  FLD0362B                       PIC  9(04)V9(30)
                   VALUE  8970.899599407193836242413453874178.

       77  FLD0363A                       PIC  9(09)V9(04)
                   VALUE  358575926.2078.
       77  FLD0363B                       PIC  9(04)V9(30)
                   VALUE  9034.927431796696550847514117776881.

       77  FLD0364A                       PIC S9(04)      
                   VALUE +1234.
       77  FLD0364B                       PIC  9(06)V9(25)
                   VALUE  830028.0009277749559970516202156.

       77  FLD0365A                       PIC  9(09)V9(11)
                   VALUE  551967009.62472056151.
       77  FLD0365B                       PIC  9(09)V9(16)
                   VALUE  658782379.9892106313436102.

       77  FLD0366A                       PIC  9(06)V9(25)
                   VALUE  822414.3642778768414913770357088.
       77  FLD0366B                       PIC  9(06)V9(25)
                   VALUE  838180.2974044693099742175945721.

       77  FLD0367A                       PIC  9(09)V9(13)
                   VALUE  595975436.9256639039420.
       77  FLD0367B                       PIC S9(06)V9(01)
                   VALUE -191378.3.

       77  FLD0368A                       PIC  9(05)      
                   VALUE  15663.
       77  FLD0368B                       PIC  9(01)      
                   VALUE  0.

       77  FLD0369A                       PIC  9(01)      
                   VALUE  0.
       77  FLD0369B                       PIC S9(08)V9(03)
                   VALUE +31224128.387.

       77  FLD0370A                       PIC  9(01)      
                   VALUE  0.
       77  FLD0370B                       PIC S9(01)      
                   VALUE -0.

       77  FLD0371A                       PIC S9(01)      
                   VALUE +0.
       77  FLD0371B                       PIC S9(03)      
                   VALUE -082.

       77  FLD0372A                       PIC  9(10)V9(09)
                   VALUE  5067586024.551302692.
       77  FLD0372B                       PIC  9(10)V9(09)
                   VALUE  5017586497.117959565.

       77  FLD0373A                       PIC  9(09)V9(16)
                   VALUE  660730415.8912360447786227.
       77  FLD0373B                       PIC S9(09)V9(04)
                   VALUE -352559577.5040.

       77  FLD0374A                       PIC  9(01)      
                   VALUE  0.
       77  FLD0374B                       PIC  9(08)V9(19)
                   VALUE  71126449.7973442155753787119.

       77  FLD0375A                       PIC  9(07)V9(22)
                   VALUE  7816763.9605777072819847717255.
       77  FLD0375B                       PIC  9(01)      
                   VALUE  0.

       77  FLD0376A                       PIC  9(05)V9(27)
                   VALUE  84980.958923270843996533585595898.
       77  FLD0376B                       PIC  9(10)V9(09)
                   VALUE  5240094598.000759607.

       77  FLD0377A                       PIC  9(02)V9(34)
                   VALUE  96.7759547981370871205797357106348499.
       77  FLD0377B                       PIC  9(07)V9(22)
                   VALUE  7813622.4062247550126159012506.

       77  FLD0378A                       PIC S9(01)      
                   VALUE -0.
       77  FLD0378B                       PIC S9(06)      
                   VALUE -163135.

       77  FLD0379A                       PIC  9(10)V9(10)
                   VALUE  5351160784.1302399890.
       77  FLD0379B                       PIC  9(01)      
                   VALUE  0.

       77  FLD0380A                       PIC  9(09)V9(03)
                   VALUE  318886259.138.
       77  FLD0380B                       PIC S9(01)      
                   VALUE +0.

       77  FLD0381A                       PIC  9(10)V9(09)
                   VALUE  5188977124.912377281.
       77  FLD0381B                       PIC  9(03)      
                   VALUE  096.

       77  FLD0382A                       PIC  9(10)V9(10)
                   VALUE  5469463185.9002762475.
       77  FLD0382B                       PIC  9(04)      
                   VALUE  1276.

       77  FLD0383A                       PIC  9(04)V9(29)
                   VALUE  8846.28028341020278269013488170458.
       77  FLD0383B                       PIC  9(06)V9(24)
                   VALUE  801588.906111812216082057602761.

       77  FLD0384A                       PIC S9(07)V9(02)
                   VALUE +2410021.83.
       77  FLD0384B                       PIC  9(01)      
                   VALUE  0.

       77  FLD0385A                       PIC  9(09)V9(14)
                   VALUE  616198826.41569234671408.
       77  FLD0385B                       PIC  9(04)V9(29)
                   VALUE  8914.93363280043138452413131744833.

       77  FLD0386A                       PIC  9(10)V9(11)
                   VALUE  5671006446.22052230126.
       77  FLD0386B                       PIC  9(07)V9(21)
                   VALUE  7538453.430795608589676248811.

       77  FLD0387A                       PIC  9(08)V9(03)
                   VALUE  30516405.931.
       77  FLD0387B                       PIC  9(09)V9(16)
                   VALUE  660134959.6835575095354897.

       77  FLD0388A                       PIC  9(10)V9(11)
                   VALUE  5691303425.20841603359.
       77  FLD0388B                       PIC  9(03)      
                   VALUE  099.

       77  FLD0389A                       PIC S9(10)V9(06)
                   VALUE +4300560615.719126.
       77  FLD0389B                       PIC  9(10)V9(12)
                   VALUE  5882065365.633618592156.

       77  FLD0390A                       PIC S9(02)      
                   VALUE -07.
       77  FLD0390B                       PIC  9(03)      
                   VALUE  095.

       77  FLD0391A                       PIC S9(08)V9(03)
                   VALUE +30066642.536.
       77  FLD0391B                       PIC S9(08)V9(02)
                   VALUE -26329271.26.

       77  FLD0392A                       PIC  9(02)V9(34)
                   VALUE  95.7627258628673261320329856971511617.
       77  FLD0392B                       PIC  9(10)V9(07)
                   VALUE  4682510725.0510572.

       77  FLD0393A                       PIC  9(02)      
                   VALUE  05.
       77  FLD0393B                       PIC  9(04)V9(30)
                   VALUE  9067.420163680885991652758093550801.

       77  FLD0394A                       PIC  9(05)V9(01)
                   VALUE  16807.8.
       77  FLD0394B                       PIC S9(10)V9(08)
                   VALUE -4746288002.63585892.

       77  FLD0395A                       PIC  9(10)V9(09)
                   VALUE  5206691882.901124390.
       77  FLD0395B                       PIC S9(01)      
                   VALUE +0.

       77  FLD0396A                       PIC  9(09)V9(06)
                   VALUE  419939827.280791.
       77  FLD0396B                       PIC  9(09)V9(07)
                   VALUE  446487444.5871826.

       77  FLD0397A                       PIC  9(05)V9(27)
                   VALUE  85569.982924983467587054519754019.
       77  FLD0397B                       PIC S9(02)      
                   VALUE -07.

       77  FLD0398A                       PIC  9(05)V9(26)
                   VALUE  84110.85692078776876456913669244.
       77  FLD0398B                       PIC S9(08)V9(02)
                   VALUE -28358417.67.

       77  FLD0399A                       PIC  9(05)V9(27)
                   VALUE  86215.377080746946614198122915695.
       77  FLD0399B                       PIC  9(07)V9(02)
                   VALUE  2481207.70.

       77  FLD0400A                       PIC  9(10)V9(08)
                   VALUE  4880703034.67910082.
       77  FLD0400B                       PIC  9(06)V9(25)
                   VALUE  835199.6491942943467989834971376.

       77  FLD0401A                       PIC  9(08)V9(03)
                   VALUE  30757829.425.
       77  FLD0401B                       PIC  9(01)      
                   VALUE  0.

       77  FLD0402A                       PIC  9(04)V9(29)
                   VALUE  8843.41306989221531686951038864208.
       77  FLD0402B                       PIC  9(08)V9(18)
                   VALUE  69652895.633901057426129455.

       77  FLD0403A                       PIC  9(10)V9(10)
                   VALUE  5351391185.2119278034.
       77  FLD0403B                       PIC  9(03)V9(32)
                   VALUE  939.96913575689089448417234962107613.

       77  FLD0404A                       PIC S9(10)V9(08)
                   VALUE -4810592903.51378177.
       77  FLD0404B                       PIC  9(09)V9(16)
                   VALUE  670850774.7441430080215241.

       77  FLD0405A                       PIC S9(09)V9(04)
                   VALUE -360620744.0007.
       77  FLD0405B                       PIC S9(05)      
                   VALUE +14133.

       77  FLD0406A                       PIC S9(07)V9(02)
                   VALUE -2503018.94.
       77  FLD0406B                       PIC  9(07)V9(23)
                   VALUE  7996063.91391730064732712435215.

       77  FLD0407A                       PIC  9(09)V9(13)
                   VALUE  592634898.8738083800598.
       77  FLD0407B                       PIC  9(01)V9(36)
                   VALUE  9.879241102928391082826919955550692975.

       77  FLD0408A                       PIC  9(09)V9(07)
                   VALUE  438100099.1119252.
       77  FLD0408B                       PIC  9(08)V9(02)
                   VALUE  28626783.20.

       77  FLD0409A                       PIC  9(08)V9(02)
                   VALUE  28575188.65.
       77  FLD0409B                       PIC  9(09)V9(12)
                   VALUE  576691261.515216657684.

       77  FLD0410A                       PIC  9(09)V9(14)
                   VALUE  615937928.60877261130525.
       77  FLD0410B                       PIC  9(01)V9(36)
                   VALUE  9.822719722312858170454319406417198479.

       77  FLD0411A                       PIC  9(09)V9(17)
                   VALUE  688573322.26995748847286904.
       77  FLD0411B                       PIC  9(07)V9(22)
                   VALUE  7775778.4281136710369253250973.

       77  FLD0412A                       PIC  9(09)V9(12)
                   VALUE  572677017.522024045526.
       77  FLD0412B                       PIC S9(01)      
                   VALUE +0.

       77  FLD0413A                       PIC  9(06)V9(25)
                   VALUE  828822.6462986850728853482905833.
       77  FLD0413B                       PIC S9(01)      
                   VALUE +0.

       77  FLD0414A                       PIC  9(05)V9(27)
                   VALUE  84413.303017262042438062508153961.
       77  FLD0414B                       PIC S9(05)      
                   VALUE -15377.

       77  FLD0415A                       PIC  9(09)V9(15)
                   VALUE  650722988.227690701812377.
       77  FLD0415B                       PIC  9(03)V9(31)
                   VALUE  919.0351051613949717733476063585840.

       77  FLD0416A                       PIC  9(09)V9(16)
                   VALUE  675584038.8269652718733482.
       77  FLD0416B                       PIC S9(01)      
                   VALUE +0.

       77  FLD0417A                       PIC  9(03)V9(32)
                   VALUE  942.59186417160190085695603556814603.
       77  FLD0417B                       PIC  9(04)V9(29)
                   VALUE  8943.54109346381376255408213182818.

       77  FLD0418A                       PIC  9(01)      
                   VALUE  0.
       77  FLD0418B                       PIC  9(01)      
                   VALUE  0.

       77  FLD0419A                       PIC  9(09)V9(06)
                   VALUE  415695619.544491.
       77  FLD0419B                       PIC  9(10)V9(10)
                   VALUE  5349169017.3884820502.

       77  FLD0420A                       PIC  9(08)V9(02)
                   VALUE  26881191.37.
       77  FLD0420B                       PIC  9(04)V9(30)
                   VALUE  9092.387304867948216724471421912312.

       77  FLD0421A                       PIC  9(08)V9(19)
                   VALUE  71124707.9077118260492795798.
       77  FLD0421B                       PIC S9(06)V9(01)
                   VALUE +210383.3.

       77  FLD0422A                       PIC  9(08)V9(18)
                   VALUE  69276472.004700051510184266.
       77  FLD0422B                       PIC  9(02)V9(34)
                   VALUE  96.7464238557165900900258748151827603.

       77  FLD0423A                       PIC  9(09)V9(13)
                   VALUE  595417774.2919815052857.
       77  FLD0423B                       PIC  9(09)V9(17)
                   VALUE  689527286.14626146441679566.

       77  FLD0424A                       PIC  9(09)V9(11)
                   VALUE  551151541.59885582085.
       77  FLD0424B                       PIC  9(08)V9(19)
                   VALUE  72724692.5117367437607640567.

       77  FLD0425A                       PIC S9(10)V9(08)
                   VALUE -4741628720.81754727.
       77  FLD0425B                       PIC  9(10)V9(12)
                   VALUE  5846836543.074439562772.

       77  FLD0426A                       PIC  9(10)V9(11)
                   VALUE  5601456695.80725313885.
       77  FLD0426B                       PIC  9(10)V9(11)
                   VALUE  5581868249.31393821280.

       77  FLD0427A                       PIC  9(09)V9(04)
                   VALUE  365284621.5641.
       77  FLD0427B                       PIC  9(07)V9(22)
                   VALUE  7792109.4871910845380824639505.

       77  FLD0428A                       PIC  9(05)V9(27)
                   VALUE  85913.234918316627730661139139556.
       77  FLD0428B                       PIC  9(01)V9(36)
                   VALUE  9.753152813075189886404814387788064777.

       77  FLD0429A                       PIC  9(07)V9(22)
                   VALUE  7833347.6062909002113343603923.
       77  FLD0429B                       PIC  9(09)V9(06)
                   VALUE  415311789.274485.

       77  FLD0430A                       PIC  9(08)V9(03)
                   VALUE  30820998.502.
       77  FLD0430B                       PIC  9(09)V9(04)
                   VALUE  345613119.3468.

       77  FLD0431A                       PIC S9(01)      
                   VALUE +0.
       77  FLD0431B                       PIC  9(03)V9(31)
                   VALUE  920.3928254587173674039490833820309.

       77  FLD0432A                       PIC  9(10)V9(11)
                   VALUE  5612307034.00538710745.
       77  FLD0432B                       PIC S9(06)      
                   VALUE -161655.

       77  FLD0433A                       PIC  9(08)V9(19)
                   VALUE  72012955.8244768763763943297.
       77  FLD0433B                       PIC  9(06)V9(01)
                   VALUE  206502.1.

       77  FLD0434A                       PIC S9(10)V9(07)
                   VALUE -4547054675.3415619.
       77  FLD0434B                       PIC  9(03)V9(32)
                   VALUE  931.50114075800283242045907172723673.

       77  FLD0435A                       PIC  9(03)      
                   VALUE  087.
       77  FLD0435B                       PIC  9(10)V9(12)
                   VALUE  5848414344.863717140299.

       77  FLD0436A                       PIC S9(01)      
                   VALUE +0.
       77  FLD0436B                       PIC  9(06)V9(25)
                   VALUE  830719.5843004202551185244374210.

       77  FLD0437A                       PIC  9(09)V9(15)
                   VALUE  632897272.198471361193128.
       77  FLD0437B                       PIC  9(09)V9(15)
                   VALUE  644015379.475938010145341.

       77  FLD0438A                       PIC  9(09)V9(16)
                   VALUE  664694021.6365745390802999.
       77  FLD0438B                       PIC  9(05)V9(28)
                   VALUE  87427.7230957161255453513604152249.

       77  FLD0439A                       PIC  9(10)V9(08)
                   VALUE  4961134805.43429519.
       77  FLD0439B                       PIC  9(10)V9(11)
                   VALUE  5610850764.78219813012.

       77  FLD0440A                       PIC  9(04)V9(29)
                   VALUE  8899.07507055040514210020319296745.
       77  FLD0440B                       PIC  9(10)V9(07)
                   VALUE  4554701137.8932739.

       77  FLD0441A                       PIC  9(08)V9(19)
                   VALUE  71126905.4406556744396539215.
       77  FLD0441B                       PIC S9(10)V9(06)
                   VALUE +4339238601.837461.

       77  FLD0442A                       PIC  9(05)V9(01)
                   VALUE  16995.1.
       77  FLD0442B                       PIC  9(03)V9(31)
                   VALUE  915.7753741786495149668212434335146.

       77  FLD0443A                       PIC S9(10)V9(08)
                   VALUE -4744984255.46487689.
       77  FLD0443B                       PIC  9(09)V9(14)
                   VALUE  620915031.52970173307068.

       77  FLD0444A                       PIC  9(02)V9(33)
                   VALUE  94.673816662087151296844922399031929.
       77  FLD0444B                       PIC  9(10)V9(09)
                   VALUE  5047752845.189990011.

       77  FLD0445A                       PIC  9(10)V9(10)
                   VALUE  5416554544.5299512206.
       77  FLD0445B                       PIC S9(10)V9(07)
                   VALUE -4623541965.4562581.

       77  FLD0446A                       PIC  9(10)V9(09)
                   VALUE  5044897846.697211640.
       77  FLD0446B                       PIC  9(09)V9(16)
                   VALUE  665206327.4939082893055797.

       77  FLD0447A                       PIC  9(02)      
                   VALUE  06.
       77  FLD0447B                       PIC  9(08)V9(02)
                   VALUE  27717300.69.

       77  FLD0448A                       PIC  9(06)V9(01)
                   VALUE  186565.4.
       77  FLD0448B                       PIC  9(10)V9(10)
                   VALUE  5373290497.5367845601.

       77  FLD0449A                       PIC S9(09)V9(05)
                   VALUE -384988094.18704.
       77  FLD0449B                       PIC S9(08)V9(04)
                   VALUE +34016016.2924.

       77  FLD0450A                       PIC  9(09)V9(14)
                   VALUE  625578375.50228334588808.
       77  FLD0450B                       PIC  9(09)V9(13)
                   VALUE  597300618.6146695428718.

       77  FLD0451A                       PIC  9(01)      
                   VALUE  0.
       77  FLD0451B                       PIC S9(07)V9(02)
                   VALUE -2517390.40.

       77  FLD0452A                       PIC  9(08)V9(02)
                   VALUE  26826484.18.
       77  FLD0452B                       PIC  9(10)V9(11)
                   VALUE  5576443525.30127562772.

       77  FLD0453A                       PIC  9(10)V9(10)
                   VALUE  5383526546.5392911909.
       77  FLD0453B                       PIC  9(02)V9(34)
                   VALUE  96.7573296701221163829131910461001098.

       77  FLD0454A                       PIC S9(03)      
                   VALUE -090.
       77  FLD0454B                       PIC S9(01)      
                   VALUE -0.

       77  FLD0455A                       PIC S9(01)      
                   VALUE -0.
       77  FLD0455B                       PIC  9(05)V9(27)
                   VALUE  85105.998788168291113720442808698.

       77  FLD0456A                       PIC S9(03)      
                   VALUE -093.
       77  FLD0456B                       PIC  9(05)      
                   VALUE  15509.

       77  FLD0457A                       PIC  9(04)V9(30)
                   VALUE  9063.641671624598217249513254500925.
       77  FLD0457B                       PIC  9(01)      
                   VALUE  0.

       77  FLD0458A                       PIC  9(02)      
                   VALUE  06.
       77  FLD0458B                       PIC  9(09)V9(03)
                   VALUE  319507540.378.

       77  FLD0459A                       PIC  9(06)V9(01)
                   VALUE  198479.9.
       77  FLD0459B                       PIC  9(10)V9(11)
                   VALUE  5635468078.16151518188.

       77  FLD0460A                       PIC  9(01)      
                   VALUE  0.
       77  FLD0460B                       PIC  9(07)V9(22)
                   VALUE  7834589.5335320658858790920930.

       77  FLD0461A                       PIC S9(01)      
                   VALUE +0.
       77  FLD0461B                       PIC S9(07)V9(01)
                   VALUE +2146839.2.

       77  FLD0462A                       PIC  9(08)V9(02)
                   VALUE  26776595.69.
       77  FLD0462B                       PIC  9(02)V9(34)
                   VALUE  95.2391194548525610308331579290097579.

       77  FLD0463A                       PIC  9(05)V9(27)
                   VALUE  85490.666934027292889197724434779.
       77  FLD0463B                       PIC  9(09)V9(06)
                   VALUE  407249114.981761.

       77  FLD0464A                       PIC  9(10)V9(07)
                   VALUE  4587031190.3834293.
       77  FLD0464B                       PIC  9(08)V9(19)
                   VALUE  71857481.5704608793609509120.

       77  FLD0465A                       PIC  9(10)V9(12)
                   VALUE  5816563985.597106301028.
       77  FLD0465B                       PIC  9(06)V9(25)
                   VALUE  837937.1800695708527584315561398.

       77  FLD0466A                       PIC  9(09)V9(15)
                   VALUE  654381306.333900236715805.
       77  FLD0466B                       PIC  9(05)      
                   VALUE  14616.

       77  FLD0467A                       PIC S9(07)V9(01)
                   VALUE +2343287.0.
       77  FLD0467B                       PIC  9(04)V9(29)
                   VALUE  8929.74677715112297171629052172647.

       77  FLD0468A                       PIC S9(10)V9(06)
                   VALUE +4344132145.767680.
       77  FLD0468B                       PIC  9(08)V9(03)
                   VALUE  29592230.696.

       77  FLD0469A                       PIC  9(08)V9(18)
                   VALUE  70961503.876956555370014712.
       77  FLD0469B                       PIC  9(10)V9(09)
                   VALUE  5200119971.346918168.

       77  FLD0470A                       PIC  9(03)V9(31)
                   VALUE  913.6810028966669827710234130790922.
       77  FLD0470B                       PIC S9(09)V9(05)
                   VALUE -383130523.18889.

       77  FLD0471A                       PIC S9(07)V9(02)
                   VALUE -2507103.69.
       77  FLD0471B                       PIC  9(01)      
                   VALUE  0.

       77  FLD0472A                       PIC  9(10)V9(09)
                   VALUE  5103990869.050332168.
       77  FLD0472B                       PIC  9(06)V9(26)
                   VALUE  843393.74409143441635450244575622.

       77  FLD0473A                       PIC  9(08)V9(20)
                   VALUE  74367162.06805468187823748849.
       77  FLD0473B                       PIC  9(08)V9(18)
                   VALUE  70143773.259305752798553612.

       77  FLD0474A                       PIC  9(08)V9(19)
                   VALUE  72625744.5118117406224200749.
       77  FLD0474B                       PIC S9(05)      
                   VALUE +13295.

       77  FLD0475A                       PIC  9(10)V9(07)
                   VALUE  4588724634.2999971.
       77  FLD0475B                       PIC S9(09)V9(06)
                   VALUE +420010897.357724.

       77  FLD0476A                       PIC  9(08)V9(02)
                   VALUE  28869933.49.
       77  FLD0476B                       PIC  9(06)V9(01)
                   VALUE  197306.5.

       77  FLD0477A                       PIC  9(08)V9(20)
                   VALUE  74492482.99155191155307420558.
       77  FLD0477B                       PIC S9(09)V9(05)
                   VALUE -380644102.28203.

       77  FLD0478A                       PIC  9(08)V9(19)
                   VALUE  72616162.5751895356550846827.
       77  FLD0478B                       PIC  9(09)V9(04)
                   VALUE  345871637.9604.

       77  FLD0479A                       PIC S9(09)V9(06)
                   VALUE +413502052.896697.
       77  FLD0479B                       PIC  9(06)V9(25)
                   VALUE  820524.8465168897276100778981344.

       77  FLD0480A                       PIC S9(06)V9(01)
                   VALUE +203017.8.
       77  FLD0480B                       PIC  9(08)V9(20)
                   VALUE  74798417.21657910502685240317.

       77  FLD0481A                       PIC  9(05)      
                   VALUE  15658.
       77  FLD0481B                       PIC  9(01)V9(36)
                   VALUE  9.907459007614364265847939350351225584.

       77  FLD0482A                       PIC  9(08)V9(18)
                   VALUE  70905037.950447225014727337.
       77  FLD0482B                       PIC S9(10)V9(08)
                   VALUE -4922020906.16106868.

       77  FLD0483A                       PIC  9(03)      
                   VALUE  079.
       77  FLD0483B                       PIC S9(09)V9(03)
                   VALUE +323420049.144.

       77  FLD0484A                       PIC S9(01)      
                   VALUE +0.
       77  FLD0484B                       PIC  9(09)V9(12)
                   VALUE  577123861.473882282524.

       77  FLD0485A                       PIC  9(07)V9(02)
                   VALUE  2567572.97.
       77  FLD0485B                       PIC  9(05)V9(01)
                   VALUE  16688.0.

       77  FLD0486A                       PIC  9(05)      
                   VALUE  13937.
       77  FLD0486B                       PIC  9(10)V9(07)
                   VALUE  4583814690.4965959.

       77  FLD0487A                       PIC  9(06)V9(01)
                   VALUE  209384.2.
       77  FLD0487B                       PIC  9(08)V9(18)
                   VALUE  70207035.549040885946681100.

       77  FLD0488A                       PIC S9(10)V9(07)
                   VALUE -4519198906.7966076.
       77  FLD0488B                       PIC  9(09)V9(16)
                   VALUE  669660091.3134611587906874.

       77  FLD0489A                       PIC S9(05)V9(01)
                   VALUE -17360.6.
       77  FLD0489B                       PIC  9(01)V9(36)
                   VALUE  9.950567826331271348294649214949458837.

       77  FLD0490A                       PIC  9(10)V9(10)
                   VALUE  5352566580.2623056954.
       77  FLD0490B                       PIC  9(08)V9(02)
                   VALUE  28596817.06.

       77  FLD0491A                       PIC  9(03)V9(31)
                   VALUE  918.2459205467069507378141679510008.
       77  FLD0491B                       PIC  9(09)V9(16)
                   VALUE  661285516.5476814178759923.

       77  FLD0492A                       PIC  9(06)V9(25)
                   VALUE  819266.4570447540928199714471702.
       77  FLD0492B                       PIC S9(09)V9(04)
                   VALUE +343135449.1145.

       77  FLD0493A                       PIC S9(05)V9(01)
                   VALUE -18038.5.
       77  FLD0493B                       PIC  9(06)V9(24)
                   VALUE  808734.959278862186593528349476.

       77  FLD0494A                       PIC  9(05)V9(28)
                   VALUE  87574.5417791477964719604187848744.
       77  FLD0494B                       PIC  9(10)V9(09)
                   VALUE  5133082903.157394349.

       77  FLD0495A                       PIC S9(02)      
                   VALUE -05.
       77  FLD0495B                       PIC  9(09)V9(15)
                   VALUE  646882578.915106698502768.

       77  FLD0496A                       PIC  9(06)V9(25)
                   VALUE  816763.6415427422802437718019064.
       77  FLD0496B                       PIC S9(04)      
                   VALUE +1240.

       77  FLD0497A                       PIC  9(06)V9(25)
                   VALUE  836230.6435874340415637107071233.
       77  FLD0497B                       PIC  9(09)V9(16)
                   VALUE  665491997.9684780217965567.

       77  FLD0498A                       PIC  9(10)V9(08)
                   VALUE  4792455293.49441590.
       77  FLD0498B                       PIC  9(06)V9(01)
                   VALUE  189449.4.

       77  FLD0499A                       PIC  9(02)      
                   VALUE  05.
       77  FLD0499B                       PIC  9(09)V9(15)
                   VALUE  634131211.402607308791345.

      * RESULTS-AREA
       78  XPC-FLD0001B
           VALUE '4'.
       78  XPC-FLD0002B
           VALUE '01571925154608921904042517780914'.
       78  XPC-FLD0003B
           VALUE '497691662540136914'.
       78  XPC-FLD0004B
           VALUE '316172'.
       78  XPC-FLD0005B
           VALUE '326669126773'.
       78  XPC-FLD0006B
           VALUE '2564149945687535678828794516448398'.
       78  XPC-FLD0007B
           VALUE '270310289q'.
       78  XPC-FLD0008B
           VALUE '09q'.
       78  XPC-FLD0009B
           VALUE '750598888818416259625343627703841'.
       78  XPC-FLD0010B
           VALUE '401313154225654'.
       78  XPC-FLD0011B
           VALUE '716073640695890795927880390081554'.
       78  XPC-FLD0012B
           VALUE '714856822486604356929547066'.
       78  XPC-FLD0013B
           VALUE '249701360'.
       78  XPC-FLD0014B
           VALUE '7563565'.
       78  XPC-FLD0015B
           VALUE '496103206190910525'.
       78  XPC-FLD0016B
           VALUE '4316078086835850'.
       78  XPC-FLD0017B
           VALUE '8983341087204116393039043941826093'.
       78  XPC-FLD0018B
           VALUE 'w'.
       78  XPC-FLD0019B
           VALUE '52790866914027q'.
       78  XPC-FLD0020B
           VALUE '09154677345638306819'.
       78  XPC-FLD0021B
           VALUE 'p'.
       78  XPC-FLD0022B
           VALUE '6800620448921426031141379553'.
       78  XPC-FLD0023B
           VALUE '011865432391802879230624512274516746'.
       78  XPC-FLD0024B
           VALUE '081262603108476'.
       78  XPC-FLD0025B
           VALUE '249748827'.
       78  XPC-FLD0026B
           VALUE '3837571962056t'.
       78  XPC-FLD0027B
           VALUE '8427161982877569013082921992870'.
       78  XPC-FLD0028B
           VALUE 'u'.
       78  XPC-FLD0029B
           VALUE '68438817718294422258378517'.
       78  XPC-FLD0030B
           VALUE '70264210169553353857452293'.
       78  XPC-FLD0031B
           VALUE '70450280588407820925311852'.
       78  XPC-FLD0032B
           VALUE '94722057179q'.
       78  XPC-FLD0033B
           VALUE '960256540212'.
       78  XPC-FLD0034B
           VALUE '21267719'.
       78  XPC-FLD0035B
           VALUE '30926017'.
       78  XPC-FLD0036B
           VALUE '84780746063121390621031281398245'.
       78  XPC-FLD0037B
           VALUE '1535r'.
       78  XPC-FLD0038B
           VALUE '8192466589219795159659831540467'.
       78  XPC-FLD0039B
           VALUE '2142775'.
       78  XPC-FLD0040B
           VALUE '328'.
       78  XPC-FLD0041B
           VALUE '5719955231502458548'.
       78  XPC-FLD0042B
           VALUE '53913067269542921267'.
       78  XPC-FLD0043B
           VALUE '8947428650524259539551508169097361'.
       78  XPC-FLD0044B
           VALUE '3593279914883'.
       78  XPC-FLD0045B
           VALUE '40565136957830'.
       78  XPC-FLD0046B
           VALUE '86000025910646182847330010190489'.
       78  XPC-FLD0047B
           VALUE '500920610887845814'.
       78  XPC-FLD0048B
           VALUE '01272w'.
       78  XPC-FLD0049B
           VALUE '6818217198975972105429554915463086217'.
       78  XPC-FLD0050B
           VALUE '079122399722566'.
       78  XPC-FLD0051B
           VALUE '4768561362631936750203005938732530'.
       78  XPC-FLD0052B
           VALUE '18378999229403754265'.
       78  XPC-FLD0053B
           VALUE '358916388870q'.
       78  XPC-FLD0054B
           VALUE '319288758232'.
       78  XPC-FLD0055B
           VALUE '9048691568994934320002240'.
       78  XPC-FLD0056B
           VALUE '2564409583'.
       78  XPC-FLD0057B
           VALUE '24'.
       78  XPC-FLD0058B
           VALUE '3436235653794'.
       78  XPC-FLD0059B
           VALUE '62832873919564874525472'.
       78  XPC-FLD0060B
           VALUE '159140'.
       78  XPC-FLD0061B
           VALUE '8166592123096498172785118185856'.
       78  XPC-FLD0062B
           VALUE '9769550469250686264269'.
       78  XPC-FLD0063B
           VALUE '753004763264897311507922950'.
       78  XPC-FLD0064B
           VALUE '744p'.
       78  XPC-FLD0065B
           VALUE '5378'.
       78  XPC-FLD0066B
           VALUE '85085260849998822774153950376785'.
       78  XPC-FLD0067B
           VALUE 'q'.
       78  XPC-FLD0068B
           VALUE '6'.
       78  XPC-FLD0069B
           VALUE '097'.
       78  XPC-FLD0070B
           VALUE '847339t'.
       78  XPC-FLD0071B
           VALUE '1274'.
       78  XPC-FLD0072B
           VALUE '655377313792015250284373'.
       78  XPC-FLD0073B
           VALUE '70717240702803545859163048'.
       78  XPC-FLD0074B
           VALUE '6009119595528942259221594213158817808'.
       78  XPC-FLD0075B
           VALUE '82894007'.
       78  XPC-FLD0076B
           VALUE '889922269538142470324260102643165738'.
       78  XPC-FLD0077B
           VALUE '297736583767979700245026833727024'.
       78  XPC-FLD0078B
           VALUE '52639083334727222580'.
       78  XPC-FLD0079B
           VALUE '324'.
       78  XPC-FLD0080B
           VALUE '371153437233y'.
       78  XPC-FLD0081B
           VALUE '3672069622885'.
       78  XPC-FLD0082B
           VALUE '39908942738066827524420432382'.
       78  XPC-FLD0083B
           VALUE '886546406'.
       78  XPC-FLD0084B
           VALUE '405109331835069'.
       78  XPC-FLD0085B
           VALUE '4354243534611629'.
       78  XPC-FLD0086B
           VALUE '571167021401449572360'.
       78  XPC-FLD0087B
           VALUE '9773'.
       78  XPC-FLD0088B
           VALUE '481540354519'.
       78  XPC-FLD0089B
           VALUE '8552781102827879955441403577769802'.
       78  XPC-FLD0090B
           VALUE '0075180968r'.
       78  XPC-FLD0091B
           VALUE '08617201884902925811235356'.
       78  XPC-FLD0092B
           VALUE '3179100098465547968089595087804'.
       78  XPC-FLD0093B
           VALUE '790919325337388512409120266966'.
       78  XPC-FLD0094B
           VALUE '53066656460354850645'.
       78  XPC-FLD0095B
           VALUE '5167739798081453228562054391361'.
       78  XPC-FLD0096B
           VALUE '875053049076218392166026660561328'.
       78  XPC-FLD0097B
           VALUE '76639044132902548449948199049'.
       78  XPC-FLD0098B
           VALUE '334130309069'.
       78  XPC-FLD0099B
           VALUE '1680281099q'.
       78  XPC-FLD0100B
           VALUE '53883959962677607717265'.
       78  XPC-FLD0101B
           VALUE '51211205q'.
       78  XPC-FLD0102B
           VALUE '62599568832775289662151'.
       78  XPC-FLD0103B
           VALUE '9'.
       78  XPC-FLD0104B
           VALUE '48125550583217433t'.
       78  XPC-FLD0105B
           VALUE '0152268966'.
       78  XPC-FLD0106B
           VALUE '263621782y'.
       78  XPC-FLD0107B
           VALUE '491683543555178959039153289'.
       78  XPC-FLD0108B
           VALUE '386319355p'.
       78  XPC-FLD0109B
           VALUE '0156720262660837374113498299266211'.
       78  XPC-FLD0110B
           VALUE '61781025727648194445507102'.
       78  XPC-FLD0111B
           VALUE '5582373934795217912'.
       78  XPC-FLD0112B
           VALUE '983719732p'.
       78  XPC-FLD0113B
           VALUE '0370'.
       78  XPC-FLD0114B
           VALUE '873969'.
       78  XPC-FLD0115B
           VALUE '30236778644'.
       78  XPC-FLD0116B
           VALUE '3'.
       78  XPC-FLD0117B
           VALUE '13612'.
       78  XPC-FLD0118B
           VALUE '80v'.
       78  XPC-FLD0119B
           VALUE '253932450'.
       78  XPC-FLD0120B
           VALUE '6w'.
       78  XPC-FLD0121B
           VALUE '323330267022'.
       78  XPC-FLD0122B
           VALUE '2693757152'.
       78  XPC-FLD0123B
           VALUE '7502022502690824523057244732'.
       78  XPC-FLD0124B
           VALUE '4223876720963152'.
       78  XPC-FLD0125B
           VALUE '637787216045794358443288'.
       78  XPC-FLD0126B
           VALUE '14776980'.
       78  XPC-FLD0127B
           VALUE '968598991861849889506430599794838'.
       78  XPC-FLD0128B
           VALUE '7158526709'.
       78  XPC-FLD0129B
           VALUE '66302536762228508700376'.
       78  XPC-FLD0130B
           VALUE '30500681275'.
       78  XPC-FLD0131B
           VALUE '97542725692831921848454612'.
       78  XPC-FLD0132B
           VALUE '21622287'.
       78  XPC-FLD0133B
           VALUE '25284219x'.
       78  XPC-FLD0134B
           VALUE '6035745627324759055021275'.
       78  XPC-FLD0135B
           VALUE '089682198'.
       78  XPC-FLD0136B
           VALUE '721064189695820607747975827'.
       78  XPC-FLD0137B
           VALUE '39815975038716593768839402400772088'.
       78  XPC-FLD0138B
           VALUE '2805087202945691003095503219810780'.
       78  XPC-FLD0139B
           VALUE '4629717477620841718762676464393'.
       78  XPC-FLD0140B
           VALUE '9134502802484925076953459210926666'.
       78  XPC-FLD0141B
           VALUE '1980465'.
       78  XPC-FLD0142B
           VALUE '011r'.
       78  XPC-FLD0143B
           VALUE '4030994'.
       78  XPC-FLD0144B
           VALUE '24553993'.
       78  XPC-FLD0145B
           VALUE '009479682736521'.
       78  XPC-FLD0146B
           VALUE '5926753717490164309811'.
       78  XPC-FLD0147B
           VALUE '397442042521838'.
       78  XPC-FLD0148B
           VALUE '335821179980'.
       78  XPC-FLD0149B
           VALUE '0u'.
       78  XPC-FLD0150B
           VALUE '5779789481524289174174668914929497987'.
       78  XPC-FLD0151B
           VALUE '03489779895385769491943608024'.
       78  XPC-FLD0152B
           VALUE '976189035330467796747200281970435753'.
       78  XPC-FLD0153B
           VALUE '69465356575944581241088818012'.
       78  XPC-FLD0154B
           VALUE '40490022953226414'.
       78  XPC-FLD0155B
           VALUE '7822691488762339967770021576143335'.
       78  XPC-FLD0156B
           VALUE '8985588062372004625188992577022872'.
       78  XPC-FLD0157B
           VALUE '4359875032276696'.
       78  XPC-FLD0158B
           VALUE '19917526243063020197192'.
       78  XPC-FLD0159B
           VALUE '643529357674236912600918'.
       78  XPC-FLD0160B
           VALUE '4490300'.
       78  XPC-FLD0161B
           VALUE '795897533357509001650242908'.
       78  XPC-FLD0162B
           VALUE '566814386458160899086'.
       78  XPC-FLD0163B
           VALUE '269208611024764676855618'.
       78  XPC-FLD0164B
           VALUE '3001'.
       78  XPC-FLD0165B
           VALUE '1267'.
       78  XPC-FLD0166B
           VALUE '429599'.
       78  XPC-FLD0167B
           VALUE '0917440942478405142746282763255'.
       78  XPC-FLD0168B
           VALUE '4326936005661665'.
       78  XPC-FLD0169B
           VALUE '71534750846474368213279150'.
       78  XPC-FLD0170B
           VALUE '2603177530164159092505813954945188016'.
       78  XPC-FLD0171B
           VALUE '4933823716025803'.
       78  XPC-FLD0172B
           VALUE '8903776753838588409184495731096831'.
       78  XPC-FLD0173B
           VALUE '519945412779417204'.
       78  XPC-FLD0174B
           VALUE '5152585493087611057'.
       78  XPC-FLD0175B
           VALUE '51'.
       78  XPC-FLD0176B
           VALUE '21895219257'.
       78  XPC-FLD0177B
           VALUE '999225365'.
       78  XPC-FLD0178B
           VALUE '2410436611s'.
       78  XPC-FLD0179B
           VALUE '664'.
       78  XPC-FLD0180B
           VALUE '54351034931997414107'.
       78  XPC-FLD0181B
           VALUE '47407358325391086x'.
       78  XPC-FLD0182B
           VALUE '417908352338649757839920'.
       78  XPC-FLD0183B
           VALUE '03'.
       78  XPC-FLD0184B
           VALUE '3601969r'.
       78  XPC-FLD0185B
           VALUE '7395132638753716096465495866'.
       78  XPC-FLD0186B
           VALUE '8407708947119312415452441200613'.
       78  XPC-FLD0187B
           VALUE '6497950041934480558403'.
       78  XPC-FLD0188B
           VALUE '0471158677246608093014401354'.
       78  XPC-FLD0189B
           VALUE '078359569344531809751'.
       78  XPC-FLD0190B
           VALUE '62476651140273569806415'.
       78  XPC-FLD0191B
           VALUE '817437168989411478996487403492'.
       78  XPC-FLD0192B
           VALUE '3580342295012'.
       78  XPC-FLD0193B
           VALUE '86499232126294976690766'.
       78  XPC-FLD0194B
           VALUE '217285653058917626499679'.
       78  XPC-FLD0195B
           VALUE '60767'.
       78  XPC-FLD0196B
           VALUE '18000w'.
       78  XPC-FLD0197B
           VALUE '05'.
       78  XPC-FLD0198B
           VALUE '7903v'.
       78  XPC-FLD0199B
           VALUE '045232741410605347571106449322'.
       78  XPC-FLD0200B
           VALUE '95184480153268257'.
       78  XPC-FLD0201B
           VALUE '792759590444417882612526682351'.
       78  XPC-FLD0202B
           VALUE '37943227555010013122256395945441909'.
       78  XPC-FLD0203B
           VALUE '5835712416517114804656539879215415'.
       78  XPC-FLD0204B
           VALUE '23632656'.
       78  XPC-FLD0205B
           VALUE '288741127747638715028699'.
       78  XPC-FLD0206B
           VALUE '70639388766434425840361654'.
       78  XPC-FLD0207B
           VALUE '7691791385730962560263179739'.
       78  XPC-FLD0208B
           VALUE '21514986'.
       78  XPC-FLD0209B
           VALUE '795271109412971503516143201296'.
       78  XPC-FLD0210B
           VALUE '8'.
       78  XPC-FLD0211B
           VALUE '4421137707554604'.
       78  XPC-FLD0212B
           VALUE '2649683602641s'.
       78  XPC-FLD0213B
           VALUE '7525639770631302875997903356'.
       78  XPC-FLD0214B
           VALUE '6668932704655321508369070'.
       78  XPC-FLD0215B
           VALUE '17300r'.
       78  XPC-FLD0216B
           VALUE '5663716874'.
       78  XPC-FLD0217B
           VALUE '5191266215287889'.
       78  XPC-FLD0218B
           VALUE '4467255193327033602201936446363106369'.
       78  XPC-FLD0219B
           VALUE '58766925082182334127'.
       78  XPC-FLD0220B
           VALUE '2936u'.
       78  XPC-FLD0221B
           VALUE '878910367794605407176788958167890'.
       78  XPC-FLD0222B
           VALUE '9803s'.
       78  XPC-FLD0223B
           VALUE '69950927082806102497158917'.
       78  XPC-FLD0224B
           VALUE '3830076842766v'.
       78  XPC-FLD0225B
           VALUE '572612409808938978169'.
       78  XPC-FLD0226B
           VALUE '21150954'.
       78  XPC-FLD0227B
           VALUE '2038736443582994661522477889957372'.
       78  XPC-FLD0228B
           VALUE '6560309403122602756042169858119450510'.
       78  XPC-FLD0229B
           VALUE '7383802976208535540081356884'.
       78  XPC-FLD0230B
           VALUE '9x'.
       78  XPC-FLD0231B
           VALUE '270943347u'.
       78  XPC-FLD0232B
           VALUE '4749842313738054193504353861500'.
       78  XPC-FLD0233B
           VALUE '412919251494'.
       78  XPC-FLD0234B
           VALUE '5600680922670572133253'.
       78  XPC-FLD0235B
           VALUE '48083151871929563y'.
       78  XPC-FLD0236B
           VALUE '70471341881577547199277944'.
       78  XPC-FLD0237B
           VALUE '088849488581330880890618573175743'.
       78  XPC-FLD0238B
           VALUE '3227001'.
       78  XPC-FLD0239B
           VALUE '29332566026370832101832'.
       78  XPC-FLD0240B
           VALUE '0204109650584163561111186027120'.
       78  XPC-FLD0241B
           VALUE '60875735723205993171444'.
       78  XPC-FLD0242B
           VALUE '182084r'.
       78  XPC-FLD0243B
           VALUE '870255257093214798613800553539476'.
       78  XPC-FLD0244B
           VALUE '5964541497067354924865'.
       78  XPC-FLD0245B
           VALUE '264333833210099267317333'.
       78  XPC-FLD0246B
           VALUE '1209826'.
       78  XPC-FLD0247B
           VALUE '742067276785553808782225359'.
       78  XPC-FLD0248B
           VALUE '568358594454923286003'.
       78  XPC-FLD0249B
           VALUE '3516462579097082707946242'.
       78  XPC-FLD0250B
           VALUE '9267251332164047061614164335129317'.
       78  XPC-FLD0251B
           VALUE '3790591152463825338016431487631'.
       78  XPC-FLD0252B
           VALUE '23614266'.
       78  XPC-FLD0253B
           VALUE '21598977'.
       78  XPC-FLD0254B
           VALUE '94904362r'.
       78  XPC-FLD0255B
           VALUE '54081435076039155115'.
       78  XPC-FLD0256B
           VALUE '8751500721603051085707734273455571'.
       78  XPC-FLD0257B
           VALUE '408'.
       78  XPC-FLD0258B
           VALUE '08373758705249056762416399345967'.
       78  XPC-FLD0259B
           VALUE '3746683047259t'.
       78  XPC-FLD0260B
           VALUE '6017366610583895639607'.
       78  XPC-FLD0261B
           VALUE '00567161858323'.
       78  XPC-FLD0262B
           VALUE '68757658126759821329241049'.
       78  XPC-FLD0263B
           VALUE '40'.
       78  XPC-FLD0264B
           VALUE '166846'.
       78  XPC-FLD0265B
           VALUE '2298778729177715439249141127220354975'.
       78  XPC-FLD0266B
           VALUE '115052360207692161431225486003512427'.
       78  XPC-FLD0267B
           VALUE '23489014'.
       78  XPC-FLD0268B
           VALUE '8211500957830146774085733341053'.
       78  XPC-FLD0269B
           VALUE '0'.
       78  XPC-FLD0270B
           VALUE '373v'.
       78  XPC-FLD0271B
           VALUE '052759203'.
       78  XPC-FLD0272B
           VALUE '51600069630273368u'.
       78  XPC-FLD0273B
           VALUE '9036109253095580'.
       78  XPC-FLD0274B
           VALUE '52694748208586675958'.
       78  XPC-FLD0275B
           VALUE '242413794'.
       78  XPC-FLD0276B
           VALUE '26452912587946930678128865110919777'.
       78  XPC-FLD0277B
           VALUE '499215458601645512'.
       78  XPC-FLD0278B
           VALUE '7922277502052260016194509262277280'.
       78  XPC-FLD0279B
           VALUE '28001839602575101420001146834692918'.
       78  XPC-FLD0280B
           VALUE '686572532054675839148262639'.
       78  XPC-FLD0281B
           VALUE '50053214871016073'.
       78  XPC-FLD0282B
           VALUE '80366298088737049271049105300'.
       78  XPC-FLD0283B
           VALUE '18273y'.
       78  XPC-FLD0284B
           VALUE '1'.
       78  XPC-FLD0285B
           VALUE '7369214262351649891158444916'.
       78  XPC-FLD0286B
           VALUE '82453436'.
       78  XPC-FLD0287B
           VALUE '362829'.
       78  XPC-FLD0288B
           VALUE '558809488025126643861391416517087'.
       78  XPC-FLD0289B
           VALUE '567633089214293657540'.
       78  XPC-FLD0290B
           VALUE '113'.
       78  XPC-FLD0291B
           VALUE '8300179929109657213726070068560'.
       78  XPC-FLD0292B
           VALUE '0'.
       78  XPC-FLD0293B
           VALUE '30744391924'.
       78  XPC-FLD0294B
           VALUE '9'.
       78  XPC-FLD0295B
           VALUE '0364174t'.
       78  XPC-FLD0296B
           VALUE '574464025736577889141'.
       78  XPC-FLD0297B
           VALUE '5211000497602709295'.
       78  XPC-FLD0298B
           VALUE '9865365009908295859892746193509083241'.
       78  XPC-FLD0299B
           VALUE '7346908584680565956758964'.
       78  XPC-FLD0300B
           VALUE '55012674381377925092451'.
       78  XPC-FLD0301B
           VALUE '0'.
       78  XPC-FLD0302B
           VALUE '4291773342239684'.
       78  XPC-FLD0303B
           VALUE '9'.
       78  XPC-FLD0304B
           VALUE '556573438984127234968'.
       78  XPC-FLD0305B
           VALUE '5'.
       78  XPC-FLD0306B
           VALUE '49364188871768718q'.
       78  XPC-FLD0307B
           VALUE '68005145163846554765597747973515652'.
       78  XPC-FLD0308B
           VALUE '711937634336942757585120489238761366'.
       78  XPC-FLD0309B
           VALUE '09s'.
       78  XPC-FLD0310B
           VALUE '039167648388876'.
       78  XPC-FLD0311B
           VALUE '3931117203050255914931199185957666486'.
       78  XPC-FLD0312B
           VALUE '4'.
       78  XPC-FLD0313B
           VALUE '37515306459621'.
       78  XPC-FLD0314B
           VALUE '69720778107690404600560896'.
       78  XPC-FLD0315B
           VALUE '69624112217793877932514589'.
       78  XPC-FLD0316B
           VALUE '561166875766384822086'.
       78  XPC-FLD0317B
           VALUE '331361572492'.
       78  XPC-FLD0318B
           VALUE '754934282553785965724557627254399'.
       78  XPC-FLD0319B
           VALUE '720371110100740574821997'.
       78  XPC-FLD0320B
           VALUE '547024228165748174212'.
       78  XPC-FLD0321B
           VALUE '6656687959056812873818967'.
       78  XPC-FLD0322B
           VALUE '17591106469607443841432'.
       78  XPC-FLD0323B
           VALUE '726633859846741159138616694690426812'.
       78  XPC-FLD0324B
           VALUE '02824576327848049573'.
       78  XPC-FLD0325B
           VALUE '723337602353324218528882738'.
       78  XPC-FLD0326B
           VALUE '4y'.
       78  XPC-FLD0327B
           VALUE '21224467'.
       78  XPC-FLD0328B
           VALUE '4643225346405y'.
       78  XPC-FLD0329B
           VALUE '952096907591406971249625712516717612'.
       78  XPC-FLD0330B
           VALUE '732550190262212211019805617980'.
       78  XPC-FLD0331B
           VALUE '2990286983'.
       78  XPC-FLD0332B
           VALUE '3558444199192'.
       78  XPC-FLD0333B
           VALUE '243133331'.
       78  XPC-FLD0334B
           VALUE '297044413515'.
       78  XPC-FLD0335B
           VALUE '5106189445459805064'.
       78  XPC-FLD0336B
           VALUE '2933169889y'.
       78  XPC-FLD0337B
           VALUE '434132279525498709915609650'.
       78  XPC-FLD0338B
           VALUE '53047689000456310637'.
       78  XPC-FLD0339B
           VALUE '5943728837259434154840'.
       78  XPC-FLD0340B
           VALUE '389881349078x'.
       78  XPC-FLD0341B
           VALUE '248392469156514472666'.
       78  XPC-FLD0342B
           VALUE '4532923120813512t'.
       78  XPC-FLD0343B
           VALUE '0620927'.
       78  XPC-FLD0344B
           VALUE '606359905437156143820618581230520'.
       78  XPC-FLD0345B
           VALUE '405441574894889'.
       78  XPC-FLD0346B
           VALUE '6665377278444964848080900'.
       78  XPC-FLD0347B
           VALUE '324381'.
       78  XPC-FLD0348B
           VALUE '541608383617544100863'.
       78  XPC-FLD0349B
           VALUE '99162869882943715535583214659709483'.
       78  XPC-FLD0350B
           VALUE '8264871389960360762501068165875'.
       78  XPC-FLD0351B
           VALUE '53884121311052648707'.
       78  XPC-FLD0352B
           VALUE '1946919'.
       78  XPC-FLD0353B
           VALUE '94389336945631099347053805104224012'.
       78  XPC-FLD0354B
           VALUE '3116766074r'.
       78  XPC-FLD0355B
           VALUE '93287'.
       78  XPC-FLD0356B
           VALUE '83673557978976841628508509529638'.
       78  XPC-FLD0357B
           VALUE '079'.
       78  XPC-FLD0358B
           VALUE '65874749059638552239264936'.
       78  XPC-FLD0359B
           VALUE '9526039934819852117442415817981772124'.
       78  XPC-FLD0360B
           VALUE '7361138723'.
       78  XPC-FLD0361B
           VALUE '07851848643793046811367730697339'.
       78  XPC-FLD0362B
           VALUE '8970899599407193836242413453874178'.
       78  XPC-FLD0363B
           VALUE '4961135231796696550847514117776881'.
       78  XPC-FLD0364B
           VALUE '8287940009277749559970516202156'.
       78  XPC-FLD0365B
           VALUE '2107493896139311928536102'.
       78  XPC-FLD0366B
           VALUE '0157659331265924684828405588633'.
       78  XPC-FLD0367B
           VALUE '7840586'.
       78  XPC-FLD0368B
           VALUE '3'.
       78  XPC-FLD0369B
           VALUE '31224128387'.
       78  XPC-FLD0370B
           VALUE '0'.
       78  XPC-FLD0371B
           VALUE '08r'.
       78  XPC-FLD0372B
           VALUE '0049999527433343127'.
       78  XPC-FLD0373B
           VALUE '352559577504p'.
       78  XPC-FLD0374B
           VALUE '711264497973442155753787119'.
       78  XPC-FLD0375B
           VALUE '3'.
       78  XPC-FLD0376B
           VALUE '5240009617041836336'.
       78  XPC-FLD0377B
           VALUE '78137191821795531497030218304'.
       78  XPC-FLD0378B
           VALUE '16313u'.
       78  XPC-FLD0379B
           VALUE '4'.
       78  XPC-FLD0380B
           VALUE 'y'.
       78  XPC-FLD0381B
           VALUE '096'.
       78  XPC-FLD0382B
           VALUE '1909'.
       78  XPC-FLD0383B
           VALUE '810435186395222418864747737642'.
       78  XPC-FLD0384B
           VALUE '1'.
       78  XPC-FLD0385B
           VALUE '774134932514714546452413131744833'.
       78  XPC-FLD0386B
           VALUE '3467992789726692670323751189'.
       78  XPC-FLD0387B
           VALUE '6906513656145575095354897'.
       78  XPC-FLD0388B
           VALUE '326'.
       78  XPC-FLD0389B
           VALUE '0182625981352744592156'.
       78  XPC-FLD0390B
           VALUE '102'.
       78  XPC-FLD0391B
           VALUE '0373737127'.
       78  XPC-FLD0392B
           VALUE '46825106292883313'.
       78  XPC-FLD0393B
           VALUE '9072420163680885991652758093550801'.
       78  XPC-FLD0394B
           VALUE '47463048104358589r'.
       78  XPC-FLD0395B
           VALUE '3'.
       78  XPC-FLD0396B
           VALUE '0265476173063916'.
       78  XPC-FLD0397B
           VALUE '0w'.
       78  XPC-FLD0398B
           VALUE '284425285r'.
       78  XPC-FLD0399B
           VALUE '256742307'.
       78  XPC-FLD0400B
           VALUE '8678350299065256532010165028624'.
       78  XPC-FLD0401B
           VALUE '0'.
       78  XPC-FLD0402B
           VALUE '69644052220831165210812585'.
       78  XPC-FLD0403B
           VALUE '12518106356029089448417234962107613'.
       78  XPC-FLD0404B
           VALUE '4814436782579247780215241'.
       78  XPC-FLD0405B
           VALUE '14133'.
       78  XPC-FLD0406B
           VALUE '049908285391730064732712435215'.
       78  XPC-FLD0407B
           VALUE '8753049482988191082826919955550692975'.
       78  XPC-FLD0408B
           VALUE '0947331591'.
       78  XPC-FLD0409B
           VALUE '605266450165216657684'.
       78  XPC-FLD0410B
           VALUE '8786052888992391829545680593582801521'.
       78  XPC-FLD0411B
           VALUE '63491006980711595097943650973'.
       78  XPC-FLD0412B
           VALUE 'x'.
       78  XPC-FLD0413B
           VALUE '0'.
       78  XPC-FLD0414B
           VALUE '9979p'.
       78  XPC-FLD0415B
           VALUE '9072627958632073487733476063585840'.
       78  XPC-FLD0416B
           VALUE 'x'.
       78  XPC-FLD0417B
           VALUE '988613295763541566341103816739633'.
       78  XPC-FLD0418B
           VALUE '0'.
       78  XPC-FLD0419B
           VALUE '57648646369329730502'.
       78  XPC-FLD0420B
           VALUE '2098982695132051783275528578087688'.
       78  XPC-FLD0421B
           VALUE '2103833'.
       78  XPC-FLD0422B
           VALUE '752582761957935941759741251848172397'.
       78  XPC-FLD0423B
           VALUE '28494506043824296970249566'.
       78  XPC-FLD0424B
           VALUE '784268490871190770892359433'.
       78  XPC-FLD0425B
           VALUE '1105207822256892292772'.
       78  XPC-FLD0426B
           VALUE '001958844649331492605'.
       78  XPC-FLD0427B
           VALUE '30767310512910845380824639505'.
       78  XPC-FLD0428B
           VALUE '3481765503552540774734325168211935223'.
       78  XPC-FLD0429B
           VALUE '415311789274485'.
       78  XPC-FLD0430B
           VALUE '3147921208448'.
       78  XPC-FLD0431B
           VALUE '9203928254587173674039490833820309'.
       78  XPC-FLD0432B
           VALUE '46868y'.
       78  XPC-FLD0433B
           VALUE '2194580'.
       78  XPC-FLD0434B
           VALUE '60684270265800283242045907172723673'.
       78  XPC-FLD0435B
           VALUE '5848414431863717140299'.
       78  XPC-FLD0436B
           VALUE '8307195843004202551185244374210'.
       78  XPC-FLD0437B
           VALUE '276912651674409371338469'.
       78  XPC-FLD0438B
           VALUE '065939134788229547545486395847751'.
       78  XPC-FLD0439B
           VALUE '057198557021649332012'.
       78  XPC-FLD0440B
           VALUE '45546922388182033'.
       78  XPC-FLD0441B
           VALUE '4410365507278117'.
       78  XPC-FLD0442B
           VALUE '0793246258213504850331787565664854'.
       78  XPC-FLD0443B
           VALUE '12406922393517515692932'.
       78  XPC-FLD0444B
           VALUE '5047752750516173349'.
       78  XPC-FLD0445B
           VALUE '4623541965456258q'.
       78  XPC-FLD0446B
           VALUE '3796915192033033506944203'.
       78  XPC-FLD0447B
           VALUE '2771730669'.
       78  XPC-FLD0448B
           VALUE '53731039321367845601'.
       78  XPC-FLD0449B
           VALUE '50972077894w'.
       78  XPC-FLD0450B
           VALUE '0282777568876138030163'.
       78  XPC-FLD0451B
           VALUE '25173904p'.
       78  XPC-FLD0452B
           VALUE '554961704112127562772'.
       78  XPC-FLD0453B
           VALUE '432966208610221163829131910461001098'.
       78  XPC-FLD0454B
           VALUE '0'.
       78  XPC-FLD0455B
           VALUE '85105998788168291113720442808698'.
       78  XPC-FLD0456B
           VALUE '15602'.
       78  XPC-FLD0457B
           VALUE '4'.
       78  XPC-FLD0458B
           VALUE '319507534378'.
       78  XPC-FLD0459B
           VALUE '563566655806151518188'.
       78  XPC-FLD0460B
           VALUE '78345895335320658858790920930'.
       78  XPC-FLD0461B
           VALUE '21468392'.
       78  XPC-FLD0462B
           VALUE '004508805451474389691668420709902421'.
       78  XPC-FLD0463B
           VALUE '407334605648695'.
       78  XPC-FLD0464B
           VALUE '151737088129684206390490880'.
       78  XPC-FLD0465B
           VALUE '4019227771758718807584315561398'.
       78  XPC-FLD0466B
           VALUE '66690'.
       78  XPC-FLD0467B
           VALUE '221674677715112297171629052172647'.
       78  XPC-FLD0468B
           VALUE '14539915072'.
       78  XPC-FLD0469B
           VALUE '5200119971346918168'.
       78  XPC-FLD0470B
           VALUE '3831314368698y'.
       78  XPC-FLD0471B
           VALUE '4'.
       78  XPC-FLD0472B
           VALUE '14747530624073358364549755424378'.
       78  XPC-FLD0473B
           VALUE '44510935327360434676791101'.
       78  XPC-FLD0474B
           VALUE '1245p'.
       78  XPC-FLD0475B
           VALUE '008735531657721'.
       78  XPC-FLD0476B
           VALUE '6726270'.
       78  XPC-FLD0477B
           VALUE '3806441022820s'.
       78  XPC-FLD0478B
           VALUE '2732554753853'.
       78  XPC-FLD0479B
           VALUE '3225777432138897276100778981344'.
       78  XPC-FLD0480B
           VALUE '7459539941657910502685240317'.
       78  XPC-FLD0481B
           VALUE '7907459007614364265847939350351225584'.
       78  XPC-FLD0482B
           VALUE '49929259441115159q'.
       78  XPC-FLD0483B
           VALUE '323420128144'.
       78  XPC-FLD0484B
           VALUE '577123861473882282524'.
       78  XPC-FLD0485B
           VALUE '166880'.
       78  XPC-FLD0486B
           VALUE '45838007534965959'.
       78  XPC-FLD0487B
           VALUE '70416419749040885946681100'.
       78  XPC-FLD0488B
           VALUE '1888589981100687587906874'.
       78  XPC-FLD0489B
           VALUE '0649432173668728651705350785050541163'.
       78  XPC-FLD0490B
           VALUE '2396976320'.
       78  XPC-FLD0491B
           VALUE '6612864347936019645829430'.
       78  XPC-FLD0492B
           VALUE '3423161826575'.
       78  XPC-FLD0493B
           VALUE '790696459278862186593528349476'.
       78  XPC-FLD0494B
           VALUE '5132995328615615202'.
       78  XPC-FLD0495B
           VALUE '646882573915106698502768'.
       78  XPC-FLD0496B
           VALUE '552s'.
       78  XPC-FLD0497B
           VALUE '6663282286120654558381205'.
       78  XPC-FLD0498B
           VALUE '2658441'.
       78  XPC-FLD0499B
           VALUE '634131216402607308791345'.


       01  FILLER       USAGE BINARY-INT VALUE 0.
           88 DO-DISP   VALUE 0.
           88 NO-DISP   VALUE 1.

       REPLACE ==DISPLAY== BY ==IF DO-DISP  DISPLAY==.
       PROCEDURE        DIVISION.
       MAIN.
      *    Test with DISPLAY on error
           PERFORM DO-CHECK.
       >> IF CHECK-PERF IS DEFINED
           SET  NO-DISP    TO TRUE
      *    some performance checks on the way...
           PERFORM DO-CHECK 10000 TIMES.
       >> END-IF
           GOBACK.

       DO-CHECK.
      *2000-TEST.

           ADD FLD0001A        TO FLD0001B
               ROUNDED MODE IS AWAY-FROM-ZERO        .
           SUBTRACT FLD0002A        FROM FLD0002B
               ROUNDED MODE IS NEAREST-AWAY-FROM-ZERO.
           ADD FLD0003A        TO FLD0003B
               ROUNDED MODE IS NEAREST-EVEN          .
           SUBTRACT FLD0004A        FROM FLD0004B
               ROUNDED MODE IS NEAREST-TOWARD-ZERO   .
           ADD FLD0005A        TO FLD0005B
               ROUNDED MODE IS PROHIBITED            .
           SUBTRACT FLD0006A        FROM FLD0006B
               ROUNDED MODE IS TOWARD-GREATER        .
           ADD FLD0007A        TO FLD0007B
               ROUNDED MODE IS TOWARD-LESSER         .
           SUBTRACT FLD0008A        FROM FLD0008B
               ROUNDED MODE IS TRUNCATION            .
           ADD FLD0009A        TO FLD0009B
               ROUNDED MODE IS AWAY-FROM-ZERO        .
           SUBTRACT FLD0010A        FROM FLD0010B
               ROUNDED MODE IS NEAREST-AWAY-FROM-ZERO.
           ADD FLD0011A        TO FLD0011B
               ROUNDED MODE IS NEAREST-EVEN          .
           SUBTRACT FLD0012A        FROM FLD0012B
               ROUNDED MODE IS NEAREST-TOWARD-ZERO   .
           ADD FLD0013A        TO FLD0013B
               ROUNDED MODE IS PROHIBITED            .
           SUBTRACT FLD0014A        FROM FLD0014B
               ROUNDED MODE IS TOWARD-GREATER        .
           ADD FLD0015A        TO FLD0015B
               ROUNDED MODE IS TOWARD-LESSER         .
           SUBTRACT FLD0016A        FROM FLD0016B
               ROUNDED MODE IS TRUNCATION            .
           ADD FLD0017A        TO FLD0017B
               ROUNDED MODE IS AWAY-FROM-ZERO        .
           SUBTRACT FLD0018A        FROM FLD0018B
               ROUNDED MODE IS NEAREST-AWAY-FROM-ZERO.
           ADD FLD0019A        TO FLD0019B
               ROUNDED MODE IS NEAREST-EVEN          .
           SUBTRACT FLD0020A        FROM FLD0020B
               ROUNDED MODE IS NEAREST-TOWARD-ZERO   .
           ADD FLD0021A        TO FLD0021B
               ROUNDED MODE IS PROHIBITED            .
           SUBTRACT FLD0022A        FROM FLD0022B
               ROUNDED MODE IS TOWARD-GREATER        .
           ADD FLD0023A        TO FLD0023B
               ROUNDED MODE IS TOWARD-LESSER         .
           SUBTRACT FLD0024A        FROM FLD0024B
               ROUNDED MODE IS TRUNCATION            .
           ADD FLD0025A        TO FLD0025B
               ROUNDED MODE IS AWAY-FROM-ZERO        .
           SUBTRACT FLD0026A        FROM FLD0026B
               ROUNDED MODE IS NEAREST-AWAY-FROM-ZERO.
           ADD FLD0027A        TO FLD0027B
               ROUNDED MODE IS NEAREST-EVEN          .
           SUBTRACT FLD0028A        FROM FLD0028B
               ROUNDED MODE IS NEAREST-TOWARD-ZERO   .
           ADD FLD0029A        TO FLD0029B
               ROUNDED MODE IS PROHIBITED            .
           SUBTRACT FLD0030A        FROM FLD0030B
               ROUNDED MODE IS TOWARD-GREATER        .
           ADD FLD0031A        TO FLD0031B
               ROUNDED MODE IS TOWARD-LESSER         .
           SUBTRACT FLD0032A        FROM FLD0032B
               ROUNDED MODE IS TRUNCATION            .
           ADD FLD0033A        TO FLD0033B
               ROUNDED MODE IS AWAY-FROM-ZERO        .
           SUBTRACT FLD0034A        FROM FLD0034B
               ROUNDED MODE IS NEAREST-AWAY-FROM-ZERO.
           ADD FLD0035A        TO FLD0035B
               ROUNDED MODE IS NEAREST-EVEN          .
           SUBTRACT FLD0036A        FROM FLD0036B
               ROUNDED MODE IS NEAREST-TOWARD-ZERO   .
           ADD FLD0037A        TO FLD0037B
               ROUNDED MODE IS PROHIBITED            .
           SUBTRACT FLD0038A        FROM FLD0038B
               ROUNDED MODE IS TOWARD-GREATER        .
           ADD FLD0039A        TO FLD0039B
               ROUNDED MODE IS TOWARD-LESSER         .
           SUBTRACT FLD0040A        FROM FLD0040B
               ROUNDED MODE IS TRUNCATION            .
           ADD FLD0041A        TO FLD0041B
               ROUNDED MODE IS AWAY-FROM-ZERO        .
           SUBTRACT FLD0042A        FROM FLD0042B
               ROUNDED MODE IS NEAREST-AWAY-FROM-ZERO.
           ADD FLD0043A        TO FLD0043B
               ROUNDED MODE IS NEAREST-EVEN          .
           SUBTRACT FLD0044A        FROM FLD0044B
               ROUNDED MODE IS NEAREST-TOWARD-ZERO   .
           ADD FLD0045A        TO FLD0045B
               ROUNDED MODE IS PROHIBITED            .
           SUBTRACT FLD0046A        FROM FLD0046B
               ROUNDED MODE IS TOWARD-GREATER        .
           ADD FLD0047A        TO FLD0047B
               ROUNDED MODE IS TOWARD-LESSER         .
           SUBTRACT FLD0048A        FROM FLD0048B
               ROUNDED MODE IS TRUNCATION            .
           ADD FLD0049A        TO FLD0049B
               ROUNDED MODE IS AWAY-FROM-ZERO        .
           SUBTRACT FLD0050A        FROM FLD0050B
               ROUNDED MODE IS NEAREST-AWAY-FROM-ZERO.
           ADD FLD0051A        TO FLD0051B
               ROUNDED MODE IS NEAREST-EVEN          .
           SUBTRACT FLD0052A        FROM FLD0052B
               ROUNDED MODE IS NEAREST-TOWARD-ZERO   .
           ADD FLD0053A        TO FLD0053B
               ROUNDED MODE IS PROHIBITED            .
           SUBTRACT FLD0054A        FROM FLD0054B
               ROUNDED MODE IS TOWARD-GREATER        .
           ADD FLD0055A        TO FLD0055B
               ROUNDED MODE IS TOWARD-LESSER         .
           SUBTRACT FLD0056A        FROM FLD0056B
               ROUNDED MODE IS TRUNCATION            .
           ADD FLD0057A        TO FLD0057B
               ROUNDED MODE IS AWAY-FROM-ZERO        .
           SUBTRACT FLD0058A        FROM FLD0058B
               ROUNDED MODE IS NEAREST-AWAY-FROM-ZERO.
           ADD FLD0059A        TO FLD0059B
               ROUNDED MODE IS NEAREST-EVEN          .
           SUBTRACT FLD0060A        FROM FLD0060B
               ROUNDED MODE IS NEAREST-TOWARD-ZERO   .
           ADD FLD0061A        TO FLD0061B
               ROUNDED MODE IS PROHIBITED            .
           SUBTRACT FLD0062A        FROM FLD0062B
               ROUNDED MODE IS TOWARD-GREATER        .
           ADD FLD0063A        TO FLD0063B
               ROUNDED MODE IS TOWARD-LESSER         .
           SUBTRACT FLD0064A        FROM FLD0064B
               ROUNDED MODE IS TRUNCATION            .
           ADD FLD0065A        TO FLD0065B
               ROUNDED MODE IS AWAY-FROM-ZERO        .
           SUBTRACT FLD0066A        FROM FLD0066B
               ROUNDED MODE IS NEAREST-AWAY-FROM-ZERO.
           ADD FLD0067A        TO FLD0067B
               ROUNDED MODE IS NEAREST-EVEN          .
           SUBTRACT FLD0068A        FROM FLD0068B
               ROUNDED MODE IS NEAREST-TOWARD-ZERO   .
           ADD FLD0069A        TO FLD0069B
               ROUNDED MODE IS PROHIBITED            .
           SUBTRACT FLD0070A        FROM FLD0070B
               ROUNDED MODE IS TOWARD-GREATER        .
           ADD FLD0071A        TO FLD0071B
               ROUNDED MODE IS TOWARD-LESSER         .
           SUBTRACT FLD0072A        FROM FLD0072B
               ROUNDED MODE IS TRUNCATION            .
           ADD FLD0073A        TO FLD0073B
               ROUNDED MODE IS AWAY-FROM-ZERO        .
           SUBTRACT FLD0074A        FROM FLD0074B
               ROUNDED MODE IS NEAREST-AWAY-FROM-ZERO.
           ADD FLD0075A        TO FLD0075B
               ROUNDED MODE IS NEAREST-EVEN          .
           SUBTRACT FLD0076A        FROM FLD0076B
               ROUNDED MODE IS NEAREST-TOWARD-ZERO   .
           ADD FLD0077A        TO FLD0077B
               ROUNDED MODE IS PROHIBITED            .
           SUBTRACT FLD0078A        FROM FLD0078B
               ROUNDED MODE IS TOWARD-GREATER        .
           ADD FLD0079A        TO FLD0079B
               ROUNDED MODE IS TOWARD-LESSER         .
           SUBTRACT FLD0080A        FROM FLD0080B
               ROUNDED MODE IS TRUNCATION            .
           ADD FLD0081A        TO FLD0081B
               ROUNDED MODE IS AWAY-FROM-ZERO        .
           SUBTRACT FLD0082A        FROM FLD0082B
               ROUNDED MODE IS NEAREST-AWAY-FROM-ZERO.
           ADD FLD0083A        TO FLD0083B
               ROUNDED MODE IS NEAREST-EVEN          .
           SUBTRACT FLD0084A        FROM FLD0084B
               ROUNDED MODE IS NEAREST-TOWARD-ZERO   .
           ADD FLD0085A        TO FLD0085B
               ROUNDED MODE IS PROHIBITED            .
           SUBTRACT FLD0086A        FROM FLD0086B
               ROUNDED MODE IS TOWARD-GREATER        .
           ADD FLD0087A        TO FLD0087B
               ROUNDED MODE IS TOWARD-LESSER         .
           SUBTRACT FLD0088A        FROM FLD0088B
               ROUNDED MODE IS TRUNCATION            .
           ADD FLD0089A        TO FLD0089B
               ROUNDED MODE IS AWAY-FROM-ZERO        .
           SUBTRACT FLD0090A        FROM FLD0090B
               ROUNDED MODE IS NEAREST-AWAY-FROM-ZERO.
           ADD FLD0091A        TO FLD0091B
               ROUNDED MODE IS NEAREST-EVEN          .
           SUBTRACT FLD0092A        FROM FLD0092B
               ROUNDED MODE IS NEAREST-TOWARD-ZERO   .
           ADD FLD0093A        TO FLD0093B
               ROUNDED MODE IS PROHIBITED            .
           SUBTRACT FLD0094A        FROM FLD0094B
               ROUNDED MODE IS TOWARD-GREATER        .
           ADD FLD0095A        TO FLD0095B
               ROUNDED MODE IS TOWARD-LESSER         .
           SUBTRACT FLD0096A        FROM FLD0096B
               ROUNDED MODE IS TRUNCATION            .
           ADD FLD0097A        TO FLD0097B
               ROUNDED MODE IS AWAY-FROM-ZERO        .
           SUBTRACT FLD0098A        FROM FLD0098B
               ROUNDED MODE IS NEAREST-AWAY-FROM-ZERO.
           ADD FLD0099A        TO FLD0099B
               ROUNDED MODE IS NEAREST-EVEN          .
           SUBTRACT FLD0100A        FROM FLD0100B
               ROUNDED MODE IS NEAREST-TOWARD-ZERO   .
           ADD FLD0101A        TO FLD0101B
               ROUNDED MODE IS PROHIBITED            .
           SUBTRACT FLD0102A        FROM FLD0102B
               ROUNDED MODE IS TOWARD-GREATER        .
           ADD FLD0103A        TO FLD0103B
               ROUNDED MODE IS TOWARD-LESSER         .
           SUBTRACT FLD0104A        FROM FLD0104B
               ROUNDED MODE IS TRUNCATION            .
           ADD FLD0105A        TO FLD0105B
               ROUNDED MODE IS AWAY-FROM-ZERO        .
           SUBTRACT FLD0106A        FROM FLD0106B
               ROUNDED MODE IS NEAREST-AWAY-FROM-ZERO.
           ADD FLD0107A        TO FLD0107B
               ROUNDED MODE IS NEAREST-EVEN          .
           SUBTRACT FLD0108A        FROM FLD0108B
               ROUNDED MODE IS NEAREST-TOWARD-ZERO   .
           ADD FLD0109A        TO FLD0109B
               ROUNDED MODE IS PROHIBITED            .
           SUBTRACT FLD0110A        FROM FLD0110B
               ROUNDED MODE IS TOWARD-GREATER        .
           ADD FLD0111A        TO FLD0111B
               ROUNDED MODE IS TOWARD-LESSER         .
           SUBTRACT FLD0112A        FROM FLD0112B
               ROUNDED MODE IS TRUNCATION            .
           ADD FLD0113A        TO FLD0113B
               ROUNDED MODE IS AWAY-FROM-ZERO        .
           SUBTRACT FLD0114A        FROM FLD0114B
               ROUNDED MODE IS NEAREST-AWAY-FROM-ZERO.
           ADD FLD0115A        TO FLD0115B
               ROUNDED MODE IS NEAREST-EVEN          .
           SUBTRACT FLD0116A        FROM FLD0116B
               ROUNDED MODE IS NEAREST-TOWARD-ZERO   .
           ADD FLD0117A        TO FLD0117B
               ROUNDED MODE IS PROHIBITED            .
           SUBTRACT FLD0118A        FROM FLD0118B
               ROUNDED MODE IS TOWARD-GREATER        .
           ADD FLD0119A        TO FLD0119B
               ROUNDED MODE IS TOWARD-LESSER         .
           SUBTRACT FLD0120A        FROM FLD0120B
               ROUNDED MODE IS TRUNCATION            .
           ADD FLD0121A        TO FLD0121B
               ROUNDED MODE IS AWAY-FROM-ZERO        .
           SUBTRACT FLD0122A        FROM FLD0122B
               ROUNDED MODE IS NEAREST-AWAY-FROM-ZERO.
           ADD FLD0123A        TO FLD0123B
               ROUNDED MODE IS NEAREST-EVEN          .
           SUBTRACT FLD0124A        FROM FLD0124B
               ROUNDED MODE IS NEAREST-TOWARD-ZERO   .
           ADD FLD0125A        TO FLD0125B
               ROUNDED MODE IS PROHIBITED            .
           SUBTRACT FLD0126A        FROM FLD0126B
               ROUNDED MODE IS TOWARD-GREATER        .
           ADD FLD0127A        TO FLD0127B
               ROUNDED MODE IS TOWARD-LESSER         .
           SUBTRACT FLD0128A        FROM FLD0128B
               ROUNDED MODE IS TRUNCATION            .
           ADD FLD0129A        TO FLD0129B
               ROUNDED MODE IS AWAY-FROM-ZERO        .
           SUBTRACT FLD0130A        FROM FLD0130B
               ROUNDED MODE IS NEAREST-AWAY-FROM-ZERO.
           ADD FLD0131A        TO FLD0131B
               ROUNDED MODE IS NEAREST-EVEN          .
           SUBTRACT FLD0132A        FROM FLD0132B
               ROUNDED MODE IS NEAREST-TOWARD-ZERO   .
           ADD FLD0133A        TO FLD0133B
               ROUNDED MODE IS PROHIBITED            .
           SUBTRACT FLD0134A        FROM FLD0134B
               ROUNDED MODE IS TOWARD-GREATER        .
           ADD FLD0135A        TO FLD0135B
               ROUNDED MODE IS TOWARD-LESSER         .
           SUBTRACT FLD0136A        FROM FLD0136B
               ROUNDED MODE IS TRUNCATION            .
           ADD FLD0137A        TO FLD0137B
               ROUNDED MODE IS AWAY-FROM-ZERO        .
           SUBTRACT FLD0138A        FROM FLD0138B
               ROUNDED MODE IS NEAREST-AWAY-FROM-ZERO.
           ADD FLD0139A        TO FLD0139B
               ROUNDED MODE IS NEAREST-EVEN          .
           SUBTRACT FLD0140A        FROM FLD0140B
               ROUNDED MODE IS NEAREST-TOWARD-ZERO   .
           ADD FLD0141A        TO FLD0141B
               ROUNDED MODE IS PROHIBITED            .
           SUBTRACT FLD0142A        FROM FLD0142B
               ROUNDED MODE IS TOWARD-GREATER        .
           ADD FLD0143A        TO FLD0143B
               ROUNDED MODE IS TOWARD-LESSER         .
           SUBTRACT FLD0144A        FROM FLD0144B
               ROUNDED MODE IS TRUNCATION            .
           ADD FLD0145A        TO FLD0145B
               ROUNDED MODE IS AWAY-FROM-ZERO        .
           SUBTRACT FLD0146A        FROM FLD0146B
               ROUNDED MODE IS NEAREST-AWAY-FROM-ZERO.
           ADD FLD0147A        TO FLD0147B
               ROUNDED MODE IS NEAREST-EVEN          .
           SUBTRACT FLD0148A        FROM FLD0148B
               ROUNDED MODE IS NEAREST-TOWARD-ZERO   .
           ADD FLD0149A        TO FLD0149B
               ROUNDED MODE IS PROHIBITED            .
           SUBTRACT FLD0150A        FROM FLD0150B
               ROUNDED MODE IS TOWARD-GREATER        .
           ADD FLD0151A        TO FLD0151B
               ROUNDED MODE IS TOWARD-LESSER         .
           SUBTRACT FLD0152A        FROM FLD0152B
               ROUNDED MODE IS TRUNCATION            .
           ADD FLD0153A        TO FLD0153B
               ROUNDED MODE IS AWAY-FROM-ZERO        .
           SUBTRACT FLD0154A        FROM FLD0154B
               ROUNDED MODE IS NEAREST-AWAY-FROM-ZERO.
           ADD FLD0155A        TO FLD0155B
               ROUNDED MODE IS NEAREST-EVEN          .
           SUBTRACT FLD0156A        FROM FLD0156B
               ROUNDED MODE IS NEAREST-TOWARD-ZERO   .
           ADD FLD0157A        TO FLD0157B
               ROUNDED MODE IS PROHIBITED            .
           SUBTRACT FLD0158A        FROM FLD0158B
               ROUNDED MODE IS TOWARD-GREATER        .
           ADD FLD0159A        TO FLD0159B
               ROUNDED MODE IS TOWARD-LESSER         .
           SUBTRACT FLD0160A        FROM FLD0160B
               ROUNDED MODE IS TRUNCATION            .
           ADD FLD0161A        TO FLD0161B
               ROUNDED MODE IS AWAY-FROM-ZERO        .
           SUBTRACT FLD0162A        FROM FLD0162B
               ROUNDED MODE IS NEAREST-AWAY-FROM-ZERO.
           ADD FLD0163A        TO FLD0163B
               ROUNDED MODE IS NEAREST-EVEN          .
           SUBTRACT FLD0164A        FROM FLD0164B
               ROUNDED MODE IS NEAREST-TOWARD-ZERO   .
           ADD FLD0165A        TO FLD0165B
               ROUNDED MODE IS PROHIBITED            .
           SUBTRACT FLD0166A        FROM FLD0166B
               ROUNDED MODE IS TOWARD-GREATER        .
           ADD FLD0167A        TO FLD0167B
               ROUNDED MODE IS TOWARD-LESSER         .
           SUBTRACT FLD0168A        FROM FLD0168B
               ROUNDED MODE IS TRUNCATION            .
           ADD FLD0169A        TO FLD0169B
               ROUNDED MODE IS AWAY-FROM-ZERO        .
           SUBTRACT FLD0170A        FROM FLD0170B
               ROUNDED MODE IS NEAREST-AWAY-FROM-ZERO.
           ADD FLD0171A        TO FLD0171B
               ROUNDED MODE IS NEAREST-EVEN          .
           SUBTRACT FLD0172A        FROM FLD0172B
               ROUNDED MODE IS NEAREST-TOWARD-ZERO   .
           ADD FLD0173A        TO FLD0173B
               ROUNDED MODE IS PROHIBITED            .
           SUBTRACT FLD0174A        FROM FLD0174B
               ROUNDED MODE IS TOWARD-GREATER        .
           ADD FLD0175A        TO FLD0175B
               ROUNDED MODE IS TOWARD-LESSER         .
           SUBTRACT FLD0176A        FROM FLD0176B
               ROUNDED MODE IS TRUNCATION            .
           ADD FLD0177A        TO FLD0177B
               ROUNDED MODE IS AWAY-FROM-ZERO        .
           SUBTRACT FLD0178A        FROM FLD0178B
               ROUNDED MODE IS NEAREST-AWAY-FROM-ZERO.
           ADD FLD0179A        TO FLD0179B
               ROUNDED MODE IS NEAREST-EVEN          .
           SUBTRACT FLD0180A        FROM FLD0180B
               ROUNDED MODE IS NEAREST-TOWARD-ZERO   .
           ADD FLD0181A        TO FLD0181B
               ROUNDED MODE IS PROHIBITED            .
           SUBTRACT FLD0182A        FROM FLD0182B
               ROUNDED MODE IS TOWARD-GREATER        .
           ADD FLD0183A        TO FLD0183B
               ROUNDED MODE IS TOWARD-LESSER         .
           SUBTRACT FLD0184A        FROM FLD0184B
               ROUNDED MODE IS TRUNCATION            .
           ADD FLD0185A        TO FLD0185B
               ROUNDED MODE IS AWAY-FROM-ZERO        .
           SUBTRACT FLD0186A        FROM FLD0186B
               ROUNDED MODE IS NEAREST-AWAY-FROM-ZERO.
           ADD FLD0187A        TO FLD0187B
               ROUNDED MODE IS NEAREST-EVEN          .
           SUBTRACT FLD0188A        FROM FLD0188B
               ROUNDED MODE IS NEAREST-TOWARD-ZERO   .
           ADD FLD0189A        TO FLD0189B
               ROUNDED MODE IS PROHIBITED            .
           SUBTRACT FLD0190A        FROM FLD0190B
               ROUNDED MODE IS TOWARD-GREATER        .
           ADD FLD0191A        TO FLD0191B
               ROUNDED MODE IS TOWARD-LESSER         .
           SUBTRACT FLD0192A        FROM FLD0192B
               ROUNDED MODE IS TRUNCATION            .
           ADD FLD0193A        TO FLD0193B
               ROUNDED MODE IS AWAY-FROM-ZERO        .
           SUBTRACT FLD0194A        FROM FLD0194B
               ROUNDED MODE IS NEAREST-AWAY-FROM-ZERO.
           ADD FLD0195A        TO FLD0195B
               ROUNDED MODE IS NEAREST-EVEN          .
           SUBTRACT FLD0196A        FROM FLD0196B
               ROUNDED MODE IS NEAREST-TOWARD-ZERO   .
           ADD FLD0197A        TO FLD0197B
               ROUNDED MODE IS PROHIBITED            .
           SUBTRACT FLD0198A        FROM FLD0198B
               ROUNDED MODE IS TOWARD-GREATER        .
           ADD FLD0199A        TO FLD0199B
               ROUNDED MODE IS TOWARD-LESSER         .
           SUBTRACT FLD0200A        FROM FLD0200B
               ROUNDED MODE IS TRUNCATION            .
           ADD FLD0201A        TO FLD0201B
               ROUNDED MODE IS AWAY-FROM-ZERO        .
           SUBTRACT FLD0202A        FROM FLD0202B
               ROUNDED MODE IS NEAREST-AWAY-FROM-ZERO.
           ADD FLD0203A        TO FLD0203B
               ROUNDED MODE IS NEAREST-EVEN          .
           SUBTRACT FLD0204A        FROM FLD0204B
               ROUNDED MODE IS NEAREST-TOWARD-ZERO   .
           ADD FLD0205A        TO FLD0205B
               ROUNDED MODE IS PROHIBITED            .
           SUBTRACT FLD0206A        FROM FLD0206B
               ROUNDED MODE IS TOWARD-GREATER        .
           ADD FLD0207A        TO FLD0207B
               ROUNDED MODE IS TOWARD-LESSER         .
           SUBTRACT FLD0208A        FROM FLD0208B
               ROUNDED MODE IS TRUNCATION            .
           ADD FLD0209A        TO FLD0209B
               ROUNDED MODE IS AWAY-FROM-ZERO        .
           SUBTRACT FLD0210A        FROM FLD0210B
               ROUNDED MODE IS NEAREST-AWAY-FROM-ZERO.
           ADD FLD0211A        TO FLD0211B
               ROUNDED MODE IS NEAREST-EVEN          .
           SUBTRACT FLD0212A        FROM FLD0212B
               ROUNDED MODE IS NEAREST-TOWARD-ZERO   .
           ADD FLD0213A        TO FLD0213B
               ROUNDED MODE IS PROHIBITED            .
           SUBTRACT FLD0214A        FROM FLD0214B
               ROUNDED MODE IS TOWARD-GREATER        .
           ADD FLD0215A        TO FLD0215B
               ROUNDED MODE IS TOWARD-LESSER         .
           SUBTRACT FLD0216A        FROM FLD0216B
               ROUNDED MODE IS TRUNCATION            .
           ADD FLD0217A        TO FLD0217B
               ROUNDED MODE IS AWAY-FROM-ZERO        .
           SUBTRACT FLD0218A        FROM FLD0218B
               ROUNDED MODE IS NEAREST-AWAY-FROM-ZERO.
           ADD FLD0219A        TO FLD0219B
               ROUNDED MODE IS NEAREST-EVEN          .
           SUBTRACT FLD0220A        FROM FLD0220B
               ROUNDED MODE IS NEAREST-TOWARD-ZERO   .
           ADD FLD0221A        TO FLD0221B
               ROUNDED MODE IS PROHIBITED            .
           SUBTRACT FLD0222A        FROM FLD0222B
               ROUNDED MODE IS TOWARD-GREATER        .
           ADD FLD0223A        TO FLD0223B
               ROUNDED MODE IS TOWARD-LESSER         .
           SUBTRACT FLD0224A        FROM FLD0224B
               ROUNDED MODE IS TRUNCATION            .
           ADD FLD0225A        TO FLD0225B
               ROUNDED MODE IS AWAY-FROM-ZERO        .
           SUBTRACT FLD0226A        FROM FLD0226B
               ROUNDED MODE IS NEAREST-AWAY-FROM-ZERO.
           ADD FLD0227A        TO FLD0227B
               ROUNDED MODE IS NEAREST-EVEN          .
           SUBTRACT FLD0228A        FROM FLD0228B
               ROUNDED MODE IS NEAREST-TOWARD-ZERO   .
           ADD FLD0229A        TO FLD0229B
               ROUNDED MODE IS PROHIBITED            .
           SUBTRACT FLD0230A        FROM FLD0230B
               ROUNDED MODE IS TOWARD-GREATER        .
           ADD FLD0231A        TO FLD0231B
               ROUNDED MODE IS TOWARD-LESSER         .
           SUBTRACT FLD0232A        FROM FLD0232B
               ROUNDED MODE IS TRUNCATION            .
           ADD FLD0233A        TO FLD0233B
               ROUNDED MODE IS AWAY-FROM-ZERO        .
           SUBTRACT FLD0234A        FROM FLD0234B
               ROUNDED MODE IS NEAREST-AWAY-FROM-ZERO.
           ADD FLD0235A        TO FLD0235B
               ROUNDED MODE IS NEAREST-EVEN          .
           SUBTRACT FLD0236A        FROM FLD0236B
               ROUNDED MODE IS NEAREST-TOWARD-ZERO   .
           ADD FLD0237A        TO FLD0237B
               ROUNDED MODE IS PROHIBITED            .
           SUBTRACT FLD0238A        FROM FLD0238B
               ROUNDED MODE IS TOWARD-GREATER        .
           ADD FLD0239A        TO FLD0239B
               ROUNDED MODE IS TOWARD-LESSER         .
           SUBTRACT FLD0240A        FROM FLD0240B
               ROUNDED MODE IS TRUNCATION            .
           ADD FLD0241A        TO FLD0241B
               ROUNDED MODE IS AWAY-FROM-ZERO        .
           SUBTRACT FLD0242A        FROM FLD0242B
               ROUNDED MODE IS NEAREST-AWAY-FROM-ZERO.
           ADD FLD0243A        TO FLD0243B
               ROUNDED MODE IS NEAREST-EVEN          .
           SUBTRACT FLD0244A        FROM FLD0244B
               ROUNDED MODE IS NEAREST-TOWARD-ZERO   .
           ADD FLD0245A        TO FLD0245B
               ROUNDED MODE IS PROHIBITED            .
           SUBTRACT FLD0246A        FROM FLD0246B
               ROUNDED MODE IS TOWARD-GREATER        .
           ADD FLD0247A        TO FLD0247B
               ROUNDED MODE IS TOWARD-LESSER         .
           SUBTRACT FLD0248A        FROM FLD0248B
               ROUNDED MODE IS TRUNCATION            .
           ADD FLD0249A        TO FLD0249B
               ROUNDED MODE IS AWAY-FROM-ZERO        .
           SUBTRACT FLD0250A        FROM FLD0250B
               ROUNDED MODE IS NEAREST-AWAY-FROM-ZERO.
           ADD FLD0251A        TO FLD0251B
               ROUNDED MODE IS NEAREST-EVEN          .
           SUBTRACT FLD0252A        FROM FLD0252B
               ROUNDED MODE IS NEAREST-TOWARD-ZERO   .
           ADD FLD0253A        TO FLD0253B
               ROUNDED MODE IS PROHIBITED            .
           SUBTRACT FLD0254A        FROM FLD0254B
               ROUNDED MODE IS TOWARD-GREATER        .
           ADD FLD0255A        TO FLD0255B
               ROUNDED MODE IS TOWARD-LESSER         .
           SUBTRACT FLD0256A        FROM FLD0256B
               ROUNDED MODE IS TRUNCATION            .
           ADD FLD0257A        TO FLD0257B
               ROUNDED MODE IS AWAY-FROM-ZERO        .
           SUBTRACT FLD0258A        FROM FLD0258B
               ROUNDED MODE IS NEAREST-AWAY-FROM-ZERO.
           ADD FLD0259A        TO FLD0259B
               ROUNDED MODE IS NEAREST-EVEN          .
           SUBTRACT FLD0260A        FROM FLD0260B
               ROUNDED MODE IS NEAREST-TOWARD-ZERO   .
           ADD FLD0261A        TO FLD0261B
               ROUNDED MODE IS PROHIBITED            .
           SUBTRACT FLD0262A        FROM FLD0262B
               ROUNDED MODE IS TOWARD-GREATER        .
           ADD FLD0263A        TO FLD0263B
               ROUNDED MODE IS TOWARD-LESSER         .
           SUBTRACT FLD0264A        FROM FLD0264B
               ROUNDED MODE IS TRUNCATION            .
           ADD FLD0265A        TO FLD0265B
               ROUNDED MODE IS AWAY-FROM-ZERO        .
           SUBTRACT FLD0266A        FROM FLD0266B
               ROUNDED MODE IS NEAREST-AWAY-FROM-ZERO.
           ADD FLD0267A        TO FLD0267B
               ROUNDED MODE IS NEAREST-EVEN          .
           SUBTRACT FLD0268A        FROM FLD0268B
               ROUNDED MODE IS NEAREST-TOWARD-ZERO   .
           ADD FLD0269A        TO FLD0269B
               ROUNDED MODE IS PROHIBITED            .
           SUBTRACT FLD0270A        FROM FLD0270B
               ROUNDED MODE IS TOWARD-GREATER        .
           ADD FLD0271A        TO FLD0271B
               ROUNDED MODE IS TOWARD-LESSER         .
           SUBTRACT FLD0272A        FROM FLD0272B
               ROUNDED MODE IS TRUNCATION            .
           ADD FLD0273A        TO FLD0273B
               ROUNDED MODE IS AWAY-FROM-ZERO        .
           SUBTRACT FLD0274A        FROM FLD0274B
               ROUNDED MODE IS NEAREST-AWAY-FROM-ZERO.
           ADD FLD0275A        TO FLD0275B
               ROUNDED MODE IS NEAREST-EVEN          .
           SUBTRACT FLD0276A        FROM FLD0276B
               ROUNDED MODE IS NEAREST-TOWARD-ZERO   .
           ADD FLD0277A        TO FLD0277B
               ROUNDED MODE IS PROHIBITED            .
           SUBTRACT FLD0278A        FROM FLD0278B
               ROUNDED MODE IS TOWARD-GREATER        .
           ADD FLD0279A        TO FLD0279B
               ROUNDED MODE IS TOWARD-LESSER         .
           SUBTRACT FLD0280A        FROM FLD0280B
               ROUNDED MODE IS TRUNCATION            .
           ADD FLD0281A        TO FLD0281B
               ROUNDED MODE IS AWAY-FROM-ZERO        .
           SUBTRACT FLD0282A        FROM FLD0282B
               ROUNDED MODE IS NEAREST-AWAY-FROM-ZERO.
           ADD FLD0283A        TO FLD0283B
               ROUNDED MODE IS NEAREST-EVEN          .
           SUBTRACT FLD0284A        FROM FLD0284B
               ROUNDED MODE IS NEAREST-TOWARD-ZERO   .
           ADD FLD0285A        TO FLD0285B
               ROUNDED MODE IS PROHIBITED            .
           SUBTRACT FLD0286A        FROM FLD0286B
               ROUNDED MODE IS TOWARD-GREATER        .
           ADD FLD0287A        TO FLD0287B
               ROUNDED MODE IS TOWARD-LESSER         .
           SUBTRACT FLD0288A        FROM FLD0288B
               ROUNDED MODE IS TRUNCATION            .
           ADD FLD0289A        TO FLD0289B
               ROUNDED MODE IS AWAY-FROM-ZERO        .
           SUBTRACT FLD0290A        FROM FLD0290B
               ROUNDED MODE IS NEAREST-AWAY-FROM-ZERO.
           ADD FLD0291A        TO FLD0291B
               ROUNDED MODE IS NEAREST-EVEN          .
           SUBTRACT FLD0292A        FROM FLD0292B
               ROUNDED MODE IS NEAREST-TOWARD-ZERO   .
           ADD FLD0293A        TO FLD0293B
               ROUNDED MODE IS PROHIBITED            .
           SUBTRACT FLD0294A        FROM FLD0294B
               ROUNDED MODE IS TOWARD-GREATER        .
           ADD FLD0295A        TO FLD0295B
               ROUNDED MODE IS TOWARD-LESSER         .
           SUBTRACT FLD0296A        FROM FLD0296B
               ROUNDED MODE IS TRUNCATION            .
           ADD FLD0297A        TO FLD0297B
               ROUNDED MODE IS AWAY-FROM-ZERO        .
           SUBTRACT FLD0298A        FROM FLD0298B
               ROUNDED MODE IS NEAREST-AWAY-FROM-ZERO.
           ADD FLD0299A        TO FLD0299B
               ROUNDED MODE IS NEAREST-EVEN          .
           SUBTRACT FLD0300A        FROM FLD0300B
               ROUNDED MODE IS NEAREST-TOWARD-ZERO   .
           ADD FLD0301A        TO FLD0301B
               ROUNDED MODE IS PROHIBITED            .
           SUBTRACT FLD0302A        FROM FLD0302B
               ROUNDED MODE IS TOWARD-GREATER        .
           ADD FLD0303A        TO FLD0303B
               ROUNDED MODE IS TOWARD-LESSER         .
           SUBTRACT FLD0304A        FROM FLD0304B
               ROUNDED MODE IS TRUNCATION            .
           ADD FLD0305A        TO FLD0305B
               ROUNDED MODE IS AWAY-FROM-ZERO        .
           SUBTRACT FLD0306A        FROM FLD0306B
               ROUNDED MODE IS NEAREST-AWAY-FROM-ZERO.
           ADD FLD0307A        TO FLD0307B
               ROUNDED MODE IS NEAREST-EVEN          .
           SUBTRACT FLD0308A        FROM FLD0308B
               ROUNDED MODE IS NEAREST-TOWARD-ZERO   .
           ADD FLD0309A        TO FLD0309B
               ROUNDED MODE IS PROHIBITED            .
           SUBTRACT FLD0310A        FROM FLD0310B
               ROUNDED MODE IS TOWARD-GREATER        .
           ADD FLD0311A        TO FLD0311B
               ROUNDED MODE IS TOWARD-LESSER         .
           SUBTRACT FLD0312A        FROM FLD0312B
               ROUNDED MODE IS TRUNCATION            .
           ADD FLD0313A        TO FLD0313B
               ROUNDED MODE IS AWAY-FROM-ZERO        .
           SUBTRACT FLD0314A        FROM FLD0314B
               ROUNDED MODE IS NEAREST-AWAY-FROM-ZERO.
           ADD FLD0315A        TO FLD0315B
               ROUNDED MODE IS NEAREST-EVEN          .
           SUBTRACT FLD0316A        FROM FLD0316B
               ROUNDED MODE IS NEAREST-TOWARD-ZERO   .
           ADD FLD0317A        TO FLD0317B
               ROUNDED MODE IS PROHIBITED            .
           SUBTRACT FLD0318A        FROM FLD0318B
               ROUNDED MODE IS TOWARD-GREATER        .
           ADD FLD0319A        TO FLD0319B
               ROUNDED MODE IS TOWARD-LESSER         .
           SUBTRACT FLD0320A        FROM FLD0320B
               ROUNDED MODE IS TRUNCATION            .
           ADD FLD0321A        TO FLD0321B
               ROUNDED MODE IS AWAY-FROM-ZERO        .
           SUBTRACT FLD0322A        FROM FLD0322B
               ROUNDED MODE IS NEAREST-AWAY-FROM-ZERO.
           ADD FLD0323A        TO FLD0323B
               ROUNDED MODE IS NEAREST-EVEN          .
           SUBTRACT FLD0324A        FROM FLD0324B
               ROUNDED MODE IS NEAREST-TOWARD-ZERO   .
           ADD FLD0325A        TO FLD0325B
               ROUNDED MODE IS PROHIBITED            .
           SUBTRACT FLD0326A        FROM FLD0326B
               ROUNDED MODE IS TOWARD-GREATER        .
           ADD FLD0327A        TO FLD0327B
               ROUNDED MODE IS TOWARD-LESSER         .
           SUBTRACT FLD0328A        FROM FLD0328B
               ROUNDED MODE IS TRUNCATION            .
           ADD FLD0329A        TO FLD0329B
               ROUNDED MODE IS AWAY-FROM-ZERO        .
           SUBTRACT FLD0330A        FROM FLD0330B
               ROUNDED MODE IS NEAREST-AWAY-FROM-ZERO.
           ADD FLD0331A        TO FLD0331B
               ROUNDED MODE IS NEAREST-EVEN          .
           SUBTRACT FLD0332A        FROM FLD0332B
               ROUNDED MODE IS NEAREST-TOWARD-ZERO   .
           ADD FLD0333A        TO FLD0333B
               ROUNDED MODE IS PROHIBITED            .
           SUBTRACT FLD0334A        FROM FLD0334B
               ROUNDED MODE IS TOWARD-GREATER        .
           ADD FLD0335A        TO FLD0335B
               ROUNDED MODE IS TOWARD-LESSER         .
           SUBTRACT FLD0336A        FROM FLD0336B
               ROUNDED MODE IS TRUNCATION            .
           ADD FLD0337A        TO FLD0337B
               ROUNDED MODE IS AWAY-FROM-ZERO        .
           SUBTRACT FLD0338A        FROM FLD0338B
               ROUNDED MODE IS NEAREST-AWAY-FROM-ZERO.
           ADD FLD0339A        TO FLD0339B
               ROUNDED MODE IS NEAREST-EVEN          .
           SUBTRACT FLD0340A        FROM FLD0340B
               ROUNDED MODE IS NEAREST-TOWARD-ZERO   .
           ADD FLD0341A        TO FLD0341B
               ROUNDED MODE IS PROHIBITED            .
           SUBTRACT FLD0342A        FROM FLD0342B
               ROUNDED MODE IS TOWARD-GREATER        .
           ADD FLD0343A        TO FLD0343B
               ROUNDED MODE IS TOWARD-LESSER         .
           SUBTRACT FLD0344A        FROM FLD0344B
               ROUNDED MODE IS TRUNCATION            .
           ADD FLD0345A        TO FLD0345B
               ROUNDED MODE IS AWAY-FROM-ZERO        .
           SUBTRACT FLD0346A        FROM FLD0346B
               ROUNDED MODE IS NEAREST-AWAY-FROM-ZERO.
           ADD FLD0347A        TO FLD0347B
               ROUNDED MODE IS NEAREST-EVEN          .
           SUBTRACT FLD0348A        FROM FLD0348B
               ROUNDED MODE IS NEAREST-TOWARD-ZERO   .
           ADD FLD0349A        TO FLD0349B
               ROUNDED MODE IS PROHIBITED            .
           SUBTRACT FLD0350A        FROM FLD0350B
               ROUNDED MODE IS TOWARD-GREATER        .
           ADD FLD0351A        TO FLD0351B
               ROUNDED MODE IS TOWARD-LESSER         .
           SUBTRACT FLD0352A        FROM FLD0352B
               ROUNDED MODE IS TRUNCATION            .
           ADD FLD0353A        TO FLD0353B
               ROUNDED MODE IS AWAY-FROM-ZERO        .
           SUBTRACT FLD0354A        FROM FLD0354B
               ROUNDED MODE IS NEAREST-AWAY-FROM-ZERO.
           ADD FLD0355A        TO FLD0355B
               ROUNDED MODE IS NEAREST-EVEN          .
           SUBTRACT FLD0356A        FROM FLD0356B
               ROUNDED MODE IS NEAREST-TOWARD-ZERO   .
           ADD FLD0357A        TO FLD0357B
               ROUNDED MODE IS PROHIBITED            .
           SUBTRACT FLD0358A        FROM FLD0358B
               ROUNDED MODE IS TOWARD-GREATER        .
           ADD FLD0359A        TO FLD0359B
               ROUNDED MODE IS TOWARD-LESSER         .
           SUBTRACT FLD0360A        FROM FLD0360B
               ROUNDED MODE IS TRUNCATION            .
           ADD FLD0361A        TO FLD0361B
               ROUNDED MODE IS AWAY-FROM-ZERO        .
           SUBTRACT FLD0362A        FROM FLD0362B
               ROUNDED MODE IS NEAREST-AWAY-FROM-ZERO.
           ADD FLD0363A        TO FLD0363B
               ROUNDED MODE IS NEAREST-EVEN          .
           SUBTRACT FLD0364A        FROM FLD0364B
               ROUNDED MODE IS NEAREST-TOWARD-ZERO   .
           ADD FLD0365A        TO FLD0365B
               ROUNDED MODE IS PROHIBITED            .
           SUBTRACT FLD0366A        FROM FLD0366B
               ROUNDED MODE IS TOWARD-GREATER        .
           ADD FLD0367A        TO FLD0367B
               ROUNDED MODE IS TOWARD-LESSER         .
           SUBTRACT FLD0368A        FROM FLD0368B
               ROUNDED MODE IS TRUNCATION            .
           ADD FLD0369A        TO FLD0369B
               ROUNDED MODE IS AWAY-FROM-ZERO        .
           SUBTRACT FLD0370A        FROM FLD0370B
               ROUNDED MODE IS NEAREST-AWAY-FROM-ZERO.
           ADD FLD0371A        TO FLD0371B
               ROUNDED MODE IS NEAREST-EVEN          .
           SUBTRACT FLD0372A        FROM FLD0372B
               ROUNDED MODE IS NEAREST-TOWARD-ZERO   .
           ADD FLD0373A        TO FLD0373B
               ROUNDED MODE IS PROHIBITED            .
           SUBTRACT FLD0374A        FROM FLD0374B
               ROUNDED MODE IS TOWARD-GREATER        .
           ADD FLD0375A        TO FLD0375B
               ROUNDED MODE IS TOWARD-LESSER         .
           SUBTRACT FLD0376A        FROM FLD0376B
               ROUNDED MODE IS TRUNCATION            .
           ADD FLD0377A        TO FLD0377B
               ROUNDED MODE IS AWAY-FROM-ZERO        .
           SUBTRACT FLD0378A        FROM FLD0378B
               ROUNDED MODE IS NEAREST-AWAY-FROM-ZERO.
           ADD FLD0379A        TO FLD0379B
               ROUNDED MODE IS NEAREST-EVEN          .
           SUBTRACT FLD0380A        FROM FLD0380B
               ROUNDED MODE IS NEAREST-TOWARD-ZERO   .
           ADD FLD0381A        TO FLD0381B
               ROUNDED MODE IS PROHIBITED            .
           SUBTRACT FLD0382A        FROM FLD0382B
               ROUNDED MODE IS TOWARD-GREATER        .
           ADD FLD0383A        TO FLD0383B
               ROUNDED MODE IS TOWARD-LESSER         .
           SUBTRACT FLD0384A        FROM FLD0384B
               ROUNDED MODE IS TRUNCATION            .
           ADD FLD0385A        TO FLD0385B
               ROUNDED MODE IS AWAY-FROM-ZERO        .
           SUBTRACT FLD0386A        FROM FLD0386B
               ROUNDED MODE IS NEAREST-AWAY-FROM-ZERO.
           ADD FLD0387A        TO FLD0387B
               ROUNDED MODE IS NEAREST-EVEN          .
           SUBTRACT FLD0388A        FROM FLD0388B
               ROUNDED MODE IS NEAREST-TOWARD-ZERO   .
           ADD FLD0389A        TO FLD0389B
               ROUNDED MODE IS PROHIBITED            .
           SUBTRACT FLD0390A        FROM FLD0390B
               ROUNDED MODE IS TOWARD-GREATER        .
           ADD FLD0391A        TO FLD0391B
               ROUNDED MODE IS TOWARD-LESSER         .
           SUBTRACT FLD0392A        FROM FLD0392B
               ROUNDED MODE IS TRUNCATION            .
           ADD FLD0393A        TO FLD0393B
               ROUNDED MODE IS AWAY-FROM-ZERO        .
           SUBTRACT FLD0394A        FROM FLD0394B
               ROUNDED MODE IS NEAREST-AWAY-FROM-ZERO.
           ADD FLD0395A        TO FLD0395B
               ROUNDED MODE IS NEAREST-EVEN          .
           SUBTRACT FLD0396A        FROM FLD0396B
               ROUNDED MODE IS NEAREST-TOWARD-ZERO   .
           ADD FLD0397A        TO FLD0397B
               ROUNDED MODE IS PROHIBITED            .
           SUBTRACT FLD0398A        FROM FLD0398B
               ROUNDED MODE IS TOWARD-GREATER        .
           ADD FLD0399A        TO FLD0399B
               ROUNDED MODE IS TOWARD-LESSER         .
           SUBTRACT FLD0400A        FROM FLD0400B
               ROUNDED MODE IS TRUNCATION            .
           ADD FLD0401A        TO FLD0401B
               ROUNDED MODE IS AWAY-FROM-ZERO        .
           SUBTRACT FLD0402A        FROM FLD0402B
               ROUNDED MODE IS NEAREST-AWAY-FROM-ZERO.
           ADD FLD0403A        TO FLD0403B
               ROUNDED MODE IS NEAREST-EVEN          .
           SUBTRACT FLD0404A        FROM FLD0404B
               ROUNDED MODE IS NEAREST-TOWARD-ZERO   .
           ADD FLD0405A        TO FLD0405B
               ROUNDED MODE IS PROHIBITED            .
           SUBTRACT FLD0406A        FROM FLD0406B
               ROUNDED MODE IS TOWARD-GREATER        .
           ADD FLD0407A        TO FLD0407B
               ROUNDED MODE IS TOWARD-LESSER         .
           SUBTRACT FLD0408A        FROM FLD0408B
               ROUNDED MODE IS TRUNCATION            .
           ADD FLD0409A        TO FLD0409B
               ROUNDED MODE IS AWAY-FROM-ZERO        .
           SUBTRACT FLD0410A        FROM FLD0410B
               ROUNDED MODE IS NEAREST-AWAY-FROM-ZERO.
           ADD FLD0411A        TO FLD0411B
               ROUNDED MODE IS NEAREST-EVEN          .
           SUBTRACT FLD0412A        FROM FLD0412B
               ROUNDED MODE IS NEAREST-TOWARD-ZERO   .
           ADD FLD0413A        TO FLD0413B
               ROUNDED MODE IS PROHIBITED            .
           SUBTRACT FLD0414A        FROM FLD0414B
               ROUNDED MODE IS TOWARD-GREATER        .
           ADD FLD0415A        TO FLD0415B
               ROUNDED MODE IS TOWARD-LESSER         .
           SUBTRACT FLD0416A        FROM FLD0416B
               ROUNDED MODE IS TRUNCATION            .
           ADD FLD0417A        TO FLD0417B
               ROUNDED MODE IS AWAY-FROM-ZERO        .
           SUBTRACT FLD0418A        FROM FLD0418B
               ROUNDED MODE IS NEAREST-AWAY-FROM-ZERO.
           ADD FLD0419A        TO FLD0419B
               ROUNDED MODE IS NEAREST-EVEN          .
           SUBTRACT FLD0420A        FROM FLD0420B
               ROUNDED MODE IS NEAREST-TOWARD-ZERO   .
           ADD FLD0421A        TO FLD0421B
               ROUNDED MODE IS PROHIBITED            .
           SUBTRACT FLD0422A        FROM FLD0422B
               ROUNDED MODE IS TOWARD-GREATER        .
           ADD FLD0423A        TO FLD0423B
               ROUNDED MODE IS TOWARD-LESSER         .
           SUBTRACT FLD0424A        FROM FLD0424B
               ROUNDED MODE IS TRUNCATION            .
           ADD FLD0425A        TO FLD0425B
               ROUNDED MODE IS AWAY-FROM-ZERO        .
           SUBTRACT FLD0426A        FROM FLD0426B
               ROUNDED MODE IS NEAREST-AWAY-FROM-ZERO.
           ADD FLD0427A        TO FLD0427B
               ROUNDED MODE IS NEAREST-EVEN          .
           SUBTRACT FLD0428A        FROM FLD0428B
               ROUNDED MODE IS NEAREST-TOWARD-ZERO   .
           ADD FLD0429A        TO FLD0429B
               ROUNDED MODE IS PROHIBITED            .
           SUBTRACT FLD0430A        FROM FLD0430B
               ROUNDED MODE IS TOWARD-GREATER        .
           ADD FLD0431A        TO FLD0431B
               ROUNDED MODE IS TOWARD-LESSER         .
           SUBTRACT FLD0432A        FROM FLD0432B
               ROUNDED MODE IS TRUNCATION            .
           ADD FLD0433A        TO FLD0433B
               ROUNDED MODE IS AWAY-FROM-ZERO        .
           SUBTRACT FLD0434A        FROM FLD0434B
               ROUNDED MODE IS NEAREST-AWAY-FROM-ZERO.
           ADD FLD0435A        TO FLD0435B
               ROUNDED MODE IS NEAREST-EVEN          .
           SUBTRACT FLD0436A        FROM FLD0436B
               ROUNDED MODE IS NEAREST-TOWARD-ZERO   .
           ADD FLD0437A        TO FLD0437B
               ROUNDED MODE IS PROHIBITED            .
           SUBTRACT FLD0438A        FROM FLD0438B
               ROUNDED MODE IS TOWARD-GREATER        .
           ADD FLD0439A        TO FLD0439B
               ROUNDED MODE IS TOWARD-LESSER         .
           SUBTRACT FLD0440A        FROM FLD0440B
               ROUNDED MODE IS TRUNCATION            .
           ADD FLD0441A        TO FLD0441B
               ROUNDED MODE IS AWAY-FROM-ZERO        .
           SUBTRACT FLD0442A        FROM FLD0442B
               ROUNDED MODE IS NEAREST-AWAY-FROM-ZERO.
           ADD FLD0443A        TO FLD0443B
               ROUNDED MODE IS NEAREST-EVEN          .
           SUBTRACT FLD0444A        FROM FLD0444B
               ROUNDED MODE IS NEAREST-TOWARD-ZERO   .
           ADD FLD0445A        TO FLD0445B
               ROUNDED MODE IS PROHIBITED            .
           SUBTRACT FLD0446A        FROM FLD0446B
               ROUNDED MODE IS TOWARD-GREATER        .
           ADD FLD0447A        TO FLD0447B
               ROUNDED MODE IS TOWARD-LESSER         .
           SUBTRACT FLD0448A        FROM FLD0448B
               ROUNDED MODE IS TRUNCATION            .
           ADD FLD0449A        TO FLD0449B
               ROUNDED MODE IS AWAY-FROM-ZERO        .
           SUBTRACT FLD0450A        FROM FLD0450B
               ROUNDED MODE IS NEAREST-AWAY-FROM-ZERO.
           ADD FLD0451A        TO FLD0451B
               ROUNDED MODE IS NEAREST-EVEN          .
           SUBTRACT FLD0452A        FROM FLD0452B
               ROUNDED MODE IS NEAREST-TOWARD-ZERO   .
           ADD FLD0453A        TO FLD0453B
               ROUNDED MODE IS PROHIBITED            .
           SUBTRACT FLD0454A        FROM FLD0454B
               ROUNDED MODE IS TOWARD-GREATER        .
           ADD FLD0455A        TO FLD0455B
               ROUNDED MODE IS TOWARD-LESSER         .
           SUBTRACT FLD0456A        FROM FLD0456B
               ROUNDED MODE IS TRUNCATION            .
           ADD FLD0457A        TO FLD0457B
               ROUNDED MODE IS AWAY-FROM-ZERO        .
           SUBTRACT FLD0458A        FROM FLD0458B
               ROUNDED MODE IS NEAREST-AWAY-FROM-ZERO.
           ADD FLD0459A        TO FLD0459B
               ROUNDED MODE IS NEAREST-EVEN          .
           SUBTRACT FLD0460A        FROM FLD0460B
               ROUNDED MODE IS NEAREST-TOWARD-ZERO   .
           ADD FLD0461A        TO FLD0461B
               ROUNDED MODE IS PROHIBITED            .
           SUBTRACT FLD0462A        FROM FLD0462B
               ROUNDED MODE IS TOWARD-GREATER        .
           ADD FLD0463A        TO FLD0463B
               ROUNDED MODE IS TOWARD-LESSER         .
           SUBTRACT FLD0464A        FROM FLD0464B
               ROUNDED MODE IS TRUNCATION            .
           ADD FLD0465A        TO FLD0465B
               ROUNDED MODE IS AWAY-FROM-ZERO        .
           SUBTRACT FLD0466A        FROM FLD0466B
               ROUNDED MODE IS NEAREST-AWAY-FROM-ZERO.
           ADD FLD0467A        TO FLD0467B
               ROUNDED MODE IS NEAREST-EVEN          .
           SUBTRACT FLD0468A        FROM FLD0468B
               ROUNDED MODE IS NEAREST-TOWARD-ZERO   .
           ADD FLD0469A        TO FLD0469B
               ROUNDED MODE IS PROHIBITED            .
           SUBTRACT FLD0470A        FROM FLD0470B
               ROUNDED MODE IS TOWARD-GREATER        .
           ADD FLD0471A        TO FLD0471B
               ROUNDED MODE IS TOWARD-LESSER         .
           SUBTRACT FLD0472A        FROM FLD0472B
               ROUNDED MODE IS TRUNCATION            .
           ADD FLD0473A        TO FLD0473B
               ROUNDED MODE IS AWAY-FROM-ZERO        .
           SUBTRACT FLD0474A        FROM FLD0474B
               ROUNDED MODE IS NEAREST-AWAY-FROM-ZERO.
           ADD FLD0475A        TO FLD0475B
               ROUNDED MODE IS NEAREST-EVEN          .
           SUBTRACT FLD0476A        FROM FLD0476B
               ROUNDED MODE IS NEAREST-TOWARD-ZERO   .
           ADD FLD0477A        TO FLD0477B
               ROUNDED MODE IS PROHIBITED            .
           SUBTRACT FLD0478A        FROM FLD0478B
               ROUNDED MODE IS TOWARD-GREATER        .
           ADD FLD0479A        TO FLD0479B
               ROUNDED MODE IS TOWARD-LESSER         .
           SUBTRACT FLD0480A        FROM FLD0480B
               ROUNDED MODE IS TRUNCATION            .
           ADD FLD0481A        TO FLD0481B
               ROUNDED MODE IS AWAY-FROM-ZERO        .
           SUBTRACT FLD0482A        FROM FLD0482B
               ROUNDED MODE IS NEAREST-AWAY-FROM-ZERO.
           ADD FLD0483A        TO FLD0483B
               ROUNDED MODE IS NEAREST-EVEN          .
           SUBTRACT FLD0484A        FROM FLD0484B
               ROUNDED MODE IS NEAREST-TOWARD-ZERO   .
           ADD FLD0485A        TO FLD0485B
               ROUNDED MODE IS PROHIBITED            .
           SUBTRACT FLD0486A        FROM FLD0486B
               ROUNDED MODE IS TOWARD-GREATER        .
           ADD FLD0487A        TO FLD0487B
               ROUNDED MODE IS TOWARD-LESSER         .
           SUBTRACT FLD0488A        FROM FLD0488B
               ROUNDED MODE IS TRUNCATION            .
           ADD FLD0489A        TO FLD0489B
               ROUNDED MODE IS AWAY-FROM-ZERO        .
           SUBTRACT FLD0490A        FROM FLD0490B
               ROUNDED MODE IS NEAREST-AWAY-FROM-ZERO.
           ADD FLD0491A        TO FLD0491B
               ROUNDED MODE IS NEAREST-EVEN          .
           SUBTRACT FLD0492A        FROM FLD0492B
               ROUNDED MODE IS NEAREST-TOWARD-ZERO   .
           ADD FLD0493A        TO FLD0493B
               ROUNDED MODE IS PROHIBITED            .
           SUBTRACT FLD0494A        FROM FLD0494B
               ROUNDED MODE IS TOWARD-GREATER        .
           ADD FLD0495A        TO FLD0495B
               ROUNDED MODE IS TOWARD-LESSER         .
           SUBTRACT FLD0496A        FROM FLD0496B
               ROUNDED MODE IS TRUNCATION            .
           ADD FLD0497A        TO FLD0497B
               ROUNDED MODE IS AWAY-FROM-ZERO        .
           SUBTRACT FLD0498A        FROM FLD0498B
               ROUNDED MODE IS NEAREST-AWAY-FROM-ZERO.
           ADD FLD0499A        TO FLD0499B
               ROUNDED MODE IS NEAREST-EVEN          .

      *4000-COMPARE.

           IF FLD0001B (1:)    NOT EQUAL XPC-FLD0001B
              DISPLAY 'FLD0001B ==> ' FLD0001B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0001B.
           IF FLD0002B (1:)    NOT EQUAL XPC-FLD0002B
              DISPLAY 'FLD0002B ==> ' FLD0002B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0002B.
           IF FLD0003B (1:)    NOT EQUAL XPC-FLD0003B
              DISPLAY 'FLD0003B ==> ' FLD0003B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0003B.
           IF FLD0004B (1:)    NOT EQUAL XPC-FLD0004B
              DISPLAY 'FLD0004B ==> ' FLD0004B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0004B.
           IF FLD0005B (1:)    NOT EQUAL XPC-FLD0005B
              DISPLAY 'FLD0005B ==> ' FLD0005B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0005B.
           IF FLD0006B (1:)    NOT EQUAL XPC-FLD0006B
              DISPLAY 'FLD0006B ==> ' FLD0006B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0006B.
           IF FLD0007B (1:)    NOT EQUAL XPC-FLD0007B
              DISPLAY 'FLD0007B ==> ' FLD0007B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0007B.
           IF FLD0008B (1:)    NOT EQUAL XPC-FLD0008B
              DISPLAY 'FLD0008B ==> ' FLD0008B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0008B.
           IF FLD0009B (1:)    NOT EQUAL XPC-FLD0009B
              DISPLAY 'FLD0009B ==> ' FLD0009B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0009B.
           IF FLD0010B (1:)    NOT EQUAL XPC-FLD0010B
              DISPLAY 'FLD0010B ==> ' FLD0010B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0010B.
           IF FLD0011B (1:)    NOT EQUAL XPC-FLD0011B
              DISPLAY 'FLD0011B ==> ' FLD0011B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0011B.
           IF FLD0012B (1:)    NOT EQUAL XPC-FLD0012B
              DISPLAY 'FLD0012B ==> ' FLD0012B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0012B.
           IF FLD0013B (1:)    NOT EQUAL XPC-FLD0013B
              DISPLAY 'FLD0013B ==> ' FLD0013B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0013B.
           IF FLD0014B (1:)    NOT EQUAL XPC-FLD0014B
              DISPLAY 'FLD0014B ==> ' FLD0014B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0014B.
           IF FLD0015B (1:)    NOT EQUAL XPC-FLD0015B
              DISPLAY 'FLD0015B ==> ' FLD0015B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0015B.
           IF FLD0016B (1:)    NOT EQUAL XPC-FLD0016B
              DISPLAY 'FLD0016B ==> ' FLD0016B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0016B.
           IF FLD0017B (1:)    NOT EQUAL XPC-FLD0017B
              DISPLAY 'FLD0017B ==> ' FLD0017B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0017B.
           IF FLD0018B (1:)    NOT EQUAL XPC-FLD0018B
              DISPLAY 'FLD0018B ==> ' FLD0018B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0018B.
           IF FLD0019B (1:)    NOT EQUAL XPC-FLD0019B
              DISPLAY 'FLD0019B ==> ' FLD0019B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0019B.
           IF FLD0020B (1:)    NOT EQUAL XPC-FLD0020B
              DISPLAY 'FLD0020B ==> ' FLD0020B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0020B.
           IF FLD0021B (1:)    NOT EQUAL XPC-FLD0021B
              DISPLAY 'FLD0021B ==> ' FLD0021B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0021B.
           IF FLD0022B (1:)    NOT EQUAL XPC-FLD0022B
              DISPLAY 'FLD0022B ==> ' FLD0022B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0022B.
           IF FLD0023B (1:)    NOT EQUAL XPC-FLD0023B
              DISPLAY 'FLD0023B ==> ' FLD0023B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0023B.
           IF FLD0024B (1:)    NOT EQUAL XPC-FLD0024B
              DISPLAY 'FLD0024B ==> ' FLD0024B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0024B.
           IF FLD0025B (1:)    NOT EQUAL XPC-FLD0025B
              DISPLAY 'FLD0025B ==> ' FLD0025B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0025B.
           IF FLD0026B (1:)    NOT EQUAL XPC-FLD0026B
              DISPLAY 'FLD0026B ==> ' FLD0026B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0026B.
           IF FLD0027B (1:)    NOT EQUAL XPC-FLD0027B
              DISPLAY 'FLD0027B ==> ' FLD0027B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0027B.
           IF FLD0028B (1:)    NOT EQUAL XPC-FLD0028B
              DISPLAY 'FLD0028B ==> ' FLD0028B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0028B.
           IF FLD0029B (1:)    NOT EQUAL XPC-FLD0029B
              DISPLAY 'FLD0029B ==> ' FLD0029B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0029B.
           IF FLD0030B (1:)    NOT EQUAL XPC-FLD0030B
              DISPLAY 'FLD0030B ==> ' FLD0030B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0030B.
           IF FLD0031B (1:)    NOT EQUAL XPC-FLD0031B
              DISPLAY 'FLD0031B ==> ' FLD0031B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0031B.
           IF FLD0032B (1:)    NOT EQUAL XPC-FLD0032B
              DISPLAY 'FLD0032B ==> ' FLD0032B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0032B.
           IF FLD0033B (1:)    NOT EQUAL XPC-FLD0033B
              DISPLAY 'FLD0033B ==> ' FLD0033B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0033B.
           IF FLD0034B (1:)    NOT EQUAL XPC-FLD0034B
              DISPLAY 'FLD0034B ==> ' FLD0034B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0034B.
           IF FLD0035B (1:)    NOT EQUAL XPC-FLD0035B
              DISPLAY 'FLD0035B ==> ' FLD0035B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0035B.
           IF FLD0036B (1:)    NOT EQUAL XPC-FLD0036B
              DISPLAY 'FLD0036B ==> ' FLD0036B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0036B.
           IF FLD0037B (1:)    NOT EQUAL XPC-FLD0037B
              DISPLAY 'FLD0037B ==> ' FLD0037B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0037B.
           IF FLD0038B (1:)    NOT EQUAL XPC-FLD0038B
              DISPLAY 'FLD0038B ==> ' FLD0038B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0038B.
           IF FLD0039B (1:)    NOT EQUAL XPC-FLD0039B
              DISPLAY 'FLD0039B ==> ' FLD0039B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0039B.
           IF FLD0040B (1:)    NOT EQUAL XPC-FLD0040B
              DISPLAY 'FLD0040B ==> ' FLD0040B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0040B.
           IF FLD0041B (1:)    NOT EQUAL XPC-FLD0041B
              DISPLAY 'FLD0041B ==> ' FLD0041B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0041B.
           IF FLD0042B (1:)    NOT EQUAL XPC-FLD0042B
              DISPLAY 'FLD0042B ==> ' FLD0042B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0042B.
           IF FLD0043B (1:)    NOT EQUAL XPC-FLD0043B
              DISPLAY 'FLD0043B ==> ' FLD0043B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0043B.
           IF FLD0044B (1:)    NOT EQUAL XPC-FLD0044B
              DISPLAY 'FLD0044B ==> ' FLD0044B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0044B.
           IF FLD0045B (1:)    NOT EQUAL XPC-FLD0045B
              DISPLAY 'FLD0045B ==> ' FLD0045B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0045B.
           IF FLD0046B (1:)    NOT EQUAL XPC-FLD0046B
              DISPLAY 'FLD0046B ==> ' FLD0046B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0046B.
           IF FLD0047B (1:)    NOT EQUAL XPC-FLD0047B
              DISPLAY 'FLD0047B ==> ' FLD0047B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0047B.
           IF FLD0048B (1:)    NOT EQUAL XPC-FLD0048B
              DISPLAY 'FLD0048B ==> ' FLD0048B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0048B.
           IF FLD0049B (1:)    NOT EQUAL XPC-FLD0049B
              DISPLAY 'FLD0049B ==> ' FLD0049B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0049B.
           IF FLD0050B (1:)    NOT EQUAL XPC-FLD0050B
              DISPLAY 'FLD0050B ==> ' FLD0050B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0050B.
           IF FLD0051B (1:)    NOT EQUAL XPC-FLD0051B
              DISPLAY 'FLD0051B ==> ' FLD0051B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0051B.
           IF FLD0052B (1:)    NOT EQUAL XPC-FLD0052B
              DISPLAY 'FLD0052B ==> ' FLD0052B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0052B.
           IF FLD0053B (1:)    NOT EQUAL XPC-FLD0053B
              DISPLAY 'FLD0053B ==> ' FLD0053B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0053B.
           IF FLD0054B (1:)    NOT EQUAL XPC-FLD0054B
              DISPLAY 'FLD0054B ==> ' FLD0054B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0054B.
           IF FLD0055B (1:)    NOT EQUAL XPC-FLD0055B
              DISPLAY 'FLD0055B ==> ' FLD0055B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0055B.
           IF FLD0056B (1:)    NOT EQUAL XPC-FLD0056B
              DISPLAY 'FLD0056B ==> ' FLD0056B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0056B.
           IF FLD0057B (1:)    NOT EQUAL XPC-FLD0057B
              DISPLAY 'FLD0057B ==> ' FLD0057B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0057B.
           IF FLD0058B (1:)    NOT EQUAL XPC-FLD0058B
              DISPLAY 'FLD0058B ==> ' FLD0058B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0058B.
           IF FLD0059B (1:)    NOT EQUAL XPC-FLD0059B
              DISPLAY 'FLD0059B ==> ' FLD0059B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0059B.
           IF FLD0060B (1:)    NOT EQUAL XPC-FLD0060B
              DISPLAY 'FLD0060B ==> ' FLD0060B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0060B.
           IF FLD0061B (1:)    NOT EQUAL XPC-FLD0061B
              DISPLAY 'FLD0061B ==> ' FLD0061B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0061B.
           IF FLD0062B (1:)    NOT EQUAL XPC-FLD0062B
              DISPLAY 'FLD0062B ==> ' FLD0062B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0062B.
           IF FLD0063B (1:)    NOT EQUAL XPC-FLD0063B
              DISPLAY 'FLD0063B ==> ' FLD0063B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0063B.
           IF FLD0064B (1:)    NOT EQUAL XPC-FLD0064B
              DISPLAY 'FLD0064B ==> ' FLD0064B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0064B.
           IF FLD0065B (1:)    NOT EQUAL XPC-FLD0065B
              DISPLAY 'FLD0065B ==> ' FLD0065B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0065B.
           IF FLD0066B (1:)    NOT EQUAL XPC-FLD0066B
              DISPLAY 'FLD0066B ==> ' FLD0066B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0066B.
           IF FLD0067B (1:)    NOT EQUAL XPC-FLD0067B
              DISPLAY 'FLD0067B ==> ' FLD0067B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0067B.
           IF FLD0068B (1:)    NOT EQUAL XPC-FLD0068B
              DISPLAY 'FLD0068B ==> ' FLD0068B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0068B.
           IF FLD0069B (1:)    NOT EQUAL XPC-FLD0069B
              DISPLAY 'FLD0069B ==> ' FLD0069B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0069B.
           IF FLD0070B (1:)    NOT EQUAL XPC-FLD0070B
              DISPLAY 'FLD0070B ==> ' FLD0070B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0070B.
           IF FLD0071B (1:)    NOT EQUAL XPC-FLD0071B
              DISPLAY 'FLD0071B ==> ' FLD0071B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0071B.
           IF FLD0072B (1:)    NOT EQUAL XPC-FLD0072B
              DISPLAY 'FLD0072B ==> ' FLD0072B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0072B.
           IF FLD0073B (1:)    NOT EQUAL XPC-FLD0073B
              DISPLAY 'FLD0073B ==> ' FLD0073B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0073B.
           IF FLD0074B (1:)    NOT EQUAL XPC-FLD0074B
              DISPLAY 'FLD0074B ==> ' FLD0074B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0074B.
           IF FLD0075B (1:)    NOT EQUAL XPC-FLD0075B
              DISPLAY 'FLD0075B ==> ' FLD0075B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0075B.
           IF FLD0076B (1:)    NOT EQUAL XPC-FLD0076B
              DISPLAY 'FLD0076B ==> ' FLD0076B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0076B.
           IF FLD0077B (1:)    NOT EQUAL XPC-FLD0077B
              DISPLAY 'FLD0077B ==> ' FLD0077B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0077B.
           IF FLD0078B (1:)    NOT EQUAL XPC-FLD0078B
              DISPLAY 'FLD0078B ==> ' FLD0078B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0078B.
           IF FLD0079B (1:)    NOT EQUAL XPC-FLD0079B
              DISPLAY 'FLD0079B ==> ' FLD0079B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0079B.
           IF FLD0080B (1:)    NOT EQUAL XPC-FLD0080B
              DISPLAY 'FLD0080B ==> ' FLD0080B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0080B.
           IF FLD0081B (1:)    NOT EQUAL XPC-FLD0081B
              DISPLAY 'FLD0081B ==> ' FLD0081B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0081B.
           IF FLD0082B (1:)    NOT EQUAL XPC-FLD0082B
              DISPLAY 'FLD0082B ==> ' FLD0082B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0082B.
           IF FLD0083B (1:)    NOT EQUAL XPC-FLD0083B
              DISPLAY 'FLD0083B ==> ' FLD0083B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0083B.
           IF FLD0084B (1:)    NOT EQUAL XPC-FLD0084B
              DISPLAY 'FLD0084B ==> ' FLD0084B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0084B.
           IF FLD0085B (1:)    NOT EQUAL XPC-FLD0085B
              DISPLAY 'FLD0085B ==> ' FLD0085B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0085B.
           IF FLD0086B (1:)    NOT EQUAL XPC-FLD0086B
              DISPLAY 'FLD0086B ==> ' FLD0086B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0086B.
           IF FLD0087B (1:)    NOT EQUAL XPC-FLD0087B
              DISPLAY 'FLD0087B ==> ' FLD0087B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0087B.
           IF FLD0088B (1:)    NOT EQUAL XPC-FLD0088B
              DISPLAY 'FLD0088B ==> ' FLD0088B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0088B.
           IF FLD0089B (1:)    NOT EQUAL XPC-FLD0089B
              DISPLAY 'FLD0089B ==> ' FLD0089B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0089B.
           IF FLD0090B (1:)    NOT EQUAL XPC-FLD0090B
              DISPLAY 'FLD0090B ==> ' FLD0090B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0090B.
           IF FLD0091B (1:)    NOT EQUAL XPC-FLD0091B
              DISPLAY 'FLD0091B ==> ' FLD0091B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0091B.
           IF FLD0092B (1:)    NOT EQUAL XPC-FLD0092B
              DISPLAY 'FLD0092B ==> ' FLD0092B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0092B.
           IF FLD0093B (1:)    NOT EQUAL XPC-FLD0093B
              DISPLAY 'FLD0093B ==> ' FLD0093B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0093B.
           IF FLD0094B (1:)    NOT EQUAL XPC-FLD0094B
              DISPLAY 'FLD0094B ==> ' FLD0094B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0094B.
           IF FLD0095B (1:)    NOT EQUAL XPC-FLD0095B
              DISPLAY 'FLD0095B ==> ' FLD0095B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0095B.
           IF FLD0096B (1:)    NOT EQUAL XPC-FLD0096B
              DISPLAY 'FLD0096B ==> ' FLD0096B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0096B.
           IF FLD0097B (1:)    NOT EQUAL XPC-FLD0097B
              DISPLAY 'FLD0097B ==> ' FLD0097B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0097B.
           IF FLD0098B (1:)    NOT EQUAL XPC-FLD0098B
              DISPLAY 'FLD0098B ==> ' FLD0098B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0098B.
           IF FLD0099B (1:)    NOT EQUAL XPC-FLD0099B
              DISPLAY 'FLD0099B ==> ' FLD0099B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0099B.
           IF FLD0100B (1:)    NOT EQUAL XPC-FLD0100B
              DISPLAY 'FLD0100B ==> ' FLD0100B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0100B.
           IF FLD0101B (1:)    NOT EQUAL XPC-FLD0101B
              DISPLAY 'FLD0101B ==> ' FLD0101B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0101B.
           IF FLD0102B (1:)    NOT EQUAL XPC-FLD0102B
              DISPLAY 'FLD0102B ==> ' FLD0102B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0102B.
           IF FLD0103B (1:)    NOT EQUAL XPC-FLD0103B
              DISPLAY 'FLD0103B ==> ' FLD0103B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0103B.
           IF FLD0104B (1:)    NOT EQUAL XPC-FLD0104B
              DISPLAY 'FLD0104B ==> ' FLD0104B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0104B.
           IF FLD0105B (1:)    NOT EQUAL XPC-FLD0105B
              DISPLAY 'FLD0105B ==> ' FLD0105B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0105B.
           IF FLD0106B (1:)    NOT EQUAL XPC-FLD0106B
              DISPLAY 'FLD0106B ==> ' FLD0106B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0106B.
           IF FLD0107B (1:)    NOT EQUAL XPC-FLD0107B
              DISPLAY 'FLD0107B ==> ' FLD0107B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0107B.
           IF FLD0108B (1:)    NOT EQUAL XPC-FLD0108B
              DISPLAY 'FLD0108B ==> ' FLD0108B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0108B.
           IF FLD0109B (1:)    NOT EQUAL XPC-FLD0109B
              DISPLAY 'FLD0109B ==> ' FLD0109B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0109B.
           IF FLD0110B (1:)    NOT EQUAL XPC-FLD0110B
              DISPLAY 'FLD0110B ==> ' FLD0110B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0110B.
           IF FLD0111B (1:)    NOT EQUAL XPC-FLD0111B
              DISPLAY 'FLD0111B ==> ' FLD0111B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0111B.
           IF FLD0112B (1:)    NOT EQUAL XPC-FLD0112B
              DISPLAY 'FLD0112B ==> ' FLD0112B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0112B.
           IF FLD0113B (1:)    NOT EQUAL XPC-FLD0113B
              DISPLAY 'FLD0113B ==> ' FLD0113B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0113B.
           IF FLD0114B (1:)    NOT EQUAL XPC-FLD0114B
              DISPLAY 'FLD0114B ==> ' FLD0114B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0114B.
           IF FLD0115B (1:)    NOT EQUAL XPC-FLD0115B
              DISPLAY 'FLD0115B ==> ' FLD0115B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0115B.
           IF FLD0116B (1:)    NOT EQUAL XPC-FLD0116B
              DISPLAY 'FLD0116B ==> ' FLD0116B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0116B.
           IF FLD0117B (1:)    NOT EQUAL XPC-FLD0117B
              DISPLAY 'FLD0117B ==> ' FLD0117B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0117B.
           IF FLD0118B (1:)    NOT EQUAL XPC-FLD0118B
              DISPLAY 'FLD0118B ==> ' FLD0118B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0118B.
           IF FLD0119B (1:)    NOT EQUAL XPC-FLD0119B
              DISPLAY 'FLD0119B ==> ' FLD0119B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0119B.
           IF FLD0120B (1:)    NOT EQUAL XPC-FLD0120B
              DISPLAY 'FLD0120B ==> ' FLD0120B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0120B.
           IF FLD0121B (1:)    NOT EQUAL XPC-FLD0121B
              DISPLAY 'FLD0121B ==> ' FLD0121B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0121B.
           IF FLD0122B (1:)    NOT EQUAL XPC-FLD0122B
              DISPLAY 'FLD0122B ==> ' FLD0122B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0122B.
           IF FLD0123B (1:)    NOT EQUAL XPC-FLD0123B
              DISPLAY 'FLD0123B ==> ' FLD0123B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0123B.
           IF FLD0124B (1:)    NOT EQUAL XPC-FLD0124B
              DISPLAY 'FLD0124B ==> ' FLD0124B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0124B.
           IF FLD0125B (1:)    NOT EQUAL XPC-FLD0125B
              DISPLAY 'FLD0125B ==> ' FLD0125B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0125B.
           IF FLD0126B (1:)    NOT EQUAL XPC-FLD0126B
              DISPLAY 'FLD0126B ==> ' FLD0126B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0126B.
           IF FLD0127B (1:)    NOT EQUAL XPC-FLD0127B
              DISPLAY 'FLD0127B ==> ' FLD0127B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0127B.
           IF FLD0128B (1:)    NOT EQUAL XPC-FLD0128B
              DISPLAY 'FLD0128B ==> ' FLD0128B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0128B.
           IF FLD0129B (1:)    NOT EQUAL XPC-FLD0129B
              DISPLAY 'FLD0129B ==> ' FLD0129B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0129B.
           IF FLD0130B (1:)    NOT EQUAL XPC-FLD0130B
              DISPLAY 'FLD0130B ==> ' FLD0130B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0130B.
           IF FLD0131B (1:)    NOT EQUAL XPC-FLD0131B
              DISPLAY 'FLD0131B ==> ' FLD0131B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0131B.
           IF FLD0132B (1:)    NOT EQUAL XPC-FLD0132B
              DISPLAY 'FLD0132B ==> ' FLD0132B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0132B.
           IF FLD0133B (1:)    NOT EQUAL XPC-FLD0133B
              DISPLAY 'FLD0133B ==> ' FLD0133B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0133B.
           IF FLD0134B (1:)    NOT EQUAL XPC-FLD0134B
              DISPLAY 'FLD0134B ==> ' FLD0134B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0134B.
           IF FLD0135B (1:)    NOT EQUAL XPC-FLD0135B
              DISPLAY 'FLD0135B ==> ' FLD0135B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0135B.
           IF FLD0136B (1:)    NOT EQUAL XPC-FLD0136B
              DISPLAY 'FLD0136B ==> ' FLD0136B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0136B.
           IF FLD0137B (1:)    NOT EQUAL XPC-FLD0137B
              DISPLAY 'FLD0137B ==> ' FLD0137B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0137B.
           IF FLD0138B (1:)    NOT EQUAL XPC-FLD0138B
              DISPLAY 'FLD0138B ==> ' FLD0138B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0138B.
           IF FLD0139B (1:)    NOT EQUAL XPC-FLD0139B
              DISPLAY 'FLD0139B ==> ' FLD0139B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0139B.
           IF FLD0140B (1:)    NOT EQUAL XPC-FLD0140B
              DISPLAY 'FLD0140B ==> ' FLD0140B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0140B.
           IF FLD0141B (1:)    NOT EQUAL XPC-FLD0141B
              DISPLAY 'FLD0141B ==> ' FLD0141B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0141B.
           IF FLD0142B (1:)    NOT EQUAL XPC-FLD0142B
              DISPLAY 'FLD0142B ==> ' FLD0142B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0142B.
           IF FLD0143B (1:)    NOT EQUAL XPC-FLD0143B
              DISPLAY 'FLD0143B ==> ' FLD0143B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0143B.
           IF FLD0144B (1:)    NOT EQUAL XPC-FLD0144B
              DISPLAY 'FLD0144B ==> ' FLD0144B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0144B.
           IF FLD0145B (1:)    NOT EQUAL XPC-FLD0145B
              DISPLAY 'FLD0145B ==> ' FLD0145B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0145B.
           IF FLD0146B (1:)    NOT EQUAL XPC-FLD0146B
              DISPLAY 'FLD0146B ==> ' FLD0146B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0146B.
           IF FLD0147B (1:)    NOT EQUAL XPC-FLD0147B
              DISPLAY 'FLD0147B ==> ' FLD0147B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0147B.
           IF FLD0148B (1:)    NOT EQUAL XPC-FLD0148B
              DISPLAY 'FLD0148B ==> ' FLD0148B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0148B.
           IF FLD0149B (1:)    NOT EQUAL XPC-FLD0149B
              DISPLAY 'FLD0149B ==> ' FLD0149B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0149B.
           IF FLD0150B (1:)    NOT EQUAL XPC-FLD0150B
              DISPLAY 'FLD0150B ==> ' FLD0150B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0150B.
           IF FLD0151B (1:)    NOT EQUAL XPC-FLD0151B
              DISPLAY 'FLD0151B ==> ' FLD0151B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0151B.
           IF FLD0152B (1:)    NOT EQUAL XPC-FLD0152B
              DISPLAY 'FLD0152B ==> ' FLD0152B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0152B.
           IF FLD0153B (1:)    NOT EQUAL XPC-FLD0153B
              DISPLAY 'FLD0153B ==> ' FLD0153B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0153B.
           IF FLD0154B (1:)    NOT EQUAL XPC-FLD0154B
              DISPLAY 'FLD0154B ==> ' FLD0154B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0154B.
           IF FLD0155B (1:)    NOT EQUAL XPC-FLD0155B
              DISPLAY 'FLD0155B ==> ' FLD0155B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0155B.
           IF FLD0156B (1:)    NOT EQUAL XPC-FLD0156B
              DISPLAY 'FLD0156B ==> ' FLD0156B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0156B.
           IF FLD0157B (1:)    NOT EQUAL XPC-FLD0157B
              DISPLAY 'FLD0157B ==> ' FLD0157B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0157B.
           IF FLD0158B (1:)    NOT EQUAL XPC-FLD0158B
              DISPLAY 'FLD0158B ==> ' FLD0158B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0158B.
           IF FLD0159B (1:)    NOT EQUAL XPC-FLD0159B
              DISPLAY 'FLD0159B ==> ' FLD0159B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0159B.
           IF FLD0160B (1:)    NOT EQUAL XPC-FLD0160B
              DISPLAY 'FLD0160B ==> ' FLD0160B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0160B.
           IF FLD0161B (1:)    NOT EQUAL XPC-FLD0161B
              DISPLAY 'FLD0161B ==> ' FLD0161B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0161B.
           IF FLD0162B (1:)    NOT EQUAL XPC-FLD0162B
              DISPLAY 'FLD0162B ==> ' FLD0162B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0162B.
           IF FLD0163B (1:)    NOT EQUAL XPC-FLD0163B
              DISPLAY 'FLD0163B ==> ' FLD0163B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0163B.
           IF FLD0164B (1:)    NOT EQUAL XPC-FLD0164B
              DISPLAY 'FLD0164B ==> ' FLD0164B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0164B.
           IF FLD0165B (1:)    NOT EQUAL XPC-FLD0165B
              DISPLAY 'FLD0165B ==> ' FLD0165B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0165B.
           IF FLD0166B (1:)    NOT EQUAL XPC-FLD0166B
              DISPLAY 'FLD0166B ==> ' FLD0166B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0166B.
           IF FLD0167B (1:)    NOT EQUAL XPC-FLD0167B
              DISPLAY 'FLD0167B ==> ' FLD0167B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0167B.
           IF FLD0168B (1:)    NOT EQUAL XPC-FLD0168B
              DISPLAY 'FLD0168B ==> ' FLD0168B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0168B.
           IF FLD0169B (1:)    NOT EQUAL XPC-FLD0169B
              DISPLAY 'FLD0169B ==> ' FLD0169B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0169B.
           IF FLD0170B (1:)    NOT EQUAL XPC-FLD0170B
              DISPLAY 'FLD0170B ==> ' FLD0170B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0170B.
           IF FLD0171B (1:)    NOT EQUAL XPC-FLD0171B
              DISPLAY 'FLD0171B ==> ' FLD0171B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0171B.
           IF FLD0172B (1:)    NOT EQUAL XPC-FLD0172B
              DISPLAY 'FLD0172B ==> ' FLD0172B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0172B.
           IF FLD0173B (1:)    NOT EQUAL XPC-FLD0173B
              DISPLAY 'FLD0173B ==> ' FLD0173B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0173B.
           IF FLD0174B (1:)    NOT EQUAL XPC-FLD0174B
              DISPLAY 'FLD0174B ==> ' FLD0174B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0174B.
           IF FLD0175B (1:)    NOT EQUAL XPC-FLD0175B
              DISPLAY 'FLD0175B ==> ' FLD0175B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0175B.
           IF FLD0176B (1:)    NOT EQUAL XPC-FLD0176B
              DISPLAY 'FLD0176B ==> ' FLD0176B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0176B.
           IF FLD0177B (1:)    NOT EQUAL XPC-FLD0177B
              DISPLAY 'FLD0177B ==> ' FLD0177B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0177B.
           IF FLD0178B (1:)    NOT EQUAL XPC-FLD0178B
              DISPLAY 'FLD0178B ==> ' FLD0178B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0178B.
           IF FLD0179B (1:)    NOT EQUAL XPC-FLD0179B
              DISPLAY 'FLD0179B ==> ' FLD0179B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0179B.
           IF FLD0180B (1:)    NOT EQUAL XPC-FLD0180B
              DISPLAY 'FLD0180B ==> ' FLD0180B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0180B.
           IF FLD0181B (1:)    NOT EQUAL XPC-FLD0181B
              DISPLAY 'FLD0181B ==> ' FLD0181B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0181B.
           IF FLD0182B (1:)    NOT EQUAL XPC-FLD0182B
              DISPLAY 'FLD0182B ==> ' FLD0182B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0182B.
           IF FLD0183B (1:)    NOT EQUAL XPC-FLD0183B
              DISPLAY 'FLD0183B ==> ' FLD0183B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0183B.
           IF FLD0184B (1:)    NOT EQUAL XPC-FLD0184B
              DISPLAY 'FLD0184B ==> ' FLD0184B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0184B.
           IF FLD0185B (1:)    NOT EQUAL XPC-FLD0185B
              DISPLAY 'FLD0185B ==> ' FLD0185B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0185B.
           IF FLD0186B (1:)    NOT EQUAL XPC-FLD0186B
              DISPLAY 'FLD0186B ==> ' FLD0186B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0186B.
           IF FLD0187B (1:)    NOT EQUAL XPC-FLD0187B
              DISPLAY 'FLD0187B ==> ' FLD0187B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0187B.
           IF FLD0188B (1:)    NOT EQUAL XPC-FLD0188B
              DISPLAY 'FLD0188B ==> ' FLD0188B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0188B.
           IF FLD0189B (1:)    NOT EQUAL XPC-FLD0189B
              DISPLAY 'FLD0189B ==> ' FLD0189B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0189B.
           IF FLD0190B (1:)    NOT EQUAL XPC-FLD0190B
              DISPLAY 'FLD0190B ==> ' FLD0190B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0190B.
           IF FLD0191B (1:)    NOT EQUAL XPC-FLD0191B
              DISPLAY 'FLD0191B ==> ' FLD0191B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0191B.
           IF FLD0192B (1:)    NOT EQUAL XPC-FLD0192B
              DISPLAY 'FLD0192B ==> ' FLD0192B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0192B.
           IF FLD0193B (1:)    NOT EQUAL XPC-FLD0193B
              DISPLAY 'FLD0193B ==> ' FLD0193B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0193B.
           IF FLD0194B (1:)    NOT EQUAL XPC-FLD0194B
              DISPLAY 'FLD0194B ==> ' FLD0194B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0194B.
           IF FLD0195B (1:)    NOT EQUAL XPC-FLD0195B
              DISPLAY 'FLD0195B ==> ' FLD0195B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0195B.
           IF FLD0196B (1:)    NOT EQUAL XPC-FLD0196B
              DISPLAY 'FLD0196B ==> ' FLD0196B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0196B.
           IF FLD0197B (1:)    NOT EQUAL XPC-FLD0197B
              DISPLAY 'FLD0197B ==> ' FLD0197B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0197B.
           IF FLD0198B (1:)    NOT EQUAL XPC-FLD0198B
              DISPLAY 'FLD0198B ==> ' FLD0198B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0198B.
           IF FLD0199B (1:)    NOT EQUAL XPC-FLD0199B
              DISPLAY 'FLD0199B ==> ' FLD0199B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0199B.
           IF FLD0200B (1:)    NOT EQUAL XPC-FLD0200B
              DISPLAY 'FLD0200B ==> ' FLD0200B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0200B.
           IF FLD0201B (1:)    NOT EQUAL XPC-FLD0201B
              DISPLAY 'FLD0201B ==> ' FLD0201B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0201B.
           IF FLD0202B (1:)    NOT EQUAL XPC-FLD0202B
              DISPLAY 'FLD0202B ==> ' FLD0202B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0202B.
           IF FLD0203B (1:)    NOT EQUAL XPC-FLD0203B
              DISPLAY 'FLD0203B ==> ' FLD0203B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0203B.
           IF FLD0204B (1:)    NOT EQUAL XPC-FLD0204B
              DISPLAY 'FLD0204B ==> ' FLD0204B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0204B.
           IF FLD0205B (1:)    NOT EQUAL XPC-FLD0205B
              DISPLAY 'FLD0205B ==> ' FLD0205B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0205B.
           IF FLD0206B (1:)    NOT EQUAL XPC-FLD0206B
              DISPLAY 'FLD0206B ==> ' FLD0206B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0206B.
           IF FLD0207B (1:)    NOT EQUAL XPC-FLD0207B
              DISPLAY 'FLD0207B ==> ' FLD0207B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0207B.
           IF FLD0208B (1:)    NOT EQUAL XPC-FLD0208B
              DISPLAY 'FLD0208B ==> ' FLD0208B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0208B.
           IF FLD0209B (1:)    NOT EQUAL XPC-FLD0209B
              DISPLAY 'FLD0209B ==> ' FLD0209B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0209B.
           IF FLD0210B (1:)    NOT EQUAL XPC-FLD0210B
              DISPLAY 'FLD0210B ==> ' FLD0210B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0210B.
           IF FLD0211B (1:)    NOT EQUAL XPC-FLD0211B
              DISPLAY 'FLD0211B ==> ' FLD0211B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0211B.
           IF FLD0212B (1:)    NOT EQUAL XPC-FLD0212B
              DISPLAY 'FLD0212B ==> ' FLD0212B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0212B.
           IF FLD0213B (1:)    NOT EQUAL XPC-FLD0213B
              DISPLAY 'FLD0213B ==> ' FLD0213B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0213B.
           IF FLD0214B (1:)    NOT EQUAL XPC-FLD0214B
              DISPLAY 'FLD0214B ==> ' FLD0214B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0214B.
           IF FLD0215B (1:)    NOT EQUAL XPC-FLD0215B
              DISPLAY 'FLD0215B ==> ' FLD0215B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0215B.
           IF FLD0216B (1:)    NOT EQUAL XPC-FLD0216B
              DISPLAY 'FLD0216B ==> ' FLD0216B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0216B.
           IF FLD0217B (1:)    NOT EQUAL XPC-FLD0217B
              DISPLAY 'FLD0217B ==> ' FLD0217B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0217B.
           IF FLD0218B (1:)    NOT EQUAL XPC-FLD0218B
              DISPLAY 'FLD0218B ==> ' FLD0218B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0218B.
           IF FLD0219B (1:)    NOT EQUAL XPC-FLD0219B
              DISPLAY 'FLD0219B ==> ' FLD0219B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0219B.
           IF FLD0220B (1:)    NOT EQUAL XPC-FLD0220B
              DISPLAY 'FLD0220B ==> ' FLD0220B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0220B.
           IF FLD0221B (1:)    NOT EQUAL XPC-FLD0221B
              DISPLAY 'FLD0221B ==> ' FLD0221B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0221B.
           IF FLD0222B (1:)    NOT EQUAL XPC-FLD0222B
              DISPLAY 'FLD0222B ==> ' FLD0222B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0222B.
           IF FLD0223B (1:)    NOT EQUAL XPC-FLD0223B
              DISPLAY 'FLD0223B ==> ' FLD0223B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0223B.
           IF FLD0224B (1:)    NOT EQUAL XPC-FLD0224B
              DISPLAY 'FLD0224B ==> ' FLD0224B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0224B.
           IF FLD0225B (1:)    NOT EQUAL XPC-FLD0225B
              DISPLAY 'FLD0225B ==> ' FLD0225B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0225B.
           IF FLD0226B (1:)    NOT EQUAL XPC-FLD0226B
              DISPLAY 'FLD0226B ==> ' FLD0226B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0226B.
           IF FLD0227B (1:)    NOT EQUAL XPC-FLD0227B
              DISPLAY 'FLD0227B ==> ' FLD0227B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0227B.
           IF FLD0228B (1:)    NOT EQUAL XPC-FLD0228B
              DISPLAY 'FLD0228B ==> ' FLD0228B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0228B.
           IF FLD0229B (1:)    NOT EQUAL XPC-FLD0229B
              DISPLAY 'FLD0229B ==> ' FLD0229B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0229B.
           IF FLD0230B (1:)    NOT EQUAL XPC-FLD0230B
              DISPLAY 'FLD0230B ==> ' FLD0230B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0230B.
           IF FLD0231B (1:)    NOT EQUAL XPC-FLD0231B
              DISPLAY 'FLD0231B ==> ' FLD0231B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0231B.
           IF FLD0232B (1:)    NOT EQUAL XPC-FLD0232B
              DISPLAY 'FLD0232B ==> ' FLD0232B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0232B.
           IF FLD0233B (1:)    NOT EQUAL XPC-FLD0233B
              DISPLAY 'FLD0233B ==> ' FLD0233B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0233B.
           IF FLD0234B (1:)    NOT EQUAL XPC-FLD0234B
              DISPLAY 'FLD0234B ==> ' FLD0234B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0234B.
           IF FLD0235B (1:)    NOT EQUAL XPC-FLD0235B
              DISPLAY 'FLD0235B ==> ' FLD0235B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0235B.
           IF FLD0236B (1:)    NOT EQUAL XPC-FLD0236B
              DISPLAY 'FLD0236B ==> ' FLD0236B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0236B.
           IF FLD0237B (1:)    NOT EQUAL XPC-FLD0237B
              DISPLAY 'FLD0237B ==> ' FLD0237B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0237B.
           IF FLD0238B (1:)    NOT EQUAL XPC-FLD0238B
              DISPLAY 'FLD0238B ==> ' FLD0238B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0238B.
           IF FLD0239B (1:)    NOT EQUAL XPC-FLD0239B
              DISPLAY 'FLD0239B ==> ' FLD0239B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0239B.
           IF FLD0240B (1:)    NOT EQUAL XPC-FLD0240B
              DISPLAY 'FLD0240B ==> ' FLD0240B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0240B.
           IF FLD0241B (1:)    NOT EQUAL XPC-FLD0241B
              DISPLAY 'FLD0241B ==> ' FLD0241B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0241B.
           IF FLD0242B (1:)    NOT EQUAL XPC-FLD0242B
              DISPLAY 'FLD0242B ==> ' FLD0242B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0242B.
           IF FLD0243B (1:)    NOT EQUAL XPC-FLD0243B
              DISPLAY 'FLD0243B ==> ' FLD0243B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0243B.
           IF FLD0244B (1:)    NOT EQUAL XPC-FLD0244B
              DISPLAY 'FLD0244B ==> ' FLD0244B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0244B.
           IF FLD0245B (1:)    NOT EQUAL XPC-FLD0245B
              DISPLAY 'FLD0245B ==> ' FLD0245B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0245B.
           IF FLD0246B (1:)    NOT EQUAL XPC-FLD0246B
              DISPLAY 'FLD0246B ==> ' FLD0246B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0246B.
           IF FLD0247B (1:)    NOT EQUAL XPC-FLD0247B
              DISPLAY 'FLD0247B ==> ' FLD0247B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0247B.
           IF FLD0248B (1:)    NOT EQUAL XPC-FLD0248B
              DISPLAY 'FLD0248B ==> ' FLD0248B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0248B.
           IF FLD0249B (1:)    NOT EQUAL XPC-FLD0249B
              DISPLAY 'FLD0249B ==> ' FLD0249B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0249B.
           IF FLD0250B (1:)    NOT EQUAL XPC-FLD0250B
              DISPLAY 'FLD0250B ==> ' FLD0250B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0250B.
           IF FLD0251B (1:)    NOT EQUAL XPC-FLD0251B
              DISPLAY 'FLD0251B ==> ' FLD0251B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0251B.
           IF FLD0252B (1:)    NOT EQUAL XPC-FLD0252B
              DISPLAY 'FLD0252B ==> ' FLD0252B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0252B.
           IF FLD0253B (1:)    NOT EQUAL XPC-FLD0253B
              DISPLAY 'FLD0253B ==> ' FLD0253B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0253B.
           IF FLD0254B (1:)    NOT EQUAL XPC-FLD0254B
              DISPLAY 'FLD0254B ==> ' FLD0254B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0254B.
           IF FLD0255B (1:)    NOT EQUAL XPC-FLD0255B
              DISPLAY 'FLD0255B ==> ' FLD0255B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0255B.
           IF FLD0256B (1:)    NOT EQUAL XPC-FLD0256B
              DISPLAY 'FLD0256B ==> ' FLD0256B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0256B.
           IF FLD0257B (1:)    NOT EQUAL XPC-FLD0257B
              DISPLAY 'FLD0257B ==> ' FLD0257B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0257B.
           IF FLD0258B (1:)    NOT EQUAL XPC-FLD0258B
              DISPLAY 'FLD0258B ==> ' FLD0258B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0258B.
           IF FLD0259B (1:)    NOT EQUAL XPC-FLD0259B
              DISPLAY 'FLD0259B ==> ' FLD0259B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0259B.
           IF FLD0260B (1:)    NOT EQUAL XPC-FLD0260B
              DISPLAY 'FLD0260B ==> ' FLD0260B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0260B.
           IF FLD0261B (1:)    NOT EQUAL XPC-FLD0261B
              DISPLAY 'FLD0261B ==> ' FLD0261B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0261B.
           IF FLD0262B (1:)    NOT EQUAL XPC-FLD0262B
              DISPLAY 'FLD0262B ==> ' FLD0262B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0262B.
           IF FLD0263B (1:)    NOT EQUAL XPC-FLD0263B
              DISPLAY 'FLD0263B ==> ' FLD0263B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0263B.
           IF FLD0264B (1:)    NOT EQUAL XPC-FLD0264B
              DISPLAY 'FLD0264B ==> ' FLD0264B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0264B.
           IF FLD0265B (1:)    NOT EQUAL XPC-FLD0265B
              DISPLAY 'FLD0265B ==> ' FLD0265B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0265B.
           IF FLD0266B (1:)    NOT EQUAL XPC-FLD0266B
              DISPLAY 'FLD0266B ==> ' FLD0266B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0266B.
           IF FLD0267B (1:)    NOT EQUAL XPC-FLD0267B
              DISPLAY 'FLD0267B ==> ' FLD0267B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0267B.
           IF FLD0268B (1:)    NOT EQUAL XPC-FLD0268B
              DISPLAY 'FLD0268B ==> ' FLD0268B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0268B.
           IF FLD0269B (1:)    NOT EQUAL XPC-FLD0269B
              DISPLAY 'FLD0269B ==> ' FLD0269B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0269B.
           IF FLD0270B (1:)    NOT EQUAL XPC-FLD0270B
              DISPLAY 'FLD0270B ==> ' FLD0270B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0270B.
           IF FLD0271B (1:)    NOT EQUAL XPC-FLD0271B
              DISPLAY 'FLD0271B ==> ' FLD0271B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0271B.
           IF FLD0272B (1:)    NOT EQUAL XPC-FLD0272B
              DISPLAY 'FLD0272B ==> ' FLD0272B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0272B.
           IF FLD0273B (1:)    NOT EQUAL XPC-FLD0273B
              DISPLAY 'FLD0273B ==> ' FLD0273B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0273B.
           IF FLD0274B (1:)    NOT EQUAL XPC-FLD0274B
              DISPLAY 'FLD0274B ==> ' FLD0274B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0274B.
           IF FLD0275B (1:)    NOT EQUAL XPC-FLD0275B
              DISPLAY 'FLD0275B ==> ' FLD0275B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0275B.
           IF FLD0276B (1:)    NOT EQUAL XPC-FLD0276B
              DISPLAY 'FLD0276B ==> ' FLD0276B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0276B.
           IF FLD0277B (1:)    NOT EQUAL XPC-FLD0277B
              DISPLAY 'FLD0277B ==> ' FLD0277B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0277B.
           IF FLD0278B (1:)    NOT EQUAL XPC-FLD0278B
              DISPLAY 'FLD0278B ==> ' FLD0278B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0278B.
           IF FLD0279B (1:)    NOT EQUAL XPC-FLD0279B
              DISPLAY 'FLD0279B ==> ' FLD0279B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0279B.
           IF FLD0280B (1:)    NOT EQUAL XPC-FLD0280B
              DISPLAY 'FLD0280B ==> ' FLD0280B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0280B.
           IF FLD0281B (1:)    NOT EQUAL XPC-FLD0281B
              DISPLAY 'FLD0281B ==> ' FLD0281B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0281B.
           IF FLD0282B (1:)    NOT EQUAL XPC-FLD0282B
              DISPLAY 'FLD0282B ==> ' FLD0282B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0282B.
           IF FLD0283B (1:)    NOT EQUAL XPC-FLD0283B
              DISPLAY 'FLD0283B ==> ' FLD0283B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0283B.
           IF FLD0284B (1:)    NOT EQUAL XPC-FLD0284B
              DISPLAY 'FLD0284B ==> ' FLD0284B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0284B.
           IF FLD0285B (1:)    NOT EQUAL XPC-FLD0285B
              DISPLAY 'FLD0285B ==> ' FLD0285B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0285B.
           IF FLD0286B (1:)    NOT EQUAL XPC-FLD0286B
              DISPLAY 'FLD0286B ==> ' FLD0286B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0286B.
           IF FLD0287B (1:)    NOT EQUAL XPC-FLD0287B
              DISPLAY 'FLD0287B ==> ' FLD0287B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0287B.
           IF FLD0288B (1:)    NOT EQUAL XPC-FLD0288B
              DISPLAY 'FLD0288B ==> ' FLD0288B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0288B.
           IF FLD0289B (1:)    NOT EQUAL XPC-FLD0289B
              DISPLAY 'FLD0289B ==> ' FLD0289B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0289B.
           IF FLD0290B (1:)    NOT EQUAL XPC-FLD0290B
              DISPLAY 'FLD0290B ==> ' FLD0290B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0290B.
           IF FLD0291B (1:)    NOT EQUAL XPC-FLD0291B
              DISPLAY 'FLD0291B ==> ' FLD0291B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0291B.
           IF FLD0292B (1:)    NOT EQUAL XPC-FLD0292B
              DISPLAY 'FLD0292B ==> ' FLD0292B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0292B.
           IF FLD0293B (1:)    NOT EQUAL XPC-FLD0293B
              DISPLAY 'FLD0293B ==> ' FLD0293B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0293B.
           IF FLD0294B (1:)    NOT EQUAL XPC-FLD0294B
              DISPLAY 'FLD0294B ==> ' FLD0294B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0294B.
           IF FLD0295B (1:)    NOT EQUAL XPC-FLD0295B
              DISPLAY 'FLD0295B ==> ' FLD0295B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0295B.
           IF FLD0296B (1:)    NOT EQUAL XPC-FLD0296B
              DISPLAY 'FLD0296B ==> ' FLD0296B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0296B.
           IF FLD0297B (1:)    NOT EQUAL XPC-FLD0297B
              DISPLAY 'FLD0297B ==> ' FLD0297B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0297B.
           IF FLD0298B (1:)    NOT EQUAL XPC-FLD0298B
              DISPLAY 'FLD0298B ==> ' FLD0298B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0298B.
           IF FLD0299B (1:)    NOT EQUAL XPC-FLD0299B
              DISPLAY 'FLD0299B ==> ' FLD0299B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0299B.
           IF FLD0300B (1:)    NOT EQUAL XPC-FLD0300B
              DISPLAY 'FLD0300B ==> ' FLD0300B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0300B.
           IF FLD0301B (1:)    NOT EQUAL XPC-FLD0301B
              DISPLAY 'FLD0301B ==> ' FLD0301B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0301B.
           IF FLD0302B (1:)    NOT EQUAL XPC-FLD0302B
              DISPLAY 'FLD0302B ==> ' FLD0302B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0302B.
           IF FLD0303B (1:)    NOT EQUAL XPC-FLD0303B
              DISPLAY 'FLD0303B ==> ' FLD0303B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0303B.
           IF FLD0304B (1:)    NOT EQUAL XPC-FLD0304B
              DISPLAY 'FLD0304B ==> ' FLD0304B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0304B.
           IF FLD0305B (1:)    NOT EQUAL XPC-FLD0305B
              DISPLAY 'FLD0305B ==> ' FLD0305B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0305B.
           IF FLD0306B (1:)    NOT EQUAL XPC-FLD0306B
              DISPLAY 'FLD0306B ==> ' FLD0306B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0306B.
           IF FLD0307B (1:)    NOT EQUAL XPC-FLD0307B
              DISPLAY 'FLD0307B ==> ' FLD0307B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0307B.
           IF FLD0308B (1:)    NOT EQUAL XPC-FLD0308B
              DISPLAY 'FLD0308B ==> ' FLD0308B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0308B.
           IF FLD0309B (1:)    NOT EQUAL XPC-FLD0309B
              DISPLAY 'FLD0309B ==> ' FLD0309B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0309B.
           IF FLD0310B (1:)    NOT EQUAL XPC-FLD0310B
              DISPLAY 'FLD0310B ==> ' FLD0310B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0310B.
           IF FLD0311B (1:)    NOT EQUAL XPC-FLD0311B
              DISPLAY 'FLD0311B ==> ' FLD0311B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0311B.
           IF FLD0312B (1:)    NOT EQUAL XPC-FLD0312B
              DISPLAY 'FLD0312B ==> ' FLD0312B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0312B.
           IF FLD0313B (1:)    NOT EQUAL XPC-FLD0313B
              DISPLAY 'FLD0313B ==> ' FLD0313B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0313B.
           IF FLD0314B (1:)    NOT EQUAL XPC-FLD0314B
              DISPLAY 'FLD0314B ==> ' FLD0314B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0314B.
           IF FLD0315B (1:)    NOT EQUAL XPC-FLD0315B
              DISPLAY 'FLD0315B ==> ' FLD0315B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0315B.
           IF FLD0316B (1:)    NOT EQUAL XPC-FLD0316B
              DISPLAY 'FLD0316B ==> ' FLD0316B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0316B.
           IF FLD0317B (1:)    NOT EQUAL XPC-FLD0317B
              DISPLAY 'FLD0317B ==> ' FLD0317B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0317B.
           IF FLD0318B (1:)    NOT EQUAL XPC-FLD0318B
              DISPLAY 'FLD0318B ==> ' FLD0318B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0318B.
           IF FLD0319B (1:)    NOT EQUAL XPC-FLD0319B
              DISPLAY 'FLD0319B ==> ' FLD0319B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0319B.
           IF FLD0320B (1:)    NOT EQUAL XPC-FLD0320B
              DISPLAY 'FLD0320B ==> ' FLD0320B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0320B.
           IF FLD0321B (1:)    NOT EQUAL XPC-FLD0321B
              DISPLAY 'FLD0321B ==> ' FLD0321B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0321B.
           IF FLD0322B (1:)    NOT EQUAL XPC-FLD0322B
              DISPLAY 'FLD0322B ==> ' FLD0322B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0322B.
           IF FLD0323B (1:)    NOT EQUAL XPC-FLD0323B
              DISPLAY 'FLD0323B ==> ' FLD0323B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0323B.
           IF FLD0324B (1:)    NOT EQUAL XPC-FLD0324B
              DISPLAY 'FLD0324B ==> ' FLD0324B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0324B.
           IF FLD0325B (1:)    NOT EQUAL XPC-FLD0325B
              DISPLAY 'FLD0325B ==> ' FLD0325B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0325B.
           IF FLD0326B (1:)    NOT EQUAL XPC-FLD0326B
              DISPLAY 'FLD0326B ==> ' FLD0326B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0326B.
           IF FLD0327B (1:)    NOT EQUAL XPC-FLD0327B
              DISPLAY 'FLD0327B ==> ' FLD0327B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0327B.
           IF FLD0328B (1:)    NOT EQUAL XPC-FLD0328B
              DISPLAY 'FLD0328B ==> ' FLD0328B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0328B.
           IF FLD0329B (1:)    NOT EQUAL XPC-FLD0329B
              DISPLAY 'FLD0329B ==> ' FLD0329B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0329B.
           IF FLD0330B (1:)    NOT EQUAL XPC-FLD0330B
              DISPLAY 'FLD0330B ==> ' FLD0330B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0330B.
           IF FLD0331B (1:)    NOT EQUAL XPC-FLD0331B
              DISPLAY 'FLD0331B ==> ' FLD0331B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0331B.
           IF FLD0332B (1:)    NOT EQUAL XPC-FLD0332B
              DISPLAY 'FLD0332B ==> ' FLD0332B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0332B.
           IF FLD0333B (1:)    NOT EQUAL XPC-FLD0333B
              DISPLAY 'FLD0333B ==> ' FLD0333B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0333B.
           IF FLD0334B (1:)    NOT EQUAL XPC-FLD0334B
              DISPLAY 'FLD0334B ==> ' FLD0334B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0334B.
           IF FLD0335B (1:)    NOT EQUAL XPC-FLD0335B
              DISPLAY 'FLD0335B ==> ' FLD0335B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0335B.
           IF FLD0336B (1:)    NOT EQUAL XPC-FLD0336B
              DISPLAY 'FLD0336B ==> ' FLD0336B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0336B.
           IF FLD0337B (1:)    NOT EQUAL XPC-FLD0337B
              DISPLAY 'FLD0337B ==> ' FLD0337B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0337B.
           IF FLD0338B (1:)    NOT EQUAL XPC-FLD0338B
              DISPLAY 'FLD0338B ==> ' FLD0338B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0338B.
           IF FLD0339B (1:)    NOT EQUAL XPC-FLD0339B
              DISPLAY 'FLD0339B ==> ' FLD0339B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0339B.
           IF FLD0340B (1:)    NOT EQUAL XPC-FLD0340B
              DISPLAY 'FLD0340B ==> ' FLD0340B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0340B.
           IF FLD0341B (1:)    NOT EQUAL XPC-FLD0341B
              DISPLAY 'FLD0341B ==> ' FLD0341B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0341B.
           IF FLD0342B (1:)    NOT EQUAL XPC-FLD0342B
              DISPLAY 'FLD0342B ==> ' FLD0342B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0342B.
           IF FLD0343B (1:)    NOT EQUAL XPC-FLD0343B
              DISPLAY 'FLD0343B ==> ' FLD0343B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0343B.
           IF FLD0344B (1:)    NOT EQUAL XPC-FLD0344B
              DISPLAY 'FLD0344B ==> ' FLD0344B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0344B.
           IF FLD0345B (1:)    NOT EQUAL XPC-FLD0345B
              DISPLAY 'FLD0345B ==> ' FLD0345B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0345B.
           IF FLD0346B (1:)    NOT EQUAL XPC-FLD0346B
              DISPLAY 'FLD0346B ==> ' FLD0346B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0346B.
           IF FLD0347B (1:)    NOT EQUAL XPC-FLD0347B
              DISPLAY 'FLD0347B ==> ' FLD0347B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0347B.
           IF FLD0348B (1:)    NOT EQUAL XPC-FLD0348B
              DISPLAY 'FLD0348B ==> ' FLD0348B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0348B.
           IF FLD0349B (1:)    NOT EQUAL XPC-FLD0349B
              DISPLAY 'FLD0349B ==> ' FLD0349B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0349B.
           IF FLD0350B (1:)    NOT EQUAL XPC-FLD0350B
              DISPLAY 'FLD0350B ==> ' FLD0350B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0350B.
           IF FLD0351B (1:)    NOT EQUAL XPC-FLD0351B
              DISPLAY 'FLD0351B ==> ' FLD0351B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0351B.
           IF FLD0352B (1:)    NOT EQUAL XPC-FLD0352B
              DISPLAY 'FLD0352B ==> ' FLD0352B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0352B.
           IF FLD0353B (1:)    NOT EQUAL XPC-FLD0353B
              DISPLAY 'FLD0353B ==> ' FLD0353B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0353B.
           IF FLD0354B (1:)    NOT EQUAL XPC-FLD0354B
              DISPLAY 'FLD0354B ==> ' FLD0354B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0354B.
           IF FLD0355B (1:)    NOT EQUAL XPC-FLD0355B
              DISPLAY 'FLD0355B ==> ' FLD0355B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0355B.
           IF FLD0356B (1:)    NOT EQUAL XPC-FLD0356B
              DISPLAY 'FLD0356B ==> ' FLD0356B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0356B.
           IF FLD0357B (1:)    NOT EQUAL XPC-FLD0357B
              DISPLAY 'FLD0357B ==> ' FLD0357B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0357B.
           IF FLD0358B (1:)    NOT EQUAL XPC-FLD0358B
              DISPLAY 'FLD0358B ==> ' FLD0358B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0358B.
           IF FLD0359B (1:)    NOT EQUAL XPC-FLD0359B
              DISPLAY 'FLD0359B ==> ' FLD0359B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0359B.
           IF FLD0360B (1:)    NOT EQUAL XPC-FLD0360B
              DISPLAY 'FLD0360B ==> ' FLD0360B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0360B.
           IF FLD0361B (1:)    NOT EQUAL XPC-FLD0361B
              DISPLAY 'FLD0361B ==> ' FLD0361B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0361B.
           IF FLD0362B (1:)    NOT EQUAL XPC-FLD0362B
              DISPLAY 'FLD0362B ==> ' FLD0362B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0362B.
           IF FLD0363B (1:)    NOT EQUAL XPC-FLD0363B
              DISPLAY 'FLD0363B ==> ' FLD0363B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0363B.
           IF FLD0364B (1:)    NOT EQUAL XPC-FLD0364B
              DISPLAY 'FLD0364B ==> ' FLD0364B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0364B.
           IF FLD0365B (1:)    NOT EQUAL XPC-FLD0365B
              DISPLAY 'FLD0365B ==> ' FLD0365B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0365B.
           IF FLD0366B (1:)    NOT EQUAL XPC-FLD0366B
              DISPLAY 'FLD0366B ==> ' FLD0366B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0366B.
           IF FLD0367B (1:)    NOT EQUAL XPC-FLD0367B
              DISPLAY 'FLD0367B ==> ' FLD0367B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0367B.
           IF FLD0368B (1:)    NOT EQUAL XPC-FLD0368B
              DISPLAY 'FLD0368B ==> ' FLD0368B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0368B.
           IF FLD0369B (1:)    NOT EQUAL XPC-FLD0369B
              DISPLAY 'FLD0369B ==> ' FLD0369B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0369B.
           IF FLD0370B (1:)    NOT EQUAL XPC-FLD0370B
              DISPLAY 'FLD0370B ==> ' FLD0370B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0370B.
           IF FLD0371B (1:)    NOT EQUAL XPC-FLD0371B
              DISPLAY 'FLD0371B ==> ' FLD0371B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0371B.
           IF FLD0372B (1:)    NOT EQUAL XPC-FLD0372B
              DISPLAY 'FLD0372B ==> ' FLD0372B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0372B.
           IF FLD0373B (1:)    NOT EQUAL XPC-FLD0373B
              DISPLAY 'FLD0373B ==> ' FLD0373B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0373B.
           IF FLD0374B (1:)    NOT EQUAL XPC-FLD0374B
              DISPLAY 'FLD0374B ==> ' FLD0374B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0374B.
           IF FLD0375B (1:)    NOT EQUAL XPC-FLD0375B
              DISPLAY 'FLD0375B ==> ' FLD0375B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0375B.
           IF FLD0376B (1:)    NOT EQUAL XPC-FLD0376B
              DISPLAY 'FLD0376B ==> ' FLD0376B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0376B.
           IF FLD0377B (1:)    NOT EQUAL XPC-FLD0377B
              DISPLAY 'FLD0377B ==> ' FLD0377B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0377B.
           IF FLD0378B (1:)    NOT EQUAL XPC-FLD0378B
              DISPLAY 'FLD0378B ==> ' FLD0378B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0378B.
           IF FLD0379B (1:)    NOT EQUAL XPC-FLD0379B
              DISPLAY 'FLD0379B ==> ' FLD0379B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0379B.
           IF FLD0380B (1:)    NOT EQUAL XPC-FLD0380B
              DISPLAY 'FLD0380B ==> ' FLD0380B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0380B.
           IF FLD0381B (1:)    NOT EQUAL XPC-FLD0381B
              DISPLAY 'FLD0381B ==> ' FLD0381B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0381B.
           IF FLD0382B (1:)    NOT EQUAL XPC-FLD0382B
              DISPLAY 'FLD0382B ==> ' FLD0382B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0382B.
           IF FLD0383B (1:)    NOT EQUAL XPC-FLD0383B
              DISPLAY 'FLD0383B ==> ' FLD0383B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0383B.
           IF FLD0384B (1:)    NOT EQUAL XPC-FLD0384B
              DISPLAY 'FLD0384B ==> ' FLD0384B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0384B.
           IF FLD0385B (1:)    NOT EQUAL XPC-FLD0385B
              DISPLAY 'FLD0385B ==> ' FLD0385B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0385B.
           IF FLD0386B (1:)    NOT EQUAL XPC-FLD0386B
              DISPLAY 'FLD0386B ==> ' FLD0386B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0386B.
           IF FLD0387B (1:)    NOT EQUAL XPC-FLD0387B
              DISPLAY 'FLD0387B ==> ' FLD0387B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0387B.
           IF FLD0388B (1:)    NOT EQUAL XPC-FLD0388B
              DISPLAY 'FLD0388B ==> ' FLD0388B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0388B.
           IF FLD0389B (1:)    NOT EQUAL XPC-FLD0389B
              DISPLAY 'FLD0389B ==> ' FLD0389B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0389B.
           IF FLD0390B (1:)    NOT EQUAL XPC-FLD0390B
              DISPLAY 'FLD0390B ==> ' FLD0390B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0390B.
           IF FLD0391B (1:)    NOT EQUAL XPC-FLD0391B
              DISPLAY 'FLD0391B ==> ' FLD0391B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0391B.
           IF FLD0392B (1:)    NOT EQUAL XPC-FLD0392B
              DISPLAY 'FLD0392B ==> ' FLD0392B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0392B.
           IF FLD0393B (1:)    NOT EQUAL XPC-FLD0393B
              DISPLAY 'FLD0393B ==> ' FLD0393B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0393B.
           IF FLD0394B (1:)    NOT EQUAL XPC-FLD0394B
              DISPLAY 'FLD0394B ==> ' FLD0394B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0394B.
           IF FLD0395B (1:)    NOT EQUAL XPC-FLD0395B
              DISPLAY 'FLD0395B ==> ' FLD0395B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0395B.
           IF FLD0396B (1:)    NOT EQUAL XPC-FLD0396B
              DISPLAY 'FLD0396B ==> ' FLD0396B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0396B.
           IF FLD0397B (1:)    NOT EQUAL XPC-FLD0397B
              DISPLAY 'FLD0397B ==> ' FLD0397B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0397B.
           IF FLD0398B (1:)    NOT EQUAL XPC-FLD0398B
              DISPLAY 'FLD0398B ==> ' FLD0398B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0398B.
           IF FLD0399B (1:)    NOT EQUAL XPC-FLD0399B
              DISPLAY 'FLD0399B ==> ' FLD0399B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0399B.
           IF FLD0400B (1:)    NOT EQUAL XPC-FLD0400B
              DISPLAY 'FLD0400B ==> ' FLD0400B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0400B.
           IF FLD0401B (1:)    NOT EQUAL XPC-FLD0401B
              DISPLAY 'FLD0401B ==> ' FLD0401B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0401B.
           IF FLD0402B (1:)    NOT EQUAL XPC-FLD0402B
              DISPLAY 'FLD0402B ==> ' FLD0402B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0402B.
           IF FLD0403B (1:)    NOT EQUAL XPC-FLD0403B
              DISPLAY 'FLD0403B ==> ' FLD0403B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0403B.
           IF FLD0404B (1:)    NOT EQUAL XPC-FLD0404B
              DISPLAY 'FLD0404B ==> ' FLD0404B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0404B.
           IF FLD0405B (1:)    NOT EQUAL XPC-FLD0405B
              DISPLAY 'FLD0405B ==> ' FLD0405B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0405B.
           IF FLD0406B (1:)    NOT EQUAL XPC-FLD0406B
              DISPLAY 'FLD0406B ==> ' FLD0406B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0406B.
           IF FLD0407B (1:)    NOT EQUAL XPC-FLD0407B
              DISPLAY 'FLD0407B ==> ' FLD0407B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0407B.
           IF FLD0408B (1:)    NOT EQUAL XPC-FLD0408B
              DISPLAY 'FLD0408B ==> ' FLD0408B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0408B.
           IF FLD0409B (1:)    NOT EQUAL XPC-FLD0409B
              DISPLAY 'FLD0409B ==> ' FLD0409B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0409B.
           IF FLD0410B (1:)    NOT EQUAL XPC-FLD0410B
              DISPLAY 'FLD0410B ==> ' FLD0410B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0410B.
           IF FLD0411B (1:)    NOT EQUAL XPC-FLD0411B
              DISPLAY 'FLD0411B ==> ' FLD0411B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0411B.
           IF FLD0412B (1:)    NOT EQUAL XPC-FLD0412B
              DISPLAY 'FLD0412B ==> ' FLD0412B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0412B.
           IF FLD0413B (1:)    NOT EQUAL XPC-FLD0413B
              DISPLAY 'FLD0413B ==> ' FLD0413B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0413B.
           IF FLD0414B (1:)    NOT EQUAL XPC-FLD0414B
              DISPLAY 'FLD0414B ==> ' FLD0414B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0414B.
           IF FLD0415B (1:)    NOT EQUAL XPC-FLD0415B
              DISPLAY 'FLD0415B ==> ' FLD0415B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0415B.
           IF FLD0416B (1:)    NOT EQUAL XPC-FLD0416B
              DISPLAY 'FLD0416B ==> ' FLD0416B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0416B.
           IF FLD0417B (1:)    NOT EQUAL XPC-FLD0417B
              DISPLAY 'FLD0417B ==> ' FLD0417B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0417B.
           IF FLD0418B (1:)    NOT EQUAL XPC-FLD0418B
              DISPLAY 'FLD0418B ==> ' FLD0418B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0418B.
           IF FLD0419B (1:)    NOT EQUAL XPC-FLD0419B
              DISPLAY 'FLD0419B ==> ' FLD0419B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0419B.
           IF FLD0420B (1:)    NOT EQUAL XPC-FLD0420B
              DISPLAY 'FLD0420B ==> ' FLD0420B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0420B.
           IF FLD0421B (1:)    NOT EQUAL XPC-FLD0421B
              DISPLAY 'FLD0421B ==> ' FLD0421B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0421B.
           IF FLD0422B (1:)    NOT EQUAL XPC-FLD0422B
              DISPLAY 'FLD0422B ==> ' FLD0422B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0422B.
           IF FLD0423B (1:)    NOT EQUAL XPC-FLD0423B
              DISPLAY 'FLD0423B ==> ' FLD0423B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0423B.
           IF FLD0424B (1:)    NOT EQUAL XPC-FLD0424B
              DISPLAY 'FLD0424B ==> ' FLD0424B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0424B.
           IF FLD0425B (1:)    NOT EQUAL XPC-FLD0425B
              DISPLAY 'FLD0425B ==> ' FLD0425B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0425B.
           IF FLD0426B (1:)    NOT EQUAL XPC-FLD0426B
              DISPLAY 'FLD0426B ==> ' FLD0426B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0426B.
           IF FLD0427B (1:)    NOT EQUAL XPC-FLD0427B
              DISPLAY 'FLD0427B ==> ' FLD0427B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0427B.
           IF FLD0428B (1:)    NOT EQUAL XPC-FLD0428B
              DISPLAY 'FLD0428B ==> ' FLD0428B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0428B.
           IF FLD0429B (1:)    NOT EQUAL XPC-FLD0429B
              DISPLAY 'FLD0429B ==> ' FLD0429B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0429B.
           IF FLD0430B (1:)    NOT EQUAL XPC-FLD0430B
              DISPLAY 'FLD0430B ==> ' FLD0430B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0430B.
           IF FLD0431B (1:)    NOT EQUAL XPC-FLD0431B
              DISPLAY 'FLD0431B ==> ' FLD0431B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0431B.
           IF FLD0432B (1:)    NOT EQUAL XPC-FLD0432B
              DISPLAY 'FLD0432B ==> ' FLD0432B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0432B.
           IF FLD0433B (1:)    NOT EQUAL XPC-FLD0433B
              DISPLAY 'FLD0433B ==> ' FLD0433B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0433B.
           IF FLD0434B (1:)    NOT EQUAL XPC-FLD0434B
              DISPLAY 'FLD0434B ==> ' FLD0434B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0434B.
           IF FLD0435B (1:)    NOT EQUAL XPC-FLD0435B
              DISPLAY 'FLD0435B ==> ' FLD0435B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0435B.
           IF FLD0436B (1:)    NOT EQUAL XPC-FLD0436B
              DISPLAY 'FLD0436B ==> ' FLD0436B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0436B.
           IF FLD0437B (1:)    NOT EQUAL XPC-FLD0437B
              DISPLAY 'FLD0437B ==> ' FLD0437B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0437B.
           IF FLD0438B (1:)    NOT EQUAL XPC-FLD0438B
              DISPLAY 'FLD0438B ==> ' FLD0438B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0438B.
           IF FLD0439B (1:)    NOT EQUAL XPC-FLD0439B
              DISPLAY 'FLD0439B ==> ' FLD0439B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0439B.
           IF FLD0440B (1:)    NOT EQUAL XPC-FLD0440B
              DISPLAY 'FLD0440B ==> ' FLD0440B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0440B.
           IF FLD0441B (1:)    NOT EQUAL XPC-FLD0441B
              DISPLAY 'FLD0441B ==> ' FLD0441B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0441B.
           IF FLD0442B (1:)    NOT EQUAL XPC-FLD0442B
              DISPLAY 'FLD0442B ==> ' FLD0442B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0442B.
           IF FLD0443B (1:)    NOT EQUAL XPC-FLD0443B
              DISPLAY 'FLD0443B ==> ' FLD0443B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0443B.
           IF FLD0444B (1:)    NOT EQUAL XPC-FLD0444B
              DISPLAY 'FLD0444B ==> ' FLD0444B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0444B.
           IF FLD0445B (1:)    NOT EQUAL XPC-FLD0445B
              DISPLAY 'FLD0445B ==> ' FLD0445B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0445B.
           IF FLD0446B (1:)    NOT EQUAL XPC-FLD0446B
              DISPLAY 'FLD0446B ==> ' FLD0446B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0446B.
           IF FLD0447B (1:)    NOT EQUAL XPC-FLD0447B
              DISPLAY 'FLD0447B ==> ' FLD0447B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0447B.
           IF FLD0448B (1:)    NOT EQUAL XPC-FLD0448B
              DISPLAY 'FLD0448B ==> ' FLD0448B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0448B.
           IF FLD0449B (1:)    NOT EQUAL XPC-FLD0449B
              DISPLAY 'FLD0449B ==> ' FLD0449B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0449B.
           IF FLD0450B (1:)    NOT EQUAL XPC-FLD0450B
              DISPLAY 'FLD0450B ==> ' FLD0450B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0450B.
           IF FLD0451B (1:)    NOT EQUAL XPC-FLD0451B
              DISPLAY 'FLD0451B ==> ' FLD0451B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0451B.
           IF FLD0452B (1:)    NOT EQUAL XPC-FLD0452B
              DISPLAY 'FLD0452B ==> ' FLD0452B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0452B.
           IF FLD0453B (1:)    NOT EQUAL XPC-FLD0453B
              DISPLAY 'FLD0453B ==> ' FLD0453B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0453B.
           IF FLD0454B (1:)    NOT EQUAL XPC-FLD0454B
              DISPLAY 'FLD0454B ==> ' FLD0454B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0454B.
           IF FLD0455B (1:)    NOT EQUAL XPC-FLD0455B
              DISPLAY 'FLD0455B ==> ' FLD0455B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0455B.
           IF FLD0456B (1:)    NOT EQUAL XPC-FLD0456B
              DISPLAY 'FLD0456B ==> ' FLD0456B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0456B.
           IF FLD0457B (1:)    NOT EQUAL XPC-FLD0457B
              DISPLAY 'FLD0457B ==> ' FLD0457B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0457B.
           IF FLD0458B (1:)    NOT EQUAL XPC-FLD0458B
              DISPLAY 'FLD0458B ==> ' FLD0458B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0458B.
           IF FLD0459B (1:)    NOT EQUAL XPC-FLD0459B
              DISPLAY 'FLD0459B ==> ' FLD0459B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0459B.
           IF FLD0460B (1:)    NOT EQUAL XPC-FLD0460B
              DISPLAY 'FLD0460B ==> ' FLD0460B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0460B.
           IF FLD0461B (1:)    NOT EQUAL XPC-FLD0461B
              DISPLAY 'FLD0461B ==> ' FLD0461B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0461B.
           IF FLD0462B (1:)    NOT EQUAL XPC-FLD0462B
              DISPLAY 'FLD0462B ==> ' FLD0462B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0462B.
           IF FLD0463B (1:)    NOT EQUAL XPC-FLD0463B
              DISPLAY 'FLD0463B ==> ' FLD0463B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0463B.
           IF FLD0464B (1:)    NOT EQUAL XPC-FLD0464B
              DISPLAY 'FLD0464B ==> ' FLD0464B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0464B.
           IF FLD0465B (1:)    NOT EQUAL XPC-FLD0465B
              DISPLAY 'FLD0465B ==> ' FLD0465B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0465B.
           IF FLD0466B (1:)    NOT EQUAL XPC-FLD0466B
              DISPLAY 'FLD0466B ==> ' FLD0466B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0466B.
           IF FLD0467B (1:)    NOT EQUAL XPC-FLD0467B
              DISPLAY 'FLD0467B ==> ' FLD0467B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0467B.
           IF FLD0468B (1:)    NOT EQUAL XPC-FLD0468B
              DISPLAY 'FLD0468B ==> ' FLD0468B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0468B.
           IF FLD0469B (1:)    NOT EQUAL XPC-FLD0469B
              DISPLAY 'FLD0469B ==> ' FLD0469B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0469B.
           IF FLD0470B (1:)    NOT EQUAL XPC-FLD0470B
              DISPLAY 'FLD0470B ==> ' FLD0470B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0470B.
           IF FLD0471B (1:)    NOT EQUAL XPC-FLD0471B
              DISPLAY 'FLD0471B ==> ' FLD0471B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0471B.
           IF FLD0472B (1:)    NOT EQUAL XPC-FLD0472B
              DISPLAY 'FLD0472B ==> ' FLD0472B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0472B.
           IF FLD0473B (1:)    NOT EQUAL XPC-FLD0473B
              DISPLAY 'FLD0473B ==> ' FLD0473B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0473B.
           IF FLD0474B (1:)    NOT EQUAL XPC-FLD0474B
              DISPLAY 'FLD0474B ==> ' FLD0474B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0474B.
           IF FLD0475B (1:)    NOT EQUAL XPC-FLD0475B
              DISPLAY 'FLD0475B ==> ' FLD0475B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0475B.
           IF FLD0476B (1:)    NOT EQUAL XPC-FLD0476B
              DISPLAY 'FLD0476B ==> ' FLD0476B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0476B.
           IF FLD0477B (1:)    NOT EQUAL XPC-FLD0477B
              DISPLAY 'FLD0477B ==> ' FLD0477B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0477B.
           IF FLD0478B (1:)    NOT EQUAL XPC-FLD0478B
              DISPLAY 'FLD0478B ==> ' FLD0478B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0478B.
           IF FLD0479B (1:)    NOT EQUAL XPC-FLD0479B
              DISPLAY 'FLD0479B ==> ' FLD0479B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0479B.
           IF FLD0480B (1:)    NOT EQUAL XPC-FLD0480B
              DISPLAY 'FLD0480B ==> ' FLD0480B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0480B.
           IF FLD0481B (1:)    NOT EQUAL XPC-FLD0481B
              DISPLAY 'FLD0481B ==> ' FLD0481B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0481B.
           IF FLD0482B (1:)    NOT EQUAL XPC-FLD0482B
              DISPLAY 'FLD0482B ==> ' FLD0482B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0482B.
           IF FLD0483B (1:)    NOT EQUAL XPC-FLD0483B
              DISPLAY 'FLD0483B ==> ' FLD0483B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0483B.
           IF FLD0484B (1:)    NOT EQUAL XPC-FLD0484B
              DISPLAY 'FLD0484B ==> ' FLD0484B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0484B.
           IF FLD0485B (1:)    NOT EQUAL XPC-FLD0485B
              DISPLAY 'FLD0485B ==> ' FLD0485B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0485B.
           IF FLD0486B (1:)    NOT EQUAL XPC-FLD0486B
              DISPLAY 'FLD0486B ==> ' FLD0486B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0486B.
           IF FLD0487B (1:)    NOT EQUAL XPC-FLD0487B
              DISPLAY 'FLD0487B ==> ' FLD0487B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0487B.
           IF FLD0488B (1:)    NOT EQUAL XPC-FLD0488B
              DISPLAY 'FLD0488B ==> ' FLD0488B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0488B.
           IF FLD0489B (1:)    NOT EQUAL XPC-FLD0489B
              DISPLAY 'FLD0489B ==> ' FLD0489B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0489B.
           IF FLD0490B (1:)    NOT EQUAL XPC-FLD0490B
              DISPLAY 'FLD0490B ==> ' FLD0490B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0490B.
           IF FLD0491B (1:)    NOT EQUAL XPC-FLD0491B
              DISPLAY 'FLD0491B ==> ' FLD0491B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0491B.
           IF FLD0492B (1:)    NOT EQUAL XPC-FLD0492B
              DISPLAY 'FLD0492B ==> ' FLD0492B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0492B.
           IF FLD0493B (1:)    NOT EQUAL XPC-FLD0493B
              DISPLAY 'FLD0493B ==> ' FLD0493B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0493B.
           IF FLD0494B (1:)    NOT EQUAL XPC-FLD0494B
              DISPLAY 'FLD0494B ==> ' FLD0494B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0494B.
           IF FLD0495B (1:)    NOT EQUAL XPC-FLD0495B
              DISPLAY 'FLD0495B ==> ' FLD0495B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0495B.
           IF FLD0496B (1:)    NOT EQUAL XPC-FLD0496B
              DISPLAY 'FLD0496B ==> ' FLD0496B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0496B.
           IF FLD0497B (1:)    NOT EQUAL XPC-FLD0497B
              DISPLAY 'FLD0497B ==> ' FLD0497B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0497B.
           IF FLD0498B (1:)    NOT EQUAL XPC-FLD0498B
              DISPLAY 'FLD0498B ==> ' FLD0498B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0498B.
           IF FLD0499B (1:)    NOT EQUAL XPC-FLD0499B
              DISPLAY 'FLD0499B ==> ' FLD0499B
              DISPLAY 'EXPECTED ==> ' XPC-FLD0499B.
