       IDENTIFICATION   DIVISION.
       PROGRAM-ID. prog.
       DATA             DIVISION.
       WORKING-STORAGE  SECTION.
       01 X             PIC X.
       SCREEN  SECTION.
        01 SG.
           05 SI1    LINE 1 COL 1 PIC X FROM X.
           05 SI2    LINE 2 COL 1 PIC X FROM SPACE.
           05 SI2-2  LINE 2 COL 5 PIC X(03) FROM ALL SPACES.
           05 BAD1   LINE 4 COL 1 PIC 9 BINARY FROM ZERO.
           05 BAD2   LINE 4 COL 1 PIC 9 USAGE BINARY FROM ZERO.
           05 FILLER LINE 4 COL 8 PIC 9 COMP-5 FROM ZERO.
           05 BAD3   LINE 4 COL 5 COMP-2 FROM ALL ZEROES.
       PROCEDURE        DIVISION.
           DISPLAY SG END-DISPLAY.
           STOP RUN.
