       IDENTIFICATION   DIVISION.
       PROGRAM-ID.      prog2.
       DATA             DIVISION.
       SCREEN           SECTION.
       01 x-scr.
          03 x PIC X VALUE "a" OCCURS 10 COL  10.
       01 y-scr.
          03 y PIC X VALUE "a" OCCURS 10 LINE 10.
