       IDENTIFICATION   DIVISION.
       PROGRAM-ID.      prog.
       PROCEDURE        DIVISION.
           DISPLAY B#101 UPON STDOUT
           DISPLAY O#17777777777 UPON STDOUT
           DISPLAY X#ffFFFFff UPON STDOUT
           DISPLAY H#ffFFFFff UPON STDOUT

           STOP RUN.
