       IDENTIFICATION   DIVISION.
       PROGRAM-ID.      "A@%:@B".
       PROCEDURE        DIVISION.
           DISPLAY "P2" NO ADVANCING
           END-DISPLAY.
           EXIT PROGRAM.
