       IDENTIFICATION   DIVISION.
       PROGRAM-ID.      caller.
       DATA             DIVISION.
       WORKING-STORAGE  SECTION.
       77 CALL-NAME     PIC X(10).
       01.
         03 SOME-FILL   PIC X(33).
         03 ADR-PTR     USAGE POINTER.
         03 ADR-BUFFER  REDEFINES ADR-PTR  USAGE COMP-5 PIC S9(8).
       77 BIG-BUFF      USAGE COMP-5 PIC S9(18) VALUE 99999999999999.
       PROCEDURE        DIVISION  CHAINING CALL-NAME.

      >> IF P64 DEFINED
           MOVE "callee64" TO CALL-NAME
      >> ELSE
           MOVE "callee32" TO CALL-NAME
      >> END-IF

           MOVE 12345678 TO ADR-BUFFER
           CALL CALL-NAME USING BY VALUE ADR-PTR

           CALL CALL-NAME USING BY VALUE ADR-BUFFER

           CALL CALL-NAME USING BY VALUE LENGTH OF SOME-FILL

           MOVE -42 TO ADR-BUFFER
      >> IF P64 DEFINED
           CALL "callee32" USING BY VALUE SIZE 4 ADR-BUFFER
           CALL "callee64" USING BY VALUE BIG-BUFF
      >> ELSE
           CALL "callee32" USING BY VALUE ADR-BUFFER
           CALL "callee64" USING BY VALUE SIZE 8 BIG-BUFF
      >> END-IF

           GOBACK.
