      $SET SOURCEFORMAT"FREE"
IDENTIFICATION DIVISION.
PROGRAM-ID. prog.
DATA DIVISION.
WORKING-STORAGE SECTION.
1 X PIC 99.
PROCEDURE DIVISION.
MAIN.
COMPUTE X = 6
* 7
DISPLAY X NO ADVANCING
STOP RUN.
