IDENTIFICATION   DIVISION.
PROGRAM-ID.      marginberr.
AUTHOR.
* Comment paragraph where margin B depends on indicator width:
    Somebody
\D   Somebody else.
DATA             DIVISION.
WORKING-STORAGE  SECTION.
PROCEDURE        DIVISION.
      DISPLAY "OK" NO ADVANCING
      STOP RUN.
