000010 IDENTIFICATION DIVISION.
000020 PROGRAM-ID. fit.
000040 PROCEDURE DIVISION.
000050                                                                                                                                                                                                                                    DISPLAY "Hello!"
000060     STOP RUN.
