* Sample program in X/Open format, and with longer lines and truncated literals.

IDENTIFICATION   DIVISION.
PROGRAM-ID.      fit.
DATA             DIVISION.
WORKING-STORAGE  SECTION.
PROCEDURE        DIVISION.
DISPLAY '         20        30        40        50        60        70       79'
D DISPLAY '       20        30        40        50        60        70       79'
STOP RUN.
