       IDENTIFICATION DIVISION.
       PROGRAM-ID. prog.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT REPORT-FILE
           LINE SEQUENTIAL 
           ASSIGN TO EXTERNAL DUPDTL.
       DATA DIVISION.
       FILE SECTION.
       FD REPORT-FILE
           REPORT IS MYREPORT.
       WORKING-STORAGE SECTION.
       01 SAVE-ITEM PIC  X.
       
       REPORT SECTION.
       RD MYREPORT
           CONTROLS ARE SAVE-ITEM
           PAGE LIMIT IS 15 LINES
           FIRST DETAIL 1
           LAST DETAIL 12.
       
       01 TYPE IS CONTROL HEADING SAVE-ITEM.
          05 LINE NUMBER IS 1.
            10 COLUMN 1 PIC X(20) VALUE "HEADING SAVE-ITEM".
       
       01 DETAIL-LINE TYPE IS DETAIL.
          05 LINE NUMBER PLUS 1.
            10 COLUMN 1 PIC X SOURCE SAVE-ITEM.
            10 COLUMN 10 PIC X(15) VALUE "1st Detail".
       
       01 SND-DETAIL-LINE TYPE IS DETAIL.
          05 LINE NUMBER PLUS 1.
            10 COLUMN 1 PIC X SOURCE SAVE-ITEM.
            10 COLUMN 10 PIC X(15) VALUE "2nd Detail".
       
       01 TRD-DETAIL-LINE TYPE IS DETAIL.
          05 LINE NUMBER PLUS 1.
            10 COLUMN 1 PIC X SOURCE SAVE-ITEM.
            10 COLUMN 10 PIC X(15) VALUE "3rd Detail 1".
          05 LINE NUMBER PLUS 1.
            10 COLUMN 1 PIC X SOURCE SAVE-ITEM.
            10 COLUMN 10 PIC X(15) VALUE "3rd Detail 2".

       01 TYPE IS CONTROL FOOTING SAVE-ITEM.
          03  LINE NUMBER IS PLUS 1.
           05 COLUMN 07    PIC X(27)  VALUE "FOOTING SAVE-ITEM".
       
       PROCEDURE DIVISION.
           OPEN OUTPUT REPORT-FILE.
           INITIATE MYREPORT.
           MOVE "A" TO SAVE-ITEM.
           GENERATE DETAIL-LINE.
           MOVE "B" TO SAVE-ITEM.
           GENERATE DETAIL-LINE.
           GENERATE SND-DETAIL-LINE.
           GENERATE TRD-DETAIL-LINE.
           MOVE "C" TO SAVE-ITEM.
           GENERATE TRD-DETAIL-LINE.
           TERMINATE MYREPORT.
           CLOSE REPORT-FILE.
           STOP RUN.
