        IDENTIFICATION DIVISION.
        PROGRAM-ID. prog.
        DATA DIVISION.
        WORKING-STORAGE SECTION.
        01  STRUCTURE1.
            05 FIELD1-1  PIC X(5).
            05 FIELD1-2  PIC X(10).
        01  STRUCTURE2   REDEFINES STRUCTURE1.
            05 FIELD2-1  PIC X(10).
            05 FIELD2-2  PIC X(5).
        01  FILLER       REDEFINES STRUCTURE1.
            05 FILLER    PIC X(01).
            05 FIELD     PIC X(02) OCCURS 7.
        01  FILLER.
            05 FIELDO    PIC X(02) OCCURS 7.
        77  NUMVAR       PIC 9(02) VALUE 1.
        78  CONST4       VALUE 4.
        PROCEDURE DIVISION.
           MOVE FIELD1-2 TO STRUCTURE1
           MOVE FIELD1-2 TO FIELD1-1
           MOVE FIELD1-1 TO FIELD1-2, FIELD2-2
           MOVE FIELD1-2 TO FIELD2-1
           MOVE FIELD2-1 TO FIELD2-2
           MOVE FIELD2-1   (2:5) TO FIELD1-2
           MOVE STRUCTURE1 (2:4) TO STRUCTURE1 (5:4)
           MOVE STRUCTURE1 (2:4) TO STRUCTURE1 (6:4)
           MOVE STRUCTURE1 (1:NUMVAR)  TO STRUCTURE1 (3:13)
           MOVE STRUCTURE1 (NUMVAR:1)  TO STRUCTURE1 (3:13)
           MOVE STRUCTURE1 (3:13)      TO STRUCTURE1 (1:NUMVAR) 
           MOVE STRUCTURE1 (3:13)      TO STRUCTURE1 (NUMVAR:1) 
           MOVE STRUCTURE1 (CONST4:2)  TO STRUCTURE1 (3:2)
           MOVE STRUCTURE1 (6:4)       TO STRUCTURE1 (2:4)
           MOVE STRUCTURE1 (6:4)       TO STRUCTURE1 (2: )
           MOVE FIELD (6)         TO STRUCTURE1 (13:2)
           MOVE FIELD (5)         TO STRUCTURE1 (13:2)
           MOVE FIELD (NUMVAR)    TO STRUCTURE1 (13:2)
           MOVE FIELD (CONST4)    TO STRUCTURE1 (13:2)
           MOVE FIELDO (1)        TO FIELDO (1)
           MOVE FIELDO (CONST4)   TO FIELDO (CONST4)
           MOVE FIELDO (1)        TO FIELDO (2)
           MOVE FIELDO (4)        TO FIELDO (CONST4)
           MOVE FIELDO (CONST4)   TO FIELDO (4)
           MOVE FIELDO (4)        TO FIELDO (NUMVAR)
           MOVE FIELDO (NUMVAR)   TO FIELDO (4)
           MOVE FIELDO (NUMVAR)   TO FIELDO (NUMVAR)
           MOVE FIELDO (NUMVAR) (1:1) TO FIELDO (NUMVAR) (2:1)
           MOVE FIELDO (NUMVAR) (2:1) TO FIELDO (NUMVAR)
           MOVE FIELDO (4) (2:1)  TO FIELDO (CONST4)
           STOP RUN.
