       IDENTIFICATION DIVISION.
       PROGRAM-ID. PDTESTNR2.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       REPOSITORY.
       FUNCTION HEX-OF INTRINSIC.

       DATA DIVISION.
       WORKING-STORAGE SECTION.

       77  FLD0500A                       PIC S9(10)V9(08) COMP-3
           VALUE -4830218621.81680639.
       77  FLD0500B                       PIC  9(03)       COMP-6
           VALUE  087.
       77  FLD0500E                       PIC X  VALUE 'N'.

       77  FLD0501A                       PIC  9(09)V9(15) COMP-3
           VALUE  652910855.370784748430423.
       77  FLD0501B                       PIC  9(09)V9(14) COMP-6
           VALUE  628093348.73677369337485.
       77  FLD0501E                       PIC X  VALUE 'N'.

       77  FLD0502A                       PIC  9(03)       COMP-6
           VALUE  079.
       77  FLD0502B                       PIC  9(07)V9(22) COMP-6
           VALUE  7893241.6286150020034995122841.
       77  FLD0502E                       PIC X  VALUE 'N'.

       77  FLD0503A                       PIC  9(10)V9(11) COMP-6
           VALUE  5662523582.77427925159.
       77  FLD0503B                       PIC  9(04)V9(29) COMP-3
           VALUE  8834.70722999726620905391882843105.
       77  FLD0503E                       PIC X  VALUE 'N'.

       77  FLD0504A                       PIC S9(08)V9(02) COMP-3
           VALUE -28360864.01.
       77  FLD0504B                       PIC  9(10)V9(09) COMP-3
           VALUE  5000570062.577901486.
       77  FLD0504E                       PIC X  VALUE 'N'.

       77  FLD0505A                       PIC  9(04)V9(30) COMP-3
           VALUE  9110.332843503369248949752545740921.
       77  FLD0505B                       PIC  9(10)V9(10) COMP-3
           VALUE  5407979633.7587637822.
       77  FLD0505E                       PIC X  VALUE 'N'.

       77  FLD0506A                       PIC  9(10)V9(11) COMP-3
           VALUE  5546838940.35467472960.
       77  FLD0506B                       PIC S9(07)V9(01) COMP-3
           VALUE +2340559.3.
       77  FLD0506E                       PIC X  VALUE 'N'.

       77  FLD0507A                       PIC  9(08)V9(18) COMP-6
           VALUE  70736506.262277043521891073.
       77  FLD0507B                       PIC  9(10)V9(09) COMP-3
           VALUE  5205430142.820132166.
       77  FLD0507E                       PIC X  VALUE 'N'.

       77  FLD0508A                       PIC  9(09)V9(16) COMP-6
           VALUE  658855971.9467786957025623.
       77  FLD0508B                       PIC S9(09)V9(07) COMP-3
           VALUE +444447149.8618901.
       77  FLD0508E                       PIC X  VALUE 'N'.

       77  FLD0509A                       PIC S9(01)       COMP-3
           VALUE +0.
       77  FLD0509B                       PIC  9(10)V9(08) COMP-6
           VALUE  4889373386.26299289.
       77  FLD0509E                       PIC X  VALUE 'N'.

       77  FLD0510A                       PIC  9(04)       COMP-6
           VALUE  1295.
       77  FLD0510B                       PIC S9(03)       COMP-3
           VALUE -092.
       77  FLD0510E                       PIC X  VALUE 'N'.

       77  FLD0511A                       PIC  9(06)V9(25) COMP-6
           VALUE  815863.7850571600624860479911149.
       77  FLD0511B                       PIC  9(10)V9(09) COMP-6
           VALUE  5256921146.480894035.
       77  FLD0511E                       PIC X  VALUE 'N'.

       77  FLD0512A                       PIC  9(05)       COMP-6
           VALUE  13945.
       77  FLD0512B                       PIC  9(01)V9(36) COMP-3
           VALUE  9.908282031313487836499120930966455489.
       77  FLD0512E                       PIC X  VALUE 'N'.

       77  FLD0513A                       PIC  9(09)V9(15) COMP-3
           VALUE  653773832.246937192103075.
       77  FLD0513B                       PIC  9(08)V9(20) COMP-3
           VALUE  74124087.47450585089211472222.
       77  FLD0513E                       PIC X  VALUE 'N'.

       77  FLD0514A                       PIC  9(08)V9(18) COMP-3
           VALUE  70109343.593910689040882289.
       77  FLD0514B                       PIC  9(09)V9(04) COMP-6
           VALUE  348891343.2762.
       77  FLD0514E                       PIC X  VALUE 'N'.

       77  FLD0515A                       PIC  9(09)V9(16) COMP-6
           VALUE  658210435.7548693718271692.
       77  FLD0515B                       PIC  9(03)V9(32) COMP-3
           VALUE  941.14524908048735607479784448514692.
       77  FLD0515E                       PIC X  VALUE 'N'.

       77  FLD0516A                       PIC  9(01)V9(36) COMP-6
           VALUE  9.884403805479323734672902901365887373.
       77  FLD0516B                       PIC  9(01)       COMP-6
           VALUE  0.
       77  FLD0516E                       PIC X  VALUE 'N'.

       77  FLD0517A                       PIC  9(10)V9(07) COMP-6
           VALUE  4497620438.0577999.
       77  FLD0517B                       PIC S9(10)V9(08) COMP-3
           VALUE -4811021778.48490686.
       77  FLD0517E                       PIC X  VALUE 'N'.

       77  FLD0518A                       PIC  9(09)V9(16) COMP-3
           VALUE  664556684.1155496895510168.
       77  FLD0518B                       PIC S9(02)       COMP-3
           VALUE -05.
       77  FLD0518E                       PIC X  VALUE 'N'.

       77  FLD0519A                       PIC  9(09)V9(14) COMP-3
           VALUE  630097608.79846921088898.
       77  FLD0519B                       PIC  9(08)V9(17) COMP-3
           VALUE  68412596.06583623975595287.
       77  FLD0519E                       PIC X  VALUE 'N'.

       77  FLD0520A                       PIC  9(04)V9(30) COMP-6
           VALUE  9052.329380117529744609328190563246.
       77  FLD0520B                       PIC  9(09)V9(14) COMP-3
           VALUE  610604586.65389061305717.
       77  FLD0520E                       PIC X  VALUE 'N'.

       77  FLD0521A                       PIC  9(05)       COMP-6
           VALUE  13956.
       77  FLD0521B                       PIC S9(05)       COMP-3
           VALUE +14099.
       77  FLD0521E                       PIC X  VALUE 'N'.

       77  FLD0522A                       PIC S9(01)       COMP-3
           VALUE +0.
       77  FLD0522B                       PIC S9(09)V9(04) COMP-3
           VALUE -351067614.4076.
       77  FLD0522E                       PIC X  VALUE 'N'.

       77  FLD0523A                       PIC  9(08)V9(18) COMP-6
           VALUE  70807149.512639711019801325.
       77  FLD0523B                       PIC S9(08)V9(02) COMP-3
           VALUE -28004002.44.
       77  FLD0523E                       PIC X  VALUE 'N'.

       77  FLD0524A                       PIC S9(06)V9(01) COMP-3
           VALUE +201515.3.
       77  FLD0524B                       PIC  9(10)V9(09) COMP-3
           VALUE  5046210377.505329081.
       77  FLD0524E                       PIC X  VALUE 'N'.

       77  FLD0525A                       PIC S9(01)       COMP-3
           VALUE -0.
       77  FLD0525B                       PIC  9(04)V9(29) COMP-6
           VALUE  8873.36156634660588871099662355845.
       77  FLD0525E                       PIC X  VALUE 'N'.

       77  FLD0526A                       PIC  9(07)V9(22) COMP-3
           VALUE  7812896.0072540409864672028561.
       77  FLD0526B                       PIC  9(07)V9(02) COMP-6
           VALUE  2461308.93.
       77  FLD0526E                       PIC X  VALUE 'N'.

       77  FLD0527A                       PIC  9(10)V9(12) COMP-6
           VALUE  5853770318.384275972434.
       77  FLD0527B                       PIC  9(10)V9(09) COMP-3
           VALUE  5140096263.891610339.
       77  FLD0527E                       PIC X  VALUE 'N'.

       77  FLD0528A                       PIC  9(10)V9(08) COMP-6
           VALUE  4856797949.89136714.
       77  FLD0528B                       PIC S9(04)       COMP-3
           VALUE +1207.
       77  FLD0528E                       PIC X  VALUE 'N'.

       77  FLD0529A                       PIC  9(10)V9(10) COMP-6
           VALUE  5298570971.4885653731.
       77  FLD0529B                       PIC S9(10)V9(07) COMP-3
           VALUE -4613280273.7797717.
       77  FLD0529E                       PIC X  VALUE 'N'.

       77  FLD0530A                       PIC  9(05)V9(28) COMP-6
           VALUE  87536.5484141958027919372398173436.
       77  FLD0530B                       PIC S9(02)       COMP-3
           VALUE -06.
       77  FLD0530E                       PIC X  VALUE 'N'.

       77  FLD0531A                       PIC  9(09)V9(03) COMP-6
           VALUE  317487049.751.
       77  FLD0531B                       PIC S9(07)V9(01) COMP-3
           VALUE +2322772.2.
       77  FLD0531E                       PIC X  VALUE 'N'.

       77  FLD0532A                       PIC  9(09)V9(15) COMP-3
           VALUE  653250626.044252880042506.
       77  FLD0532B                       PIC S9(01)       COMP-3
           VALUE +0.
       77  FLD0532E                       PIC X  VALUE 'N'.

       77  FLD0533A                       PIC  9(07)V9(02) COMP-6
           VALUE  2559928.55.
       77  FLD0533B                       PIC  9(03)       COMP-6
           VALUE  086.
       77  FLD0533E                       PIC X  VALUE 'N'.

       77  FLD0534A                       PIC  9(09)V9(06) COMP-6
           VALUE  408226706.354108.
       77  FLD0534B                       PIC  9(10)V9(09) COMP-3
           VALUE  5204512753.981520578.
       77  FLD0534E                       PIC X  VALUE 'N'.

       77  FLD0535A                       PIC  9(10)V9(11) COMP-6
           VALUE  5556101599.27967472981.
       77  FLD0535B                       PIC  9(05)V9(27) COMP-3
           VALUE  85335.564071638048133650045201648.
       77  FLD0535E                       PIC X  VALUE 'N'.

       77  FLD0536A                       PIC S9(08)V9(03) COMP-3
           VALUE -29061270.882.
       77  FLD0536B                       PIC S9(01)       COMP-3
           VALUE -0.
       77  FLD0536E                       PIC X  VALUE 'N'.

       77  FLD0537A                       PIC  9(08)V9(03) COMP-6
           VALUE  29943354.242.
       77  FLD0537B                       PIC  9(04)       COMP-6
           VALUE  1199.
       77  FLD0537E                       PIC X  VALUE 'N'.

       77  FLD0538A                       PIC  9(03)V9(32) COMP-3
           VALUE  922.29859860523566439383102988358587.
       77  FLD0538B                       PIC  9(04)V9(29) COMP-6
           VALUE  8861.76614320458799767266100388951.
       77  FLD0538E                       PIC X  VALUE 'N'.

       77  FLD0539A                       PIC  9(05)V9(27) COMP-6
           VALUE  85666.721070025741990860979058197.
       77  FLD0539B                       PIC  9(05)V9(27) COMP-3
           VALUE  84375.338828007329095015620623598.
       77  FLD0539E                       PIC X  VALUE 'N'.

       77  FLD0540A                       PIC S9(04)       COMP-3
           VALUE +1227.
       77  FLD0540B                       PIC  9(01)       COMP-6
           VALUE  0.
       77  FLD0540E                       PIC X  VALUE 'N'.

       77  FLD0541A                       PIC  9(09)V9(05) COMP-6
           VALUE  387240740.80744.
       77  FLD0541B                       PIC  9(07)V9(22) COMP-6
           VALUE  7676023.3773886621388982121061.
       77  FLD0541E                       PIC X  VALUE 'N'.

       77  FLD0542A                       PIC  9(06)V9(25) COMP-3
           VALUE  831706.5789473143677668076634290.
       77  FLD0542B                       PIC  9(10)V9(11) COMP-3
           VALUE  5532908670.51828949563.
       77  FLD0542E                       PIC X  VALUE 'N'.

       77  FLD0543A                       PIC  9(06)V9(01) COMP-6
           VALUE  188772.9.
       77  FLD0543B                       PIC  9(07)V9(02) COMP-6
           VALUE  2581387.79.
       77  FLD0543E                       PIC X  VALUE 'N'.

       77  FLD0544A                       PIC  9(10)V9(09) COMP-3
           VALUE  5241766194.366106468.
       77  FLD0544B                       PIC  9(08)V9(02) COMP-6
           VALUE  27953166.13.
       77  FLD0544E                       PIC X  VALUE 'N'.

       77  FLD0545A                       PIC  9(09)V9(14) COMP-3
           VALUE  622229285.46684597161942.
       77  FLD0545B                       PIC  9(08)V9(19) COMP-3
           VALUE  72256359.1476747091313370674.
       77  FLD0545E                       PIC X  VALUE 'N'.

       77  FLD0546A                       PIC  9(06)V9(25) COMP-3
           VALUE  820358.8689269564193651262939965.
       77  FLD0546B                       PIC  9(09)V9(14) COMP-3
           VALUE  610779194.05314462508727.
       77  FLD0546E                       PIC X  VALUE 'N'.

       77  FLD0547A                       PIC  9(06)V9(25) COMP-3
           VALUE  821925.7242001770658035297856258.
       77  FLD0547B                       PIC S9(09)V9(04) COMP-3
           VALUE -360691511.9302.
       77  FLD0547E                       PIC X  VALUE 'N'.

       77  FLD0548A                       PIC  9(07)V9(23) COMP-6
           VALUE  7955385.78445739497091437897324.
       77  FLD0548B                       PIC  9(09)V9(17) COMP-6
           VALUE  689149957.90453892343663255.
       77  FLD0548E                       PIC X  VALUE 'N'.

       77  FLD0549A                       PIC  9(07)V9(01) COMP-6
           VALUE  2367856.7.
       77  FLD0549B                       PIC  9(09)V9(06) COMP-6
           VALUE  415548355.051954.
       77  FLD0549E                       PIC X  VALUE 'N'.

       77  FLD0550A                       PIC  9(09)V9(15) COMP-6
           VALUE  656651700.520587522369453.
       77  FLD0550B                       PIC  9(02)       COMP-6
           VALUE  06.
       77  FLD0550E                       PIC X  VALUE 'N'.

       77  FLD0551A                       PIC  9(07)V9(02) COMP-6
           VALUE  2589973.73.
       77  FLD0551B                       PIC  9(09)V9(15) COMP-3
           VALUE  652529070.867454263904505.
       77  FLD0551E                       PIC X  VALUE 'N'.

       77  FLD0552A                       PIC  9(10)V9(07) COMP-6
           VALUE  4579590761.6898545.
       77  FLD0552B                       PIC  9(05)       COMP-6
           VALUE  14745.
       77  FLD0552E                       PIC X  VALUE 'N'.

       77  FLD0553A                       PIC S9(01)       COMP-3
           VALUE +0.
       77  FLD0553B                       PIC S9(09)V9(04) COMP-3
           VALUE -360871096.9090.
       77  FLD0553E                       PIC X  VALUE 'N'.

       77  FLD0554A                       PIC  9(07)V9(02) COMP-6
           VALUE  2568219.15.
       77  FLD0554B                       PIC  9(03)V9(32) COMP-3
           VALUE  932.99236247731820448336748086148872.
       77  FLD0554E                       PIC X  VALUE 'N'.

       77  FLD0555A                       PIC  9(09)V9(05) COMP-6
           VALUE  388184875.66560.
       77  FLD0555B                       PIC  9(10)V9(09) COMP-3
           VALUE  5217501857.988002811.
       77  FLD0555E                       PIC X  VALUE 'N'.

       77  FLD0556A                       PIC  9(04)V9(30) COMP-6
           VALUE  8983.209260005348140154524116951506.
       77  FLD0556B                       PIC  9(10)V9(11) COMP-6
           VALUE  5685562200.43860527368.
       77  FLD0556E                       PIC X  VALUE 'N'.

       77  FLD0557A                       PIC  9(09)V9(15) COMP-3
           VALUE  650877011.601572519339242.
       77  FLD0557B                       PIC S9(05)       COMP-3
           VALUE +13329.
       77  FLD0557E                       PIC X  VALUE 'N'.

       77  FLD0558A                       PIC  9(09)V9(13) COMP-6
           VALUE  595830550.3266489999703.
       77  FLD0558B                       PIC  9(06)V9(01) COMP-6
           VALUE  209604.9.
       77  FLD0558E                       PIC X  VALUE 'N'.

       77  FLD0559A                       PIC  9(10)V9(09) COMP-3
           VALUE  5242032248.235551916.
       77  FLD0559B                       PIC  9(07)V9(22) COMP-6
           VALUE  7882034.1791675385678672682843.
       77  FLD0559E                       PIC X  VALUE 'N'.

       77  FLD0560A                       PIC S9(09)V9(06) COMP-3
           VALUE +403640603.914505.
       77  FLD0560B                       PIC  9(09)V9(07) COMP-6
           VALUE  438743115.5223073.
       77  FLD0560E                       PIC X  VALUE 'N'.

       77  FLD0561A                       PIC  9(05)       COMP-6
           VALUE  14931.
       77  FLD0561B                       PIC  9(01)       COMP-6
           VALUE  0.
       77  FLD0561E                       PIC X  VALUE 'N'.

       77  FLD0562A                       PIC S9(01)       COMP-3
           VALUE -0.
       77  FLD0562B                       PIC  9(02)V9(34) COMP-6
           VALUE  95.8208334412512741096179524902254343.
       77  FLD0562E                       PIC X  VALUE 'N'.

       77  FLD0563A                       PIC  9(10)V9(09) COMP-3
           VALUE  5040974749.501065943.
       77  FLD0563B                       PIC S9(08)V9(03) COMP-3
           VALUE +31252590.212.
       77  FLD0563E                       PIC X  VALUE 'N'.

       77  FLD0564A                       PIC  9(09)V9(16) COMP-6
           VALUE  666123633.8391588462926051.
       77  FLD0564B                       PIC  9(03)V9(32) COMP-6
           VALUE  925.73034981753798966508384182816371.
       77  FLD0564E                       PIC X  VALUE 'N'.

       77  FLD0565A                       PIC  9(04)V9(30) COMP-6
           VALUE  8999.472704059103822515908177592791.
       77  FLD0565B                       PIC  9(06)V9(01) COMP-6
           VALUE  209088.7.
       77  FLD0565E                       PIC X  VALUE 'N'.

       77  FLD0566A                       PIC  9(10)V9(10) COMP-6
           VALUE  5451645287.6426646501.
       77  FLD0566B                       PIC  9(09)V9(03) COMP-6
           VALUE  317445075.017.
       77  FLD0566E                       PIC X  VALUE 'N'.

       77  FLD0567A                       PIC S9(07)V9(02) COMP-3
           VALUE -2621767.34.
       77  FLD0567B                       PIC  9(04)V9(29) COMP-6
           VALUE  8789.70351596639054569948257267242.
       77  FLD0567E                       PIC X  VALUE 'N'.

       77  FLD0568A                       PIC S9(08)V9(02) COMP-3
           VALUE -28119737.76.
       77  FLD0568B                       PIC  9(09)V9(14) COMP-6
           VALUE  616894259.97583058336459.
       77  FLD0568E                       PIC X  VALUE 'N'.

       77  FLD0569A                       PIC  9(10)V9(10) COMP-3
           VALUE  5301098669.5201622875.
       77  FLD0569B                       PIC S9(09)V9(06) COMP-3
           VALUE +421009403.834593.
       77  FLD0569E                       PIC X  VALUE 'N'.

       77  FLD0570A                       PIC  9(05)       COMP-6
           VALUE  13775.
       77  FLD0570B                       PIC  9(08)V9(19) COMP-3
           VALUE  72019797.5322646066764775696.
       77  FLD0570E                       PIC X  VALUE 'N'.

       77  FLD0571A                       PIC  9(10)V9(08) COMP-6
           VALUE  4995844884.12155025.
       77  FLD0571B                       PIC  9(09)V9(16) COMP-6
           VALUE  666328034.4715885039619251.
       77  FLD0571E                       PIC X  VALUE 'N'.

       77  FLD0572A                       PIC  9(06)V9(01) COMP-6
           VALUE  199648.9.
       77  FLD0572B                       PIC S9(06)       COMP-3
           VALUE -163410.
       77  FLD0572E                       PIC X  VALUE 'N'.

       77  FLD0573A                       PIC  9(10)V9(11) COMP-6
           VALUE  5579051586.61930800079.
       77  FLD0573B                       PIC  9(01)V9(36) COMP-3
           VALUE  9.908582147727897915245875992695800960.
       77  FLD0573E                       PIC X  VALUE 'N'.

       77  FLD0574A                       PIC  9(10)V9(09) COMP-3
           VALUE  5021035726.447702352.
       77  FLD0574B                       PIC S9(01)       COMP-3
           VALUE +0.
       77  FLD0574E                       PIC X  VALUE 'N'.

       77  FLD0575A                       PIC  9(02)V9(34) COMP-3
           VALUE  96.0495649054037059499933093320578336.
       77  FLD0575B                       PIC S9(01)       COMP-3
           VALUE +0.
       77  FLD0575E                       PIC X  VALUE 'N'.

       77  FLD0576A                       PIC  9(09)V9(11) COMP-3
           VALUE  551289746.02273483895.
       77  FLD0576B                       PIC  9(10)V9(10) COMP-6
           VALUE  5275129807.0789420791.
       77  FLD0576E                       PIC X  VALUE 'N'.

       77  FLD0577A                       PIC S9(10)V9(06) COMP-3
           VALUE +4245433083.607936.
       77  FLD0577B                       PIC  9(02)V9(34) COMP-6
           VALUE  96.8922152301445405164770363626303151.
       77  FLD0577E                       PIC X  VALUE 'N'.

       77  FLD0578A                       PIC S9(07)V9(02) COMP-3
           VALUE +2444375.29.
       77  FLD0578B                       PIC  9(05)V9(01) COMP-6
           VALUE  16994.3.
       77  FLD0578E                       PIC X  VALUE 'N'.

       77  FLD0579A                       PIC  9(09)V9(17) COMP-6
           VALUE  688719854.55414208576740975.
       77  FLD0579B                       PIC  9(10)V9(09) COMP-3
           VALUE  5219660742.233359629.
       77  FLD0579E                       PIC X  VALUE 'N'.

       77  FLD0580A                       PIC S9(08)V9(04) COMP-3
           VALUE +33455460.0291.
       77  FLD0580B                       PIC  9(02)V9(34) COMP-3
           VALUE  95.3840741032953354228141051862621679.
       77  FLD0580E                       PIC X  VALUE 'N'.

       77  FLD0581A                       PIC S9(08)V9(02) COMP-3
           VALUE -28271118.43.
       77  FLD0581B                       PIC  9(09)V9(15) COMP-6
           VALUE  638334092.073881143036828.
       77  FLD0581E                       PIC X  VALUE 'N'.

       77  FLD0582A                       PIC  9(02)V9(34) COMP-3
           VALUE  95.0957041455027018983514608407858759.
       77  FLD0582B                       PIC  9(09)V9(14) COMP-6
           VALUE  628562844.11633944753106.
       77  FLD0582E                       PIC X  VALUE 'N'.

       77  FLD0583A                       PIC  9(04)V9(30) COMP-3
           VALUE  9004.015213488590907431330379040446.
       77  FLD0583B                       PIC S9(01)       COMP-3
           VALUE +0.
       77  FLD0583E                       PIC X  VALUE 'N'.

       77  FLD0584A                       PIC S9(01)       COMP-3
           VALUE +0.
       77  FLD0584B                       PIC  9(02)V9(34) COMP-6
           VALUE  95.5867594557756605766485336062032729.
       77  FLD0584E                       PIC X  VALUE 'N'.

       77  FLD0585A                       PIC S9(10)V9(06) COMP-3
           VALUE +4326355872.600766.
       77  FLD0585B                       PIC  9(03)V9(32) COMP-6
           VALUE  926.67442032915370297985191427869722.
       77  FLD0585E                       PIC X  VALUE 'N'.

       77  FLD0586A                       PIC  9(05)V9(27) COMP-6
           VALUE  85722.001340062370378092282408033.
       77  FLD0586B                       PIC  9(07)V9(22) COMP-6
           VALUE  7865140.9974229868904416207442.
       77  FLD0586E                       PIC X  VALUE 'N'.

       77  FLD0587A                       PIC S9(09)V9(05) COMP-3
           VALUE -381433349.51035.
       77  FLD0587B                       PIC S9(04)       COMP-3
           VALUE +1221.
       77  FLD0587E                       PIC X  VALUE 'N'.

       77  FLD0588A                       PIC  9(10)V9(09) COMP-6
           VALUE  5181115773.570048599.
       77  FLD0588B                       PIC  9(04)V9(30) COMP-3
           VALUE  9002.074772136551272794235956098418.
       77  FLD0588E                       PIC X  VALUE 'N'.

       77  FLD0589A                       PIC S9(09)V9(06) COMP-3
           VALUE +401102073.275349.
       77  FLD0589B                       PIC S9(04)       COMP-3
           VALUE +1219.
       77  FLD0589E                       PIC X  VALUE 'N'.

       77  FLD0590A                       PIC  9(08)V9(18) COMP-3
           VALUE  70309799.830174168899787900.
       77  FLD0590B                       PIC S9(06)V9(01) COMP-3
           VALUE +203587.9.
       77  FLD0590E                       PIC X  VALUE 'N'.

       77  FLD0591A                       PIC  9(09)V9(12) COMP-6
           VALUE  576933255.371857245386.
       77  FLD0591B                       PIC  9(10)V9(09) COMP-3
           VALUE  5123728162.782491546.
       77  FLD0591E                       PIC X  VALUE 'N'.

       77  FLD0592A                       PIC  9(09)V9(15) COMP-3
           VALUE  644514829.253344467829833.
       77  FLD0592B                       PIC S9(08)V9(03) COMP-3
           VALUE -29392268.940.
       77  FLD0592E                       PIC X  VALUE 'N'.

       77  FLD0593A                       PIC  9(08)V9(19) COMP-3
           VALUE  72063942.4137167527995018190.
       77  FLD0593B                       PIC S9(02)       COMP-3
           VALUE -05.
       77  FLD0593E                       PIC X  VALUE 'N'.

       77  FLD0594A                       PIC S9(08)V9(02) COMP-3
           VALUE -27405154.91.
       77  FLD0594B                       PIC  9(07)V9(22) COMP-3
           VALUE  7738893.5043103479483050932685.
       77  FLD0594E                       PIC X  VALUE 'N'.

       77  FLD0595A                       PIC  9(08)V9(18) COMP-3
           VALUE  70489201.749069052560514592.
       77  FLD0595B                       PIC  9(06)V9(25) COMP-3
           VALUE  830535.6563477365172687427730124.
       77  FLD0595E                       PIC X  VALUE 'N'.

       77  FLD0596A                       PIC  9(04)V9(30) COMP-6
           VALUE  9050.358418523600789740157779306173.
       77  FLD0596B                       PIC  9(09)V9(15) COMP-6
           VALUE  657865013.656926733709440.
       77  FLD0596E                       PIC X  VALUE 'N'.

       77  FLD0597A                       PIC S9(10)V9(07) COMP-3
           VALUE -4611492066.1642122.
       77  FLD0597B                       PIC  9(06)V9(25) COMP-6
           VALUE  816255.9991782142310157155407068.
       77  FLD0597E                       PIC X  VALUE 'N'.

       77  FLD0598A                       PIC  9(10)V9(12) COMP-6
           VALUE  5888650589.753158248740.
       77  FLD0598B                       PIC S9(09)V9(06) COMP-3
           VALUE +420172956.568651.
       77  FLD0598E                       PIC X  VALUE 'N'.

       77  FLD0599A                       PIC  9(05)V9(27) COMP-6
           VALUE  85689.140306102984379066356268594.
       77  FLD0599B                       PIC  9(01)       COMP-6
           VALUE  0.
       77  FLD0599E                       PIC X  VALUE 'N'.

       77  FLD0600A                       PIC S9(09)V9(06) COMP-3
           VALUE +401694362.049109.
       77  FLD0600B                       PIC  9(06)V9(24) COMP-3
           VALUE  804504.375985138686644404515391.
       77  FLD0600E                       PIC X  VALUE 'N'.

       77  FLD0601A                       PIC  9(01)V9(36) COMP-6
           VALUE  9.763793413809590537866256454435642808.
       77  FLD0601B                       PIC  9(08)V9(03) COMP-6
           VALUE  29749803.347.
       77  FLD0601E                       PIC X  VALUE 'N'.

       77  FLD0602A                       PIC  9(09)V9(17) COMP-6
           VALUE  685435627.00727922454291274.
       77  FLD0602B                       PIC  9(07)V9(02) COMP-6
           VALUE  2399467.62.
       77  FLD0602E                       PIC X  VALUE 'N'.

       77  FLD0603A                       PIC  9(09)V9(16) COMP-6
           VALUE  679265807.5584466770280300.
       77  FLD0603B                       PIC S9(05)V9(01) COMP-3
           VALUE -17089.6.
       77  FLD0603E                       PIC X  VALUE 'N'.

       77  FLD0604A                       PIC  9(08)V9(19) COMP-6
           VALUE  72862711.3591577502127449861.
       77  FLD0604B                       PIC  9(10)V9(11) COMP-6
           VALUE  5587264166.34705347341.
       77  FLD0604E                       PIC X  VALUE 'N'.

       77  FLD0605A                       PIC  9(04)       COMP-6
           VALUE  1194.
       77  FLD0605B                       PIC  9(10)V9(06) COMP-6
           VALUE  4256956703.307752.
       77  FLD0605E                       PIC X  VALUE 'N'.

       77  FLD0606A                       PIC  9(07)V9(23) COMP-6
           VALUE  7955557.56926823565144957228767.
       77  FLD0606B                       PIC S9(08)V9(04) COMP-3
           VALUE +33373395.9174.
       77  FLD0606E                       PIC X  VALUE 'N'.

       77  FLD0607A                       PIC  9(10)V9(08) COMP-6
           VALUE  4950511846.00309279.
       77  FLD0607B                       PIC  9(05)       COMP-6
           VALUE  13935.
       77  FLD0607E                       PIC X  VALUE 'N'.

       77  FLD0608A                       PIC  9(09)V9(03) COMP-6
           VALUE  328182518.441.
       77  FLD0608B                       PIC  9(02)V9(34) COMP-6
           VALUE  95.9183130416232931914066739409463480.
       77  FLD0608E                       PIC X  VALUE 'N'.

       77  FLD0609A                       PIC  9(08)V9(04) COMP-6
           VALUE  33948712.4475.
       77  FLD0609B                       PIC  9(10)V9(07) COMP-6
           VALUE  4478674210.4372267.
       77  FLD0609E                       PIC X  VALUE 'N'.

       77  FLD0610A                       PIC  9(06)V9(24) COMP-6
           VALUE  807988.537497822956190418608457.
       77  FLD0610B                       PIC  9(08)V9(02) COMP-6
           VALUE  28672541.25.
       77  FLD0610E                       PIC X  VALUE 'N'.

       77  FLD0611A                       PIC  9(07)V9(22) COMP-3
           VALUE  7747853.4043620861382350994972.
       77  FLD0611B                       PIC  9(01)       COMP-6
           VALUE  0.
       77  FLD0611E                       PIC X  VALUE 'N'.

       77  FLD0612A                       PIC  9(10)V9(11) COMP-3
           VALUE  5644161799.14422944108.
       77  FLD0612B                       PIC  9(07)V9(22) COMP-6
           VALUE  7874462.2890006543691754359315.
       77  FLD0612E                       PIC X  VALUE 'N'.

       77  FLD0613A                       PIC  9(05)       COMP-6
           VALUE  15551.
       77  FLD0613B                       PIC S9(07)V9(01) COMP-3
           VALUE +2249276.6.
       77  FLD0613E                       PIC X  VALUE 'N'.

       77  FLD0614A                       PIC  9(10)V9(09) COMP-3
           VALUE  5201647014.630440546.
       77  FLD0614B                       PIC  9(09)V9(13) COMP-6
           VALUE  596348860.2168276475623.
       77  FLD0614E                       PIC X  VALUE 'N'.

       77  FLD0615A                       PIC S9(03)       COMP-3
           VALUE +101.
       77  FLD0615B                       PIC S9(07)V9(01) COMP-3
           VALUE +2334095.1.
       77  FLD0615E                       PIC X  VALUE 'N'.

       77  FLD0616A                       PIC  9(07)V9(22) COMP-3
           VALUE  7639230.3574527464782306651613.
       77  FLD0616B                       PIC  9(02)       COMP-6
           VALUE  07.
       77  FLD0616E                       PIC X  VALUE 'N'.

       77  FLD0617A                       PIC S9(01)       COMP-3
           VALUE -0.
       77  FLD0617B                       PIC  9(01)       COMP-6
           VALUE  0.
       77  FLD0617E                       PIC X  VALUE 'N'.

       77  FLD0618A                       PIC  9(01)V9(36) COMP-3
           VALUE  9.817148549708982763206677191192284226.
       77  FLD0618B                       PIC  9(03)       COMP-6
           VALUE  089.
       77  FLD0618E                       PIC X  VALUE 'N'.

       77  FLD0619A                       PIC  9(06)V9(24) COMP-3
           VALUE  801850.998363624500875346257089.
       77  FLD0619B                       PIC  9(10)V9(10) COMP-3
           VALUE  5342180526.7555677598.
       77  FLD0619E                       PIC X  VALUE 'N'.

       77  FLD0620A                       PIC  9(08)V9(19) COMP-6
           VALUE  71717267.3810957062023874186.
       77  FLD0620B                       PIC  9(09)V9(15) COMP-6
           VALUE  655677089.730182127702562.
       77  FLD0620E                       PIC X  VALUE 'N'.

       77  FLD0621A                       PIC  9(04)V9(30) COMP-3
           VALUE  9035.013690395441443570234696380794.
       77  FLD0621B                       PIC  9(08)V9(19) COMP-3
           VALUE  73424367.1686218957184166811.
       77  FLD0621E                       PIC X  VALUE 'N'.

       77  FLD0622A                       PIC  9(09)V9(13) COMP-3
           VALUE  592420192.5737704321761.
       77  FLD0622B                       PIC S9(09)V9(04) COMP-3
           VALUE -361821982.1111.
       77  FLD0622E                       PIC X  VALUE 'N'.

       77  FLD0623A                       PIC S9(03)       COMP-3
           VALUE +104.
       77  FLD0623B                       PIC  9(09)V9(15) COMP-3
           VALUE  641616818.896418195095066.
       77  FLD0623E                       PIC X  VALUE 'N'.

       77  FLD0624A                       PIC S9(06)       COMP-3
           VALUE -162056.
       77  FLD0624B                       PIC  9(10)V9(06) COMP-6
           VALUE  4356343039.582531.
       77  FLD0624E                       PIC X  VALUE 'N'.

       77  FLD0625A                       PIC  9(04)       COMP-6
           VALUE  1296.
       77  FLD0625B                       PIC  9(07)V9(22) COMP-3
           VALUE  7829547.5769811728739000500354.
       77  FLD0625E                       PIC X  VALUE 'N'.

       77  FLD0626A                       PIC  9(04)V9(29) COMP-3
           VALUE  8839.60373056715265072114107169909.
       77  FLD0626B                       PIC S9(09)V9(05) COMP-3
           VALUE -374265939.71690.
       77  FLD0626E                       PIC X  VALUE 'N'.

       77  FLD0627A                       PIC  9(04)       COMP-6
           VALUE  1093.
       77  FLD0627B                       PIC S9(07)V9(01) COMP-3
           VALUE +2323895.2.
       77  FLD0627E                       PIC X  VALUE 'N'.

       77  FLD0628A                       PIC  9(01)V9(36) COMP-3
           VALUE  9.943034041886028573387079632084351032.
       77  FLD0628B                       PIC  9(08)V9(03) COMP-6
           VALUE  29681737.673.
       77  FLD0628E                       PIC X  VALUE 'N'.

       77  FLD0629A                       PIC  9(03)V9(32) COMP-6
           VALUE  925.54391942612090904418664649710990.
       77  FLD0629B                       PIC  9(05)V9(28) COMP-3
           VALUE  87091.5644969416202769707524566911.
       77  FLD0629E                       PIC X  VALUE 'N'.

       77  FLD0630A                       PIC S9(09)V9(06) COMP-3
           VALUE +400669561.119235.
       77  FLD0630B                       PIC  9(09)V9(12) COMP-6
           VALUE  575188656.368988304734.
       77  FLD0630E                       PIC X  VALUE 'N'.

       77  FLD0631A                       PIC  9(09)V9(15) COMP-3
           VALUE  644864894.904831453814608.
       77  FLD0631B                       PIC  9(05)V9(01) COMP-6
           VALUE  17568.5.
       77  FLD0631E                       PIC X  VALUE 'N'.

       77  FLD0632A                       PIC  9(08)V9(18) COMP-6
           VALUE  69998401.036213298009869276.
       77  FLD0632B                       PIC  9(10)V9(09) COMP-6
           VALUE  5082278856.741135886.
       77  FLD0632E                       PIC X  VALUE 'N'.

       77  FLD0633A                       PIC  9(08)V9(19) COMP-3
           VALUE  72186800.0789349095747127194.
       77  FLD0633B                       PIC S9(09)V9(03) COMP-3
           VALUE +332989951.149.
       77  FLD0633E                       PIC X  VALUE 'N'.

       77  FLD0634A                       PIC S9(10)V9(06) COMP-3
           VALUE +4236607402.255205.
       77  FLD0634B                       PIC  9(07)V9(23) COMP-3
           VALUE  7926419.75404680843020344127580.
       77  FLD0634E                       PIC X  VALUE 'N'.

       77  FLD0635A                       PIC S9(06)V9(01) COMP-3
           VALUE -190863.2.
       77  FLD0635B                       PIC  9(10)V9(11) COMP-6
           VALUE  5580856572.20784292498.
       77  FLD0635E                       PIC X  VALUE 'N'.

       77  FLD0636A                       PIC S9(07)V9(01) COMP-3
           VALUE +2326055.8.
       77  FLD0636B                       PIC  9(05)       COMP-6
           VALUE  15706.
       77  FLD0636E                       PIC X  VALUE 'N'.

       77  FLD0637A                       PIC  9(08)V9(19) COMP-3
           VALUE  73470187.3111827330475875896.
       77  FLD0637B                       PIC  9(10)V9(10) COMP-3
           VALUE  5305678545.6603405837.
       77  FLD0637E                       PIC X  VALUE 'N'.

       77  FLD0638A                       PIC  9(07)V9(22) COMP-6
           VALUE  7752451.2041246673721417437263.
       77  FLD0638B                       PIC  9(06)V9(25) COMP-3
           VALUE  822351.5027967045476486873667454.
       77  FLD0638E                       PIC X  VALUE 'N'.

       77  FLD0639A                       PIC S9(09)V9(03) COMP-3
           VALUE +320313574.327.
       77  FLD0639B                       PIC  9(01)V9(36) COMP-6
           VALUE  9.751092072024196699686626743641681969.
       77  FLD0639E                       PIC X  VALUE 'N'.

       77  FLD0640A                       PIC  9(04)V9(29) COMP-3
           VALUE  8818.61493829378950692898797569796.
       77  FLD0640B                       PIC  9(03)V9(32) COMP-3
           VALUE  921.50555740058603948483550993842072.
       77  FLD0640E                       PIC X  VALUE 'N'.

       77  FLD0641A                       PIC  9(07)V9(22) COMP-6
           VALUE  7672056.2697199168322725881807.
       77  FLD0641B                       PIC  9(08)V9(19) COMP-6
           VALUE  72539277.3386829170512157816.
       77  FLD0641E                       PIC X  VALUE 'N'.

       77  FLD0642A                       PIC  9(08)V9(18) COMP-6
           VALUE  70806494.663622721041917884.
       77  FLD0642B                       PIC  9(09)V9(13) COMP-3
           VALUE  592898946.8504934912118.
       77  FLD0642E                       PIC X  VALUE 'N'.

       77  FLD0643A                       PIC  9(07)V9(01) COMP-6
           VALUE  2194714.9.
       77  FLD0643B                       PIC  9(08)V9(02) COMP-6
           VALUE  26711153.59.
       77  FLD0643E                       PIC X  VALUE 'N'.

       77  FLD0644A                       PIC  9(02)       COMP-6
           VALUE  07.
       77  FLD0644B                       PIC  9(03)V9(32) COMP-6
           VALUE  936.97460492260109532480782945640385.
       77  FLD0644E                       PIC X  VALUE 'N'.

       77  FLD0645A                       PIC  9(03)V9(31) COMP-3
           VALUE  913.1000502995376688630813077907077.
       77  FLD0645B                       PIC  9(07)V9(02) COMP-6
           VALUE  2467302.34.
       77  FLD0645E                       PIC X  VALUE 'N'.

       77  FLD0646A                       PIC  9(07)V9(21) COMP-3
           VALUE  7520596.805608434909373727350.
       77  FLD0646B                       PIC  9(09)V9(13) COMP-6
           VALUE  595843790.0187590896550.
       77  FLD0646E                       PIC X  VALUE 'N'.

       77  FLD0647A                       PIC S9(02)       COMP-3
           VALUE -07.
       77  FLD0647B                       PIC  9(09)V9(16) COMP-6
           VALUE  659893156.1456289340839020.
       77  FLD0647E                       PIC X  VALUE 'N'.

       77  FLD0648A                       PIC S9(04)       COMP-3
           VALUE +1149.
       77  FLD0648B                       PIC  9(09)V9(15) COMP-3
           VALUE  634287010.942461315643470.
       77  FLD0648E                       PIC X  VALUE 'N'.

       77  FLD0649A                       PIC  9(07)V9(23) COMP-3
           VALUE  7912687.10466688007798552462190.
       77  FLD0649B                       PIC  9(10)V9(09) COMP-3
           VALUE  5026519944.429308495.
       77  FLD0649E                       PIC X  VALUE 'N'.

       77  FLD0650A                       PIC  9(01)V9(36) COMP-6
           VALUE  9.878734262172308433491707546636462211.
       77  FLD0650B                       PIC  9(09)V9(16) COMP-3
           VALUE  671574601.9768447094833163.
       77  FLD0650E                       PIC X  VALUE 'N'.

       77  FLD0651A                       PIC  9(08)V9(18) COMP-6
           VALUE  69993795.648145529231243244.
       77  FLD0651B                       PIC S9(09)V9(05) COMP-3
           VALUE -390933259.39761.
       77  FLD0651E                       PIC X  VALUE 'N'.

       77  FLD0652A                       PIC  9(05)V9(01) COMP-6
           VALUE  16676.6.
       77  FLD0652B                       PIC S9(07)V9(01) COMP-3
           VALUE +2109381.3.
       77  FLD0652E                       PIC X  VALUE 'N'.

       77  FLD0653A                       PIC  9(09)V9(14) COMP-3
           VALUE  620233215.83922497168828.
       77  FLD0653B                       PIC  9(06)       COMP-6
           VALUE  165087.
       77  FLD0653E                       PIC X  VALUE 'N'.

       77  FLD0654A                       PIC  9(09)V9(15) COMP-6
           VALUE  639337130.284049814932245.
       77  FLD0654B                       PIC  9(08)V9(02) COMP-6
           VALUE  27813223.51.
       77  FLD0654E                       PIC X  VALUE 'N'.

       77  FLD0655A                       PIC  9(06)V9(25) COMP-6
           VALUE  818013.3890362937254536745967925.
       77  FLD0655B                       PIC  9(09)V9(13) COMP-3
           VALUE  594166317.4495728227952.
       77  FLD0655E                       PIC X  VALUE 'N'.

       77  FLD0656A                       PIC S9(06)V9(01) COMP-3
           VALUE +200859.7.
       77  FLD0656B                       PIC  9(09)V9(15) COMP-3
           VALUE  650208537.267117914204561.
       77  FLD0656E                       PIC X  VALUE 'N'.

       77  FLD0657A                       PIC  9(03)V9(32) COMP-6
           VALUE  936.17194619070143168926279031438753.
       77  FLD0657B                       PIC  9(08)V9(18) COMP-3
           VALUE  70468283.988380520099781278.
       77  FLD0657E                       PIC X  VALUE 'N'.

       77  FLD0658A                       PIC  9(08)V9(18) COMP-3
           VALUE  70069365.832955088357891781.
       77  FLD0658B                       PIC  9(10)V9(10) COMP-3
           VALUE  5438086690.5335789596.
       77  FLD0658E                       PIC X  VALUE 'N'.

       77  FLD0659A                       PIC  9(04)V9(30) COMP-3
           VALUE  9044.337793801533464943531726021319.
       77  FLD0659B                       PIC  9(08)V9(19) COMP-6
           VALUE  71946522.3294514011342926096.
       77  FLD0659E                       PIC X  VALUE 'N'.

       77  FLD0660A                       PIC  9(10)V9(09) COMP-3
           VALUE  5240012407.843260833.
       77  FLD0660B                       PIC S9(05)       COMP-3
           VALUE -15464.
       77  FLD0660E                       PIC X  VALUE 'N'.

       77  FLD0661A                       PIC  9(02)V9(34) COMP-6
           VALUE  96.5581569624071600621562083688331767.
       77  FLD0661B                       PIC  9(10)V9(11) COMP-3
           VALUE  5705409453.15247127744.
       77  FLD0661E                       PIC X  VALUE 'N'.

       77  FLD0662A                       PIC S9(07)V9(01) COMP-3
           VALUE +2131985.0.
       77  FLD0662B                       PIC  9(09)V9(16) COMP-6
           VALUE  669960203.6476681732324323.
       77  FLD0662E                       PIC X  VALUE 'N'.

       77  FLD0663A                       PIC  9(05)       COMP-6
           VALUE  15788.
       77  FLD0663B                       PIC  9(04)V9(29) COMP-6
           VALUE  8894.69232052811142885673234559362.
       77  FLD0663E                       PIC X  VALUE 'N'.

       77  FLD0664A                       PIC S9(05)       COMP-3
           VALUE +14371.
       77  FLD0664B                       PIC S9(09)V9(07) COMP-3
           VALUE +440580330.5288489.
       77  FLD0664E                       PIC X  VALUE 'N'.

       77  FLD0665A                       PIC  9(07)V9(02) COMP-6
           VALUE  2455875.37.
       77  FLD0665B                       PIC  9(09)V9(16) COMP-3
           VALUE  674160289.5706166886924393.
       77  FLD0665E                       PIC X  VALUE 'N'.

       77  FLD0666A                       PIC  9(05)V9(27) COMP-3
           VALUE  86015.549175288641414738322055200.
       77  FLD0666B                       PIC  9(02)       COMP-6
           VALUE  05.
       77  FLD0666E                       PIC X  VALUE 'N'.

       77  FLD0667A                       PIC  9(02)V9(33) COMP-3
           VALUE  94.482499794694274619644147605868056.
       77  FLD0667B                       PIC  9(09)V9(15) COMP-3
           VALUE  632143875.790169951223163.
       77  FLD0667E                       PIC X  VALUE 'N'.

       77  FLD0668A                       PIC  9(03)V9(32) COMP-6
           VALUE  935.15331845029669999291854765033349.
       77  FLD0668B                       PIC  9(10)V9(09) COMP-3
           VALUE  5144629393.825745911.
       77  FLD0668E                       PIC X  VALUE 'N'.

       77  FLD0669A                       PIC  9(01)V9(36) COMP-3
           VALUE  9.937328225295053441001869032334070652.
       77  FLD0669B                       PIC  9(10)V9(05) COMP-6
           VALUE  3959366397.86081.
       77  FLD0669E                       PIC X  VALUE 'N'.

       77  FLD0670A                       PIC  9(07)V9(02) COMP-6
           VALUE  2567113.54.
       77  FLD0670B                       PIC  9(02)V9(34) COMP-3
           VALUE  97.1019073438902258210703166696475818.
       77  FLD0670E                       PIC X  VALUE 'N'.

       77  FLD0671A                       PIC  9(09)V9(03) COMP-6
           VALUE  326622169.718.
       77  FLD0671B                       PIC  9(06)V9(01) COMP-6
           VALUE  186874.6.
       77  FLD0671E                       PIC X  VALUE 'N'.

       77  FLD0672A                       PIC  9(10)V9(07) COMP-6
           VALUE  4564917934.3294549.
       77  FLD0672B                       PIC  9(09)V9(15) COMP-6
           VALUE  637002039.815689924395769.
       77  FLD0672E                       PIC X  VALUE 'N'.

       77  FLD0673A                       PIC  9(10)V9(06) COMP-6
           VALUE  4285002333.462958.
       77  FLD0673B                       PIC  9(07)V9(02) COMP-6
           VALUE  2489778.77.
       77  FLD0673E                       PIC X  VALUE 'N'.

       77  FLD0674A                       PIC  9(10)V9(10) COMP-6
           VALUE  5491650640.0821929467.
       77  FLD0674B                       PIC  9(06)V9(25) COMP-6
           VALUE  828061.3110769976525915581078152.
       77  FLD0674E                       PIC X  VALUE 'N'.

       77  FLD0675A                       PIC  9(05)V9(27) COMP-6
           VALUE  84609.285471017914304070473008323.
       77  FLD0675B                       PIC  9(10)V9(09) COMP-6
           VALUE  5083540664.870341840.
       77  FLD0675E                       PIC X  VALUE 'N'.

       77  FLD0676A                       PIC  9(03)       COMP-6
           VALUE  096.
       77  FLD0676B                       PIC  9(02)V9(34) COMP-3
           VALUE  96.4664170342459437179627457226160913.
       77  FLD0676E                       PIC X  VALUE 'N'.

       77  FLD0677A                       PIC S9(07)V9(01) COMP-3
           VALUE +2248183.1.
       77  FLD0677B                       PIC  9(04)V9(29) COMP-3
           VALUE  8903.66445455624266891447859961772.
       77  FLD0677E                       PIC X  VALUE 'N'.

       77  FLD0678A                       PIC S9(03)       COMP-3
           VALUE -092.
       77  FLD0678B                       PIC  9(05)V9(27) COMP-6
           VALUE  85887.366357613359468814451247453.
       77  FLD0678E                       PIC X  VALUE 'N'.

       77  FLD0679A                       PIC S9(03)       COMP-3
           VALUE -080.
       77  FLD0679B                       PIC  9(10)V9(07) COMP-6
           VALUE  4490278235.6612852.
       77  FLD0679E                       PIC X  VALUE 'N'.

       77  FLD0680A                       PIC S9(08)V9(02) COMP-3
           VALUE -28119381.66.
       77  FLD0680B                       PIC  9(10)V9(11) COMP-3
           VALUE  5617591008.16083600804.
       77  FLD0680E                       PIC X  VALUE 'N'.

       77  FLD0681A                       PIC  9(08)V9(17) COMP-3
           VALUE  68244115.95644890304868113.
       77  FLD0681B                       PIC  9(06)V9(25) COMP-3
           VALUE  821371.7547801553386932482681004.
       77  FLD0681E                       PIC X  VALUE 'N'.

       77  FLD0682A                       PIC S9(10)V9(08) COMP-3
           VALUE -4949729784.45772315.
       77  FLD0682B                       PIC  9(06)V9(25) COMP-3
           VALUE  831097.0812489861803129542749957.
       77  FLD0682E                       PIC X  VALUE 'N'.

       77  FLD0683A                       PIC  9(05)V9(28) COMP-6
           VALUE  86894.3068817851549390240961656672.
       77  FLD0683B                       PIC  9(10)V9(12) COMP-3
           VALUE  5829735573.963021888488.
       77  FLD0683E                       PIC X  VALUE 'N'.

       77  FLD0684A                       PIC  9(10)V9(13) COMP-6
           VALUE  6059233373.6406744915115.
       77  FLD0684B                       PIC  9(09)V9(07) COMP-6
           VALUE  438339473.7646870.
       77  FLD0684E                       PIC X  VALUE 'N'.

       77  FLD0685A                       PIC S9(07)V9(02) COMP-3
           VALUE -2545714.99.
       77  FLD0685B                       PIC  9(07)V9(23) COMP-3
           VALUE  7915567.03876752143500539204978.
       77  FLD0685E                       PIC X  VALUE 'N'.

       77  FLD0686A                       PIC  9(09)V9(14) COMP-3
           VALUE  621044693.11257093355749.
       77  FLD0686B                       PIC  9(09)V9(13) COMP-3
           VALUE  602970496.8531952591348.
       77  FLD0686E                       PIC X  VALUE 'N'.

       77  FLD0687A                       PIC S9(09)V9(05) COMP-3
           VALUE -394005874.76898.
       77  FLD0687B                       PIC  9(10)V9(08) COMP-6
           VALUE  4960980508.03440715.
       77  FLD0687E                       PIC X  VALUE 'N'.

       77  FLD0688A                       PIC  9(03)V9(32) COMP-3
           VALUE  932.26844955554755145499257196206599.
       77  FLD0688B                       PIC  9(04)       COMP-6
           VALUE  1064.
       77  FLD0688E                       PIC X  VALUE 'N'.

       77  FLD0689A                       PIC  9(10)V9(07) COMP-6
           VALUE  4559306991.4341932.
       77  FLD0689B                       PIC S9(08)V9(04) COMP-3
           VALUE +34024840.8710.
       77  FLD0689E                       PIC X  VALUE 'N'.

       77  FLD0690A                       PIC  9(01)V9(36) COMP-6
           VALUE  9.793660005922469879990899244148749858.
       77  FLD0690B                       PIC S9(08)V9(02) COMP-3
           VALUE -28078949.75.
       77  FLD0690E                       PIC X  VALUE 'N'.

       77  FLD0691A                       PIC  9(09)V9(07) COMP-6
           VALUE  439500550.5938089.
       77  FLD0691B                       PIC S9(10)V9(06) COMP-3
           VALUE +4308484639.535531.
       77  FLD0691E                       PIC X  VALUE 'N'.

       77  FLD0692A                       PIC  9(09)V9(04) COMP-6
           VALUE  358382577.7464.
       77  FLD0692B                       PIC  9(09)V9(15) COMP-6
           VALUE  636450165.553045121846764.
       77  FLD0692E                       PIC X  VALUE 'N'.

       77  FLD0693A                       PIC S9(07)V9(01) COMP-3
           VALUE +2127399.6.
       77  FLD0693B                       PIC S9(01)       COMP-3
           VALUE -0.
       77  FLD0693E                       PIC X  VALUE 'N'.

       77  FLD0694A                       PIC  9(09)V9(05) COMP-6
           VALUE  378019656.01658.
       77  FLD0694B                       PIC  9(01)       COMP-6
           VALUE  0.
       77  FLD0694E                       PIC X  VALUE 'N'.

       77  FLD0695A                       PIC S9(09)V9(04) COMP-3
           VALUE -354304867.1111.
       77  FLD0695B                       PIC  9(09)V9(15) COMP-6
           VALUE  639721730.127885357397587.
       77  FLD0695E                       PIC X  VALUE 'N'.

       77  FLD0696A                       PIC  9(04)V9(30) COMP-6
           VALUE  9067.945209731629319094281527213752.
       77  FLD0696B                       PIC  9(09)V9(03) COMP-6
           VALUE  318871778.848.
       77  FLD0696E                       PIC X  VALUE 'N'.

       77  FLD0697A                       PIC S9(09)V9(06) COMP-3
           VALUE +414586353.841170.
       77  FLD0697B                       PIC  9(10)V9(09) COMP-6
           VALUE  5161837194.897523906.
       77  FLD0697E                       PIC X  VALUE 'N'.

       77  FLD0698A                       PIC  9(08)V9(18) COMP-3
           VALUE  69447533.832122987362822641.
       77  FLD0698B                       PIC S9(03)       COMP-3
           VALUE -080.
       77  FLD0698E                       PIC X  VALUE 'N'.

       77  FLD0699A                       PIC  9(09)V9(13) COMP-6
           VALUE  597064952.5204202445749.
       77  FLD0699B                       PIC  9(09)V9(14) COMP-3
           VALUE  630288401.27729701681147.
       77  FLD0699E                       PIC X  VALUE 'N'.

       77  FLD0700A                       PIC  9(06)V9(25) COMP-3
           VALUE  820234.3139012789885455845251271.
       77  FLD0700B                       PIC S9(01)       COMP-3
           VALUE -0.
       77  FLD0700E                       PIC X  VALUE 'N'.

       77  FLD0701A                       PIC  9(06)V9(24) COMP-6
           VALUE  809485.363390515577641792788199.
       77  FLD0701B                       PIC  9(02)V9(34) COMP-3
           VALUE  97.0800419877562270620785511709982529.
       77  FLD0701E                       PIC X  VALUE 'N'.

       77  FLD0702A                       PIC  9(04)V9(30) COMP-3
           VALUE  9021.848589518318695112952809722628.
       77  FLD0702B                       PIC  9(07)V9(01) COMP-6
           VALUE  2351439.7.
       77  FLD0702E                       PIC X  VALUE 'N'.

       77  FLD0703A                       PIC S9(04)       COMP-3
           VALUE +1126.
       77  FLD0703B                       PIC  9(08)V9(04) COMP-6
           VALUE  33525578.1235.
       77  FLD0703E                       PIC X  VALUE 'N'.

       77  FLD0704A                       PIC  9(10)V9(07) COMP-6
           VALUE  4696322933.5995404.
       77  FLD0704B                       PIC  9(09)V9(14) COMP-3
           VALUE  611168884.71092423174013.
       77  FLD0704E                       PIC X  VALUE 'N'.

       77  FLD0705A                       PIC  9(10)V9(10) COMP-6
           VALUE  5381864238.0664638569.
       77  FLD0705B                       PIC  9(10)V9(07) COMP-6
           VALUE  4699950479.7278301.
       77  FLD0705E                       PIC X  VALUE 'N'.

       77  FLD0706A                       PIC  9(07)V9(22) COMP-3
           VALUE  7815442.4104873465584120140192.
       77  FLD0706B                       PIC S9(05)V9(01) COMP-3
           VALUE -17297.4.
       77  FLD0706E                       PIC X  VALUE 'N'.

       77  FLD0707A                       PIC  9(01)       COMP-6
           VALUE  0.
       77  FLD0707B                       PIC  9(10)V9(09) COMP-3
           VALUE  5129442198.407349051.
       77  FLD0707E                       PIC X  VALUE 'N'.

       77  FLD0708A                       PIC  9(02)V9(34) COMP-3
           VALUE  95.1225570140109555339336111501324921.
       77  FLD0708B                       PIC  9(08)V9(04) COMP-6
           VALUE  33834894.3169.
       77  FLD0708E                       PIC X  VALUE 'N'.

       77  FLD0709A                       PIC S9(04)       COMP-3
           VALUE +1124.
       77  FLD0709B                       PIC  9(09)V9(05) COMP-6
           VALUE  379344826.68404.
       77  FLD0709E                       PIC X  VALUE 'N'.

       77  FLD0710A                       PIC  9(01)V9(36) COMP-3
           VALUE  9.946833086486408515014545628218911588.
       77  FLD0710B                       PIC S9(09)V9(03) COMP-3
           VALUE +322996298.459.
       77  FLD0710E                       PIC X  VALUE 'N'.

       77  FLD0711A                       PIC  9(09)V9(16) COMP-6
           VALUE  677754067.1912668512888444.
       77  FLD0711B                       PIC  9(02)       COMP-6
           VALUE  06.
       77  FLD0711E                       PIC X  VALUE 'N'.

       77  FLD0712A                       PIC  9(09)V9(14) COMP-3
           VALUE  610433230.32745544498567.
       77  FLD0712B                       PIC S9(10)V9(08) COMP-3
           VALUE -4947392148.88603839.
       77  FLD0712E                       PIC X  VALUE 'N'.

       77  FLD0713A                       PIC S9(08)V9(03) COMP-3
           VALUE -29280564.557.
       77  FLD0713B                       PIC  9(07)V9(01) COMP-6
           VALUE  2168463.7.
       77  FLD0713E                       PIC X  VALUE 'N'.

       77  FLD0714A                       PIC  9(10)V9(07) COMP-6
           VALUE  4593980567.3719869.
       77  FLD0714B                       PIC  9(09)V9(04) COMP-6
           VALUE  347385951.5252.
       77  FLD0714E                       PIC X  VALUE 'N'.

       77  FLD0715A                       PIC  9(09)V9(06) COMP-6
           VALUE  406643755.503527.
       77  FLD0715B                       PIC  9(10)V9(10) COMP-6
           VALUE  5480282475.3098877685.
       77  FLD0715E                       PIC X  VALUE 'N'.

       77  FLD0716A                       PIC S9(08)V9(03) COMP-3
           VALUE -29497495.128.
       77  FLD0716B                       PIC  9(03)V9(31) COMP-3
           VALUE  914.3056916239737930141018296126276.
       77  FLD0716E                       PIC X  VALUE 'N'.

       77  FLD0717A                       PIC  9(05)V9(28) COMP-6
           VALUE  86936.9843469434133709228262887336.
       77  FLD0717B                       PIC  9(07)V9(21) COMP-6
           VALUE  7570171.861371541854879296806.
       77  FLD0717E                       PIC X  VALUE 'N'.

       77  FLD0718A                       PIC  9(06)       COMP-6
           VALUE  158746.
       77  FLD0718B                       PIC  9(10)V9(06) COMP-6
           VALUE  4283417063.648062.
       77  FLD0718E                       PIC X  VALUE 'N'.

       77  FLD0719A                       PIC  9(01)       COMP-6
           VALUE  0.
       77  FLD0719B                       PIC  9(07)V9(02) COMP-6
           VALUE  2390904.61.
       77  FLD0719E                       PIC X  VALUE 'N'.

       77  FLD0720A                       PIC  9(03)       COMP-6
           VALUE  087.
       77  FLD0720B                       PIC S9(09)V9(06) COMP-3
           VALUE +404886316.426392.
       77  FLD0720E                       PIC X  VALUE 'N'.

       77  FLD0721A                       PIC S9(09)V9(03) COMP-3
           VALUE +332294869.962.
       77  FLD0721B                       PIC  9(07)V9(01) COMP-6
           VALUE  2285954.3.
       77  FLD0721E                       PIC X  VALUE 'N'.

       77  FLD0722A                       PIC S9(05)V9(01) COMP-3
           VALUE -17094.9.
       77  FLD0722B                       PIC  9(07)V9(21) COMP-3
           VALUE  7607809.920924922808538326535.
       77  FLD0722E                       PIC X  VALUE 'N'.

       77  FLD0723A                       PIC  9(05)V9(28) COMP-3
           VALUE  87349.0901765646254872876852459739.
       77  FLD0723B                       PIC  9(02)       COMP-6
           VALUE  07.
       77  FLD0723E                       PIC X  VALUE 'N'.

       77  FLD0724A                       PIC  9(09)V9(03) COMP-6
           VALUE  317474559.928.
       77  FLD0724B                       PIC  9(10)V9(09) COMP-6
           VALUE  5251486411.115240393.
       77  FLD0724E                       PIC X  VALUE 'N'.

       77  FLD0725A                       PIC  9(03)V9(31) COMP-6
           VALUE  915.1169879467740964074096154945436.
       77  FLD0725B                       PIC S9(09)V9(07) COMP-3
           VALUE +444412819.1361023.
       77  FLD0725E                       PIC X  VALUE 'N'.

       77  FLD0726A                       PIC  9(05)       COMP-6
           VALUE  14771.
       77  FLD0726B                       PIC S9(09)V9(06) COMP-3
           VALUE +401835639.675800.
       77  FLD0726E                       PIC X  VALUE 'N'.

       77  FLD0727A                       PIC  9(10)V9(10) COMP-3
           VALUE  5412169008.2113094177.
       77  FLD0727B                       PIC  9(09)V9(16) COMP-6
           VALUE  677439277.9021225496904889.
       77  FLD0727E                       PIC X  VALUE 'N'.

       77  FLD0728A                       PIC  9(09)V9(07) COMP-6
           VALUE  439411444.5456123.
       77  FLD0728B                       PIC S9(09)V9(05) COMP-3
           VALUE -371357711.97684.
       77  FLD0728E                       PIC X  VALUE 'N'.

       77  FLD0729A                       PIC  9(02)V9(33) COMP-6
           VALUE  94.514768998125520127473464526701718.
       77  FLD0729B                       PIC  9(07)V9(23) COMP-6
           VALUE  7959700.26538914909863819957536.
       77  FLD0729E                       PIC X  VALUE 'N'.

       77  FLD0730A                       PIC  9(06)V9(25) COMP-3
           VALUE  822685.8594490329412707296796725.
       77  FLD0730B                       PIC  9(09)V9(14) COMP-3
           VALUE  630270988.23946403616247.
       77  FLD0730E                       PIC X  VALUE 'N'.

       77  FLD0731A                       PIC  9(10)V9(12) COMP-3
           VALUE  5808279049.356201984011.
       77  FLD0731B                       PIC  9(09)V9(13) COMP-3
           VALUE  600372700.6085320949679.
       77  FLD0731E                       PIC X  VALUE 'N'.

       77  FLD0732A                       PIC  9(03)V9(31) COMP-6
           VALUE  915.5080332184045710519626481982413.
       77  FLD0732B                       PIC S9(04)       COMP-3
           VALUE +1229.
       77  FLD0732E                       PIC X  VALUE 'N'.

       77  FLD0733A                       PIC  9(09)V9(03) COMP-6
           VALUE  328019305.824.
       77  FLD0733B                       PIC  9(09)V9(15) COMP-6
           VALUE  637621846.224700750127567.
       77  FLD0733E                       PIC X  VALUE 'N'.

       77  FLD0734A                       PIC S9(06)       COMP-3
           VALUE -164821.
       77  FLD0734B                       PIC  9(02)       COMP-6
           VALUE  05.
       77  FLD0734E                       PIC X  VALUE 'N'.

       77  FLD0735A                       PIC S9(06)V9(01) COMP-3
           VALUE -190229.8.
       77  FLD0735B                       PIC  9(09)V9(15) COMP-3
           VALUE  641899075.827484955070190.
       77  FLD0735E                       PIC X  VALUE 'N'.

       77  FLD0736A                       PIC  9(10)V9(09) COMP-3
           VALUE  5128678158.202983894.
       77  FLD0736B                       PIC  9(07)V9(23) COMP-6
           VALUE  7952260.56216242538354777025233.
       77  FLD0736E                       PIC X  VALUE 'N'.

       77  FLD0737A                       PIC S9(07)V9(02) COMP-3
           VALUE -2601084.10.
       77  FLD0737B                       PIC S9(07)V9(02) COMP-3
           VALUE -2623355.12.
       77  FLD0737E                       PIC X  VALUE 'N'.

       77  FLD0738A                       PIC  9(10)V9(09) COMP-6
           VALUE  5071467647.954436275.
       77  FLD0738B                       PIC  9(02)V9(34) COMP-6
           VALUE  96.7470462418068333221299326396547257.
       77  FLD0738E                       PIC X  VALUE 'N'.

       77  FLD0739A                       PIC S9(09)V9(03) COMP-3
           VALUE +324797211.447.
       77  FLD0739B                       PIC S9(10)V9(08) COMP-3
           VALUE -4916417996.38161292.
       77  FLD0739E                       PIC X  VALUE 'N'.

       77  FLD0740A                       PIC S9(08)V9(03) COMP-3
           VALUE +30394739.303.
       77  FLD0740B                       PIC  9(05)V9(28) COMP-3
           VALUE  87461.9397808273024708114462555386.
       77  FLD0740E                       PIC X  VALUE 'N'.

       77  FLD0741A                       PIC S9(09)V9(03) COMP-3
           VALUE +322386723.831.
       77  FLD0741B                       PIC S9(09)V9(03) COMP-3
           VALUE +321782512.880.
       77  FLD0741E                       PIC X  VALUE 'N'.

       77  FLD0742A                       PIC  9(09)V9(06) COMP-6
           VALUE  419367234.713135.
       77  FLD0742B                       PIC S9(08)V9(03) COMP-3
           VALUE +30468212.851.
       77  FLD0742E                       PIC X  VALUE 'N'.

       77  FLD0743A                       PIC  9(05)V9(27) COMP-6
           VALUE  85864.867305029812794003873932524.
       77  FLD0743B                       PIC  9(06)V9(01) COMP-6
           VALUE  209820.2.
       77  FLD0743E                       PIC X  VALUE 'N'.

       77  FLD0744A                       PIC  9(01)       COMP-6
           VALUE  0.
       77  FLD0744B                       PIC  9(08)V9(02) COMP-6
           VALUE  26956228.79.
       77  FLD0744E                       PIC X  VALUE 'N'.

       77  FLD0745A                       PIC  9(01)V9(36) COMP-6
           VALUE  9.759709501186564217789509712019935250.
       77  FLD0745B                       PIC  9(05)       COMP-6
           VALUE  13548.
       77  FLD0745E                       PIC X  VALUE 'N'.

       77  FLD0746A                       PIC  9(10)V9(10) COMP-3
           VALUE  5435731573.3552813430.
       77  FLD0746B                       PIC  9(10)V9(09) COMP-3
           VALUE  5204204473.599284286.
       77  FLD0746E                       PIC X  VALUE 'N'.

       77  FLD0747A                       PIC  9(10)V9(11) COMP-6
           VALUE  5681676571.07930934579.
       77  FLD0747B                       PIC  9(03)V9(31) COMP-6
           VALUE  916.9159297409485986918298294767737.
       77  FLD0747E                       PIC X  VALUE 'N'.

       77  FLD0748A                       PIC  9(03)       COMP-6
           VALUE  086.
       77  FLD0748B                       PIC S9(05)V9(01) COMP-3
           VALUE -18032.7.
       77  FLD0748E                       PIC X  VALUE 'N'.

       77  FLD0749A                       PIC S9(10)V9(07) COMP-3
           VALUE -4609096560.3942379.
       77  FLD0749B                       PIC  9(06)V9(25) COMP-3
           VALUE  820519.2560948625368766329302161.
       77  FLD0749E                       PIC X  VALUE 'N'.

       77  FLD0750A                       PIC  9(07)V9(22) COMP-6
           VALUE  7666736.3171436386792834127845.
       77  FLD0750B                       PIC  9(08)V9(04) COMP-6
           VALUE  33966692.5145.
       77  FLD0750E                       PIC X  VALUE 'N'.

       77  FLD0751A                       PIC  9(02)       COMP-6
           VALUE  06.
       77  FLD0751B                       PIC S9(05)       COMP-3
           VALUE -15176.
       77  FLD0751E                       PIC X  VALUE 'N'.

       77  FLD0752A                       PIC  9(02)       COMP-6
           VALUE  07.
       77  FLD0752B                       PIC  9(03)V9(32) COMP-3
           VALUE  922.38508268330654527034084821934811.
       77  FLD0752E                       PIC X  VALUE 'N'.

       77  FLD0753A                       PIC  9(08)V9(19) COMP-3
           VALUE  73379118.3872512742247806727.
       77  FLD0753B                       PIC S9(01)       COMP-3
           VALUE +0.
       77  FLD0753E                       PIC X  VALUE 'N'.

       77  FLD0754A                       PIC S9(09)V9(03) COMP-3
           VALUE +322061792.108.
       77  FLD0754B                       PIC  9(07)V9(02) COMP-6
           VALUE  2450066.21.
       77  FLD0754E                       PIC X  VALUE 'N'.

       77  FLD0755A                       PIC  9(06)V9(25) COMP-6
           VALUE  835592.8333445592492978448717622.
       77  FLD0755B                       PIC  9(10)V9(10) COMP-3
           VALUE  5346301002.0417645051.
       77  FLD0755E                       PIC X  VALUE 'N'.

       77  FLD0756A                       PIC  9(09)V9(04) COMP-6
           VALUE  366295057.8421.
       77  FLD0756B                       PIC S9(05)       COMP-3
           VALUE -15366.
       77  FLD0756E                       PIC X  VALUE 'N'.

       77  FLD0757A                       PIC  9(08)V9(19) COMP-3
           VALUE  71466976.1113856494283425035.
       77  FLD0757B                       PIC S9(07)V9(02) COMP-3
           VALUE +2429438.31.
       77  FLD0757E                       PIC X  VALUE 'N'.

       77  FLD0758A                       PIC  9(07)V9(01) COMP-6
           VALUE  2293699.9.
       77  FLD0758B                       PIC S9(06)       COMP-3
           VALUE -162229.
       77  FLD0758E                       PIC X  VALUE 'N'.

       77  FLD0759A                       PIC  9(03)V9(32) COMP-3
           VALUE  931.38963166127219928114300273591652.
       77  FLD0759B                       PIC  9(07)V9(21) COMP-3
           VALUE  7621303.882836163445801958005.
       77  FLD0759E                       PIC X  VALUE 'N'.

       77  FLD0760A                       PIC  9(06)V9(01) COMP-6
           VALUE  188511.3.
       77  FLD0760B                       PIC  9(04)V9(30) COMP-3
           VALUE  9041.413390221895163278986728982999.
       77  FLD0760E                       PIC X  VALUE 'N'.

       77  FLD0761A                       PIC  9(09)V9(17) COMP-3
           VALUE  690006529.44346418937726639.
       77  FLD0761B                       PIC  9(09)V9(14) COMP-6
           VALUE  629261290.31917010792085.
       77  FLD0761E                       PIC X  VALUE 'N'.

       77  FLD0762A                       PIC  9(09)V9(16) COMP-3
           VALUE  671435372.9957326377686399.
       77  FLD0762B                       PIC  9(07)V9(02) COMP-6
           VALUE  2591343.61.
       77  FLD0762E                       PIC X  VALUE 'N'.

       77  FLD0763A                       PIC  9(08)V9(19) COMP-3
           VALUE  71468145.3175585401638159055.
       77  FLD0763B                       PIC  9(06)V9(24) COMP-6
           VALUE  815545.608346078032546699887461.
       77  FLD0763E                       PIC X  VALUE 'N'.

       77  FLD0764A                       PIC  9(10)V9(11) COMP-3
           VALUE  5535007698.50315821329.
       77  FLD0764B                       PIC  9(10)V9(08) COMP-6
           VALUE  4979398183.62831021.
       77  FLD0764E                       PIC X  VALUE 'N'.

       77  FLD0765A                       PIC  9(04)V9(29) COMP-6
           VALUE  8855.80582773889624093044403707608.
       77  FLD0765B                       PIC S9(04)       COMP-3
           VALUE +1212.
       77  FLD0765E                       PIC X  VALUE 'N'.

       77  FLD0766A                       PIC S9(01)       COMP-3
           VALUE +0.
       77  FLD0766B                       PIC  9(07)V9(01) COMP-6
           VALUE  2294943.2.
       77  FLD0766E                       PIC X  VALUE 'N'.

       77  FLD0767A                       PIC S9(10)V9(08) COMP-3
           VALUE -4848285740.27346248.
       77  FLD0767B                       PIC S9(01)       COMP-3
           VALUE +0.
       77  FLD0767E                       PIC X  VALUE 'N'.

       77  FLD0768A                       PIC  9(09)V9(17) COMP-3
           VALUE  684230789.92735519854306858.
       77  FLD0768B                       PIC S9(02)       COMP-3
           VALUE -07.
       77  FLD0768E                       PIC X  VALUE 'N'.

       77  FLD0769A                       PIC  9(07)V9(02) COMP-6
           VALUE  2565731.27.
       77  FLD0769B                       PIC  9(09)V9(04) COMP-6
           VALUE  356094054.4649.
       77  FLD0769E                       PIC X  VALUE 'N'.

       77  FLD0770A                       PIC  9(09)V9(12) COMP-3
           VALUE  574214303.174467532997.
       77  FLD0770B                       PIC  9(10)V9(13) COMP-6
           VALUE  6057194691.9895736094474.
       77  FLD0770E                       PIC X  VALUE 'N'.

       77  FLD0771A                       PIC  9(08)V9(18) COMP-6
           VALUE  69721614.519732855175249142.
       77  FLD0771B                       PIC  9(09)V9(17) COMP-3
           VALUE  690190375.47148320843604096.
       77  FLD0771E                       PIC X  VALUE 'N'.

       77  FLD0772A                       PIC  9(10)V9(08) COMP-6
           VALUE  4868623585.10471993.
       77  FLD0772B                       PIC  9(10)V9(05) COMP-6
           VALUE  3959689116.24786.
       77  FLD0772E                       PIC X  VALUE 'N'.

       77  FLD0773A                       PIC S9(07)V9(01) COMP-3
           VALUE +2339835.9.
       77  FLD0773B                       PIC  9(03)V9(32) COMP-3
           VALUE  931.93997423560348547511011929600499.
       77  FLD0773E                       PIC X  VALUE 'N'.

       77  FLD0774A                       PIC  9(01)       COMP-6
           VALUE  0.
       77  FLD0774B                       PIC S9(07)V9(02) COMP-3
           VALUE +2425891.04.
       77  FLD0774E                       PIC X  VALUE 'N'.

       77  FLD0775A                       PIC  9(09)V9(06) COMP-6
           VALUE  418947899.183504.
       77  FLD0775B                       PIC  9(03)V9(32) COMP-3
           VALUE  930.87735098341006789723905967548489.
       77  FLD0775E                       PIC X  VALUE 'N'.

       77  FLD0776A                       PIC  9(09)V9(06) COMP-6
           VALUE  418950765.017868.
       77  FLD0776B                       PIC  9(05)V9(27) COMP-6
           VALUE  84781.081485203291236985023715533.
       77  FLD0776E                       PIC X  VALUE 'N'.

       77  FLD0777A                       PIC S9(08)V9(03) COMP-3
           VALUE +31438250.184.
       77  FLD0777B                       PIC  9(10)V9(11) COMP-3
           VALUE  5606560858.83416754889.
       77  FLD0777E                       PIC X  VALUE 'N'.

       77  FLD0778A                       PIC S9(06)V9(01) COMP-3
           VALUE -192739.4.
       77  FLD0778B                       PIC  9(03)V9(31) COMP-6
           VALUE  916.8465464730475300569878527312539.
       77  FLD0778E                       PIC X  VALUE 'N'.

       77  FLD0779A                       PIC  9(04)V9(30) COMP-3
           VALUE  9029.333248069044692840634525055065.
       77  FLD0779B                       PIC S9(10)V9(08) COMP-3
           VALUE -4740907582.59428035.
       77  FLD0779E                       PIC X  VALUE 'N'.

       77  FLD0780A                       PIC  9(09)V9(03) COMP-6
           VALUE  318241207.749.
       77  FLD0780B                       PIC  9(06)V9(25) COMP-3
           VALUE  822759.6235369002419801631731388.
       77  FLD0780E                       PIC X  VALUE 'N'.

       77  FLD0781A                       PIC  9(10)V9(08) COMP-6
           VALUE  4967153543.73054196.
       77  FLD0781B                       PIC  9(08)V9(03) COMP-6
           VALUE  29720911.669.
       77  FLD0781E                       PIC X  VALUE 'N'.

       77  FLD0782A                       PIC  9(05)       COMP-6
           VALUE  13793.
       77  FLD0782B                       PIC  9(02)V9(34) COMP-6
           VALUE  95.5158015091007617236584792408393695.
       77  FLD0782E                       PIC X  VALUE 'N'.

       77  FLD0783A                       PIC  9(04)V9(29) COMP-3
           VALUE  8813.39219378433402773964644438819.
       77  FLD0783B                       PIC S9(10)V9(06) COMP-3
           VALUE +4236433759.282261.
       77  FLD0783E                       PIC X  VALUE 'N'.

       77  FLD0784A                       PIC  9(09)V9(15) COMP-3
           VALUE  641964802.793786426526878.
       77  FLD0784B                       PIC  9(06)V9(25) COMP-3
           VALUE  824637.3935062285553954097849782.
       77  FLD0784E                       PIC X  VALUE 'N'.

       77  FLD0785A                       PIC  9(08)V9(17) COMP-3
           VALUE  68097654.34600172362422654.
       77  FLD0785B                       PIC  9(09)V9(03) COMP-6
           VALUE  325202869.704.
       77  FLD0785E                       PIC X  VALUE 'N'.

       77  FLD0786A                       PIC  9(01)V9(36) COMP-3
           VALUE  9.820249933224565186407062356011010706.
       77  FLD0786B                       PIC  9(05)V9(27) COMP-3
           VALUE  85417.725929538756979297886573476.
       77  FLD0786E                       PIC X  VALUE 'N'.

       77  FLD0787A                       PIC  9(10)V9(11) COMP-6
           VALUE  5592847098.07636559730.
       77  FLD0787B                       PIC  9(06)V9(01) COMP-6
           VALUE  199330.4.
       77  FLD0787E                       PIC X  VALUE 'N'.

       77  FLD0788A                       PIC  9(02)V9(34) COMP-6
           VALUE  95.6557531637097668841818176588276401.
       77  FLD0788B                       PIC  9(07)V9(22) COMP-6
           VALUE  7789929.3063459995600794627534.
       77  FLD0788E                       PIC X  VALUE 'N'.

       77  FLD0789A                       PIC S9(05)V9(01) COMP-3
           VALUE -17101.7.
       77  FLD0789B                       PIC  9(09)V9(16) COMP-3
           VALUE  660444958.2132847496040994.
       77  FLD0789E                       PIC X  VALUE 'N'.

       77  FLD0790A                       PIC  9(07)V9(02) COMP-6
           VALUE  2384369.54.
       77  FLD0790B                       PIC S9(08)V9(03) COMP-3
           VALUE -29309999.122.
       77  FLD0790E                       PIC X  VALUE 'N'.

       77  FLD0791A                       PIC  9(03)       COMP-6
           VALUE  088.
       77  FLD0791B                       PIC  9(08)V9(20) COMP-6
           VALUE  73827325.48868294886190710712.
       77  FLD0791E                       PIC X  VALUE 'N'.

       77  FLD0792A                       PIC  9(02)V9(34) COMP-6
           VALUE  95.5230059106088935649836457741912454.
       77  FLD0792B                       PIC  9(09)V9(05) COMP-6
           VALUE  379824535.06313.
       77  FLD0792E                       PIC X  VALUE 'N'.

       77  FLD0793A                       PIC  9(06)V9(01) COMP-6
           VALUE  199221.9.
       77  FLD0793B                       PIC  9(10)V9(11) COMP-6
           VALUE  5591577156.30166807230.
       77  FLD0793E                       PIC X  VALUE 'N'.

       77  FLD0794A                       PIC S9(08)V9(04) COMP-3
           VALUE +33437009.5807.
       77  FLD0794B                       PIC S9(01)       COMP-3
           VALUE -0.
       77  FLD0794E                       PIC X  VALUE 'N'.

       77  FLD0795A                       PIC S9(01)       COMP-3
           VALUE +0.
       77  FLD0795B                       PIC S9(08)V9(04) COMP-3
           VALUE +33494400.6958.
       77  FLD0795E                       PIC X  VALUE 'N'.

       77  FLD0796A                       PIC  9(07)V9(21) COMP-6
           VALUE  7565685.006144580171394409262.
       77  FLD0796B                       PIC  9(08)V9(19) COMP-6
           VALUE  72949831.5977354816475042298.
       77  FLD0796E                       PIC X  VALUE 'N'.

       77  FLD0797A                       PIC  9(01)       COMP-6
           VALUE  0.
       77  FLD0797B                       PIC  9(09)V9(04) COMP-6
           VALUE  348777486.0252.
       77  FLD0797E                       PIC X  VALUE 'N'.

       77  FLD0798A                       PIC S9(09)V9(03) COMP-3
           VALUE +332243375.906.
       77  FLD0798B                       PIC  9(09)V9(16) COMP-3
           VALUE  673821443.1439371043808250.
       77  FLD0798E                       PIC X  VALUE 'N'.

       77  FLD0799A                       PIC  9(09)V9(17) COMP-3
           VALUE  690866271.33683375934225523.
       77  FLD0799B                       PIC  9(09)V9(11) COMP-3
           VALUE  551526790.74963362193.
       77  FLD0799E                       PIC X  VALUE 'N'.

       77  FLD0800A                       PIC  9(08)V9(18) COMP-3
           VALUE  70036112.416705975647346349.
       77  FLD0800B                       PIC  9(08)V9(02) COMP-6
           VALUE  26662512.18.
       77  FLD0800E                       PIC X  VALUE 'N'.

       77  FLD0801A                       PIC S9(09)V9(07) COMP-3
           VALUE +443093279.8052367.
       77  FLD0801B                       PIC  9(01)V9(36) COMP-3
           VALUE  9.827967002397862694706986985693220049.
       77  FLD0801E                       PIC X  VALUE 'N'.

       77  FLD0802A                       PIC S9(07)V9(02) COMP-3
           VALUE +2449505.23.
       77  FLD0802B                       PIC  9(04)V9(29) COMP-3
           VALUE  8911.32090012832223102634543465683.
       77  FLD0802E                       PIC X  VALUE 'N'.

       77  FLD0803A                       PIC S9(05)V9(01) COMP-3
           VALUE -17467.0.
       77  FLD0803B                       PIC  9(10)V9(11) COMP-6
           VALUE  5556247901.99399698487.
       77  FLD0803E                       PIC X  VALUE 'N'.

       77  FLD0804A                       PIC  9(07)V9(02) COMP-6
           VALUE  2599541.84.
       77  FLD0804B                       PIC  9(01)       COMP-6
           VALUE  0.
       77  FLD0804E                       PIC X  VALUE 'N'.

       77  FLD0805A                       PIC  9(07)V9(01) COMP-6
           VALUE  2358341.0.
       77  FLD0805B                       PIC  9(10)V9(08) COMP-6
           VALUE  4796323563.66873291.
       77  FLD0805E                       PIC X  VALUE 'N'.

       77  FLD0806A                       PIC  9(10)V9(11) COMP-3
           VALUE  5703927562.80738821850.
       77  FLD0806B                       PIC  9(09)V9(07) COMP-6
           VALUE  445849105.9648416.
       77  FLD0806E                       PIC X  VALUE 'N'.

       77  FLD0807A                       PIC  9(09)V9(17) COMP-6
           VALUE  689326682.16034242991696601.
       77  FLD0807B                       PIC S9(03)       COMP-3
           VALUE -090.
       77  FLD0807E                       PIC X  VALUE 'N'.

       77  FLD0808A                       PIC  9(01)       COMP-6
           VALUE  0.
       77  FLD0808B                       PIC  9(10)V9(07) COMP-6
           VALUE  4574455047.5690953.
       77  FLD0808E                       PIC X  VALUE 'N'.

       77  FLD0809A                       PIC  9(05)V9(28) COMP-6
           VALUE  86873.4196996681751201663246320094.
       77  FLD0809B                       PIC S9(09)V9(07) COMP-3
           VALUE +440334288.3961999.
       77  FLD0809E                       PIC X  VALUE 'N'.

       77  FLD0810A                       PIC S9(04)       COMP-3
           VALUE +1129.
       77  FLD0810B                       PIC S9(07)V9(01) COMP-3
           VALUE +2130584.0.
       77  FLD0810E                       PIC X  VALUE 'N'.

       77  FLD0811A                       PIC  9(09)V9(15) COMP-6
           VALUE  648943185.643321429623142.
       77  FLD0811B                       PIC  9(01)V9(36) COMP-3
           VALUE  9.811592432324195423021251372119877487.
       77  FLD0811E                       PIC X  VALUE 'N'.

       77  FLD0812A                       PIC S9(08)V9(03) COMP-3
           VALUE -29270905.795.
       77  FLD0812B                       PIC  9(08)V9(02) COMP-6
           VALUE  27514068.39.
       77  FLD0812E                       PIC X  VALUE 'N'.

       77  FLD0813A                       PIC  9(10)V9(08) COMP-6
           VALUE  4881724662.84412076.
       77  FLD0813B                       PIC S9(08)V9(03) COMP-3
           VALUE -29113136.400.
       77  FLD0813E                       PIC X  VALUE 'N'.

       77  FLD0814A                       PIC S9(02)       COMP-3
           VALUE -07.
       77  FLD0814B                       PIC  9(07)V9(21) COMP-3
           VALUE  7525112.595496631362479433846.
       77  FLD0814E                       PIC X  VALUE 'N'.

       77  FLD0815A                       PIC  9(06)V9(25) COMP-6
           VALUE  838676.0467962863785373883729334.
       77  FLD0815B                       PIC  9(02)V9(34) COMP-3
           VALUE  95.3836598694868031955707010638434439.
       77  FLD0815E                       PIC X  VALUE 'N'.

       77  FLD0816A                       PIC  9(08)V9(18) COMP-6
           VALUE  70774184.783492177786001775.
       77  FLD0816B                       PIC  9(04)V9(29) COMP-6
           VALUE  8859.15144904112161761133847903693.
       77  FLD0816E                       PIC X  VALUE 'N'.

       77  FLD0817A                       PIC  9(10)V9(09) COMP-6
           VALUE  5163345142.860672476.
       77  FLD0817B                       PIC  9(10)V9(09) COMP-6
           VALUE  5158922133.304477686.
       77  FLD0817E                       PIC X  VALUE 'N'.

       77  FLD0818A                       PIC  9(08)V9(03) COMP-6
           VALUE  30586164.664.
       77  FLD0818B                       PIC  9(08)V9(19) COMP-6
           VALUE  71565910.0751609544843745425.
       77  FLD0818E                       PIC X  VALUE 'N'.

       77  FLD0819A                       PIC  9(01)V9(36) COMP-3
           VALUE  9.844708607145921108738662042014766484.
       77  FLD0819B                       PIC S9(03)       COMP-3
           VALUE -092.
       77  FLD0819E                       PIC X  VALUE 'N'.

       77  FLD0820A                       PIC  9(01)       COMP-6
           VALUE  0.
       77  FLD0820B                       PIC  9(02)V9(34) COMP-6
           VALUE  95.6537139953218984445015848905313760.
       77  FLD0820E                       PIC X  VALUE 'N'.

       77  FLD0821A                       PIC  9(09)V9(11) COMP-3
           VALUE  550576956.44832715942.
       77  FLD0821B                       PIC S9(09)V9(05) COMP-3
           VALUE -383656536.39422.
       77  FLD0821E                       PIC X  VALUE 'N'.

       77  FLD0822A                       PIC S9(05)       COMP-3
           VALUE +14037.
       77  FLD0822B                       PIC  9(04)       COMP-6
           VALUE  1092.
       77  FLD0822E                       PIC X  VALUE 'N'.

       77  FLD0823A                       PIC  9(08)V9(20) COMP-6
           VALUE  73880168.20028298070610617287.
       77  FLD0823B                       PIC S9(09)V9(06) COMP-3
           VALUE +410430433.569272.
       77  FLD0823E                       PIC X  VALUE 'N'.

       77  FLD0824A                       PIC  9(10)V9(10) COMP-6
           VALUE  5351534260.3280557920.
       77  FLD0824B                       PIC  9(09)V9(14) COMP-6
           VALUE  619637811.24301098301998.
       77  FLD0824E                       PIC X  VALUE 'N'.

       77  FLD0825A                       PIC  9(01)       COMP-6
           VALUE  0.
       77  FLD0825B                       PIC S9(05)V9(01) COMP-3
           VALUE -17069.2.
       77  FLD0825E                       PIC X  VALUE 'N'.

       77  FLD0826A                       PIC S9(06)V9(01) COMP-3
           VALUE -190786.5.
       77  FLD0826B                       PIC S9(10)V9(08) COMP-3
           VALUE -4805976358.59735916.
       77  FLD0826E                       PIC X  VALUE 'N'.

       77  FLD0827A                       PIC  9(07)V9(22) COMP-6
           VALUE  7763847.1978375678261841130733.
       77  FLD0827B                       PIC  9(10)V9(07) COMP-6
           VALUE  4683286251.1747114.
       77  FLD0827E                       PIC X  VALUE 'N'.

       77  FLD0828A                       PIC S9(10)V9(07) COMP-3
           VALUE -4530916009.2405642.
       77  FLD0828B                       PIC S9(05)       COMP-3
           VALUE -15016.
       77  FLD0828E                       PIC X  VALUE 'N'.

       77  FLD0829A                       PIC  9(09)V9(17) COMP-3
           VALUE  691486534.21926165041355716.
       77  FLD0829B                       PIC  9(07)V9(23) COMP-6
           VALUE  7963194.44710118728991687930829.
       77  FLD0829E                       PIC X  VALUE 'N'.

       77  FLD0830A                       PIC  9(04)V9(30) COMP-6
           VALUE  8965.722935126121395654763546190224.
       77  FLD0830B                       PIC  9(10)V9(11) COMP-6
           VALUE  5655358049.53465004452.
       77  FLD0830E                       PIC X  VALUE 'N'.

       77  FLD0831A                       PIC  9(04)V9(30) COMP-6
           VALUE  8956.555580996397036841472072410397.
       77  FLD0831B                       PIC  9(09)V9(16) COMP-3
           VALUE  660284490.9595845246386147.
       77  FLD0831E                       PIC X  VALUE 'N'.

       77  FLD0832A                       PIC  9(04)       COMP-6
           VALUE  1185.
       77  FLD0832B                       PIC  9(09)V9(06) COMP-6
           VALUE  419049138.539795.
       77  FLD0832E                       PIC X  VALUE 'N'.

       77  FLD0833A                       PIC  9(06)V9(24) COMP-3
           VALUE  804859.798300300854911881742737.
       77  FLD0833B                       PIC  9(09)V9(16) COMP-3
           VALUE  664990588.4825918489511309.
       77  FLD0833E                       PIC X  VALUE 'N'.

       77  FLD0834A                       PIC  9(09)V9(04) COMP-6
           VALUE  349209744.2881.
       77  FLD0834B                       PIC  9(08)V9(19) COMP-3
           VALUE  71191898.1740956136050613167.
       77  FLD0834E                       PIC X  VALUE 'N'.

       77  FLD0835A                       PIC  9(08)V9(19) COMP-3
           VALUE  71178359.2779248075466114187.
       77  FLD0835B                       PIC  9(07)V9(22) COMP-6
           VALUE  7891261.8513661014763016510187.
       77  FLD0835E                       PIC X  VALUE 'N'.

       77  FLD0836A                       PIC  9(09)V9(07) COMP-6
           VALUE  446141389.3412962.
       77  FLD0836B                       PIC  9(09)V9(13) COMP-3
           VALUE  594066179.3005866941896.
       77  FLD0836E                       PIC X  VALUE 'N'.

       77  FLD0837A                       PIC  9(04)V9(30) COMP-6
           VALUE  8982.008694278872384941792006429750.
       77  FLD0837B                       PIC S9(08)V9(03) COMP-3
           VALUE -29146758.519.
       77  FLD0837E                       PIC X  VALUE 'N'.

       77  FLD0838A                       PIC  9(10)V9(12) COMP-6
           VALUE  5873188106.793812979233.
       77  FLD0838B                       PIC  9(07)V9(22) COMP-3
           VALUE  7748686.2151072521953665273031.
       77  FLD0838E                       PIC X  VALUE 'N'.

       77  FLD0839A                       PIC  9(08)V9(19) COMP-3
           VALUE  71324671.8649382605015318858.
       77  FLD0839B                       PIC  9(06)V9(01) COMP-6
           VALUE  205379.6.
       77  FLD0839E                       PIC X  VALUE 'N'.

       77  FLD0840A                       PIC S9(03)       COMP-3
           VALUE -094.
       77  FLD0840B                       PIC  9(04)       COMP-6
           VALUE  1059.
       77  FLD0840E                       PIC X  VALUE 'N'.

       77  FLD0841A                       PIC  9(08)V9(18) COMP-3
           VALUE  70179428.042996372383299785.
       77  FLD0841B                       PIC  9(06)V9(24) COMP-3
           VALUE  813553.693586876014443021176703.
       77  FLD0841E                       PIC X  VALUE 'N'.

       77  FLD0842A                       PIC  9(09)V9(16) COMP-3
           VALUE  661649948.5739699704112126.
       77  FLD0842B                       PIC  9(02)V9(33) COMP-6
           VALUE  94.543261545044898763734408930758945.
       77  FLD0842E                       PIC X  VALUE 'N'.

       77  FLD0843A                       PIC  9(06)V9(25) COMP-6
           VALUE  818928.0761087860405211813485948.
       77  FLD0843B                       PIC S9(08)V9(03) COMP-3
           VALUE +30347988.647.
       77  FLD0843E                       PIC X  VALUE 'N'.

       77  FLD0844A                       PIC  9(07)V9(22) COMP-6
           VALUE  7754458.9142564990247308287507.
       77  FLD0844B                       PIC  9(10)V9(07) COMP-6
           VALUE  4487113046.2525055.
       77  FLD0844E                       PIC X  VALUE 'N'.

       77  FLD0845A                       PIC  9(10)V9(12) COMP-3
           VALUE  5903835745.060688200425.
       77  FLD0845B                       PIC  9(09)V9(15) COMP-3
           VALUE  651184321.418812994686220.
       77  FLD0845E                       PIC X  VALUE 'N'.

       77  FLD0846A                       PIC  9(08)V9(03) COMP-6
           VALUE  29802576.878.
       77  FLD0846B                       PIC  9(10)V9(07) COMP-6
           VALUE  4580030325.9646085.
       77  FLD0846E                       PIC X  VALUE 'N'.

       77  FLD0847A                       PIC  9(05)V9(26) COMP-3
           VALUE  84041.42690564196938041163775778.
       77  FLD0847B                       PIC  9(08)V9(03) COMP-6
           VALUE  29618694.346.
       77  FLD0847E                       PIC X  VALUE 'N'.

       77  FLD0848A                       PIC  9(07)V9(23) COMP-3
           VALUE  7949747.62786875510656159349309.
       77  FLD0848B                       PIC  9(08)V9(19) COMP-3
           VALUE  71130247.7845018432667245633.
       77  FLD0848E                       PIC X  VALUE 'N'.

       77  FLD0849A                       PIC  9(09)V9(13) COMP-6
           VALUE  595598045.8961575019216.
       77  FLD0849B                       PIC  9(07)V9(21) COMP-3
           VALUE  7527838.155592773139446194363.
       77  FLD0849E                       PIC X  VALUE 'N'.

       77  FLD0850A                       PIC  9(09)V9(06) COMP-6
           VALUE  418716850.605351.
       77  FLD0850B                       PIC  9(09)V9(15) COMP-3
           VALUE  631787055.454641532925563.
       77  FLD0850E                       PIC X  VALUE 'N'.

       77  FLD0851A                       PIC S9(03)       COMP-3
           VALUE -082.
       77  FLD0851B                       PIC  9(07)V9(01) COMP-6
           VALUE  2252059.3.
       77  FLD0851E                       PIC X  VALUE 'N'.

       77  FLD0852A                       PIC  9(10)V9(11) COMP-3
           VALUE  5643399909.75319838462.
       77  FLD0852B                       PIC  9(08)V9(02) COMP-6
           VALUE  28682579.88.
       77  FLD0852E                       PIC X  VALUE 'N'.

       77  FLD0853A                       PIC  9(06)V9(24) COMP-3
           VALUE  801200.590406665469345171004533.
       77  FLD0853B                       PIC S9(01)       COMP-3
           VALUE +0.
       77  FLD0853E                       PIC X  VALUE 'N'.

       77  FLD0854A                       PIC  9(01)V9(35) COMP-3
           VALUE  9.72377885073923198255840816273121163.
       77  FLD0854B                       PIC  9(01)       COMP-6
           VALUE  0.
       77  FLD0854E                       PIC X  VALUE 'N'.

       77  FLD0855A                       PIC  9(08)V9(19) COMP-6
           VALUE  73562901.0042854747375429269.
       77  FLD0855B                       PIC  9(05)V9(01) COMP-6
           VALUE  16705.4.
       77  FLD0855E                       PIC X  VALUE 'N'.

       77  FLD0856A                       PIC  9(09)V9(04) COMP-6
           VALUE  356144099.6704.
       77  FLD0856B                       PIC S9(05)       COMP-3
           VALUE +13257.
       77  FLD0856E                       PIC X  VALUE 'N'.

       77  FLD0857A                       PIC  9(03)V9(31) COMP-6
           VALUE  915.3286634102202334872799838194623.
       77  FLD0857B                       PIC S9(02)       COMP-3
           VALUE -05.
       77  FLD0857E                       PIC X  VALUE 'N'.

       77  FLD0858A                       PIC  9(10)V9(11) COMP-6
           VALUE  5560594458.08950059131.
       77  FLD0858B                       PIC  9(08)V9(03) COMP-6
           VALUE  30966624.473.
       77  FLD0858E                       PIC X  VALUE 'N'.

       77  FLD0859A                       PIC S9(01)       COMP-3
           VALUE +0.
       77  FLD0859B                       PIC  9(02)V9(34) COMP-3
           VALUE  97.1628168143447767945986015547532588.
       77  FLD0859E                       PIC X  VALUE 'N'.

       77  FLD0860A                       PIC  9(07)V9(02) COMP-6
           VALUE  2576407.94.
       77  FLD0860B                       PIC  9(08)V9(04) COMP-6
           VALUE  33654706.3315.
       77  FLD0860E                       PIC X  VALUE 'N'.

       77  FLD0861A                       PIC S9(10)V9(07) COMP-3
           VALUE -4605509961.3842453.
       77  FLD0861B                       PIC  9(04)       COMP-6
           VALUE  1091.
       77  FLD0861E                       PIC X  VALUE 'N'.

       77  FLD0862A                       PIC  9(07)V9(22) COMP-6
           VALUE  7652464.2157409383802502134130.
       77  FLD0862B                       PIC  9(09)V9(12) COMP-6
           VALUE  576630833.581719182134.
       77  FLD0862E                       PIC X  VALUE 'N'.

       77  FLD0863A                       PIC  9(05)V9(27) COMP-3
           VALUE  85070.091557533766835064170663827.
       77  FLD0863B                       PIC  9(10)V9(09) COMP-6
           VALUE  5171260723.603198217.
       77  FLD0863E                       PIC X  VALUE 'N'.

       77  FLD0864A                       PIC  9(10)V9(11) COMP-3
           VALUE  5711242885.34377577697.
       77  FLD0864B                       PIC  9(04)V9(29) COMP-6
           VALUE  8791.30787212824560405977081245509.
       77  FLD0864E                       PIC X  VALUE 'N'.

       77  FLD0865A                       PIC  9(06)V9(24) COMP-6
           VALUE  807409.725415061507725056344497.
       77  FLD0865B                       PIC S9(03)       COMP-3
           VALUE -082.
       77  FLD0865E                       PIC X  VALUE 'N'.

       77  FLD0866A                       PIC  9(09)V9(05) COMP-6
           VALUE  376060050.51851.
       77  FLD0866B                       PIC  9(04)V9(30) COMP-6
           VALUE  9076.867019798932068042063292523380.
       77  FLD0866E                       PIC X  VALUE 'N'.

       77  FLD0867A                       PIC S9(05)       COMP-3
           VALUE +14084.
       77  FLD0867B                       PIC  9(08)V9(19) COMP-6
           VALUE  72879777.6966572774526298417.
       77  FLD0867E                       PIC X  VALUE 'N'.

       77  FLD0868A                       PIC  9(07)V9(22) COMP-3
           VALUE  7648419.8420910554094831468319.
       77  FLD0868B                       PIC  9(10)V9(12) COMP-3
           VALUE  5849128371.667725589944.
       77  FLD0868E                       PIC X  VALUE 'N'.

       77  FLD0869A                       PIC S9(01)       COMP-3
           VALUE +0.
       77  FLD0869B                       PIC  9(08)V9(17) COMP-3
           VALUE  68157822.06919422936408636.
       77  FLD0869E                       PIC X  VALUE 'N'.

       77  FLD0870A                       PIC S9(01)       COMP-3
           VALUE +0.
       77  FLD0870B                       PIC  9(09)V9(15) COMP-6
           VALUE  657570531.523696821807334.
       77  FLD0870E                       PIC X  VALUE 'N'.

       77  FLD0871A                       PIC  9(09)V9(14) COMP-6
           VALUE  609764683.38536315982878.
       77  FLD0871B                       PIC  9(10)V9(09) COMP-3
           VALUE  5134836781.377033476.
       77  FLD0871E                       PIC X  VALUE 'N'.

       77  FLD0872A                       PIC  9(04)V9(29) COMP-3
           VALUE  8816.31176263962479389135751262074.
       77  FLD0872B                       PIC  9(10)V9(07) COMP-6
           VALUE  4591409950.7884903.
       77  FLD0872E                       PIC X  VALUE 'N'.

       77  FLD0873A                       PIC  9(07)V9(21) COMP-6
           VALUE  7561255.223942077163812314211.
       77  FLD0873B                       PIC  9(05)       COMP-6
           VALUE  15597.
       77  FLD0873E                       PIC X  VALUE 'N'.

       77  FLD0874A                       PIC  9(01)       COMP-6
           VALUE  0.
       77  FLD0874B                       PIC  9(06)V9(01) COMP-6
           VALUE  188106.3.
       77  FLD0874E                       PIC X  VALUE 'N'.

       77  FLD0875A                       PIC S9(06)V9(01) COMP-3
           VALUE +204126.0.
       77  FLD0875B                       PIC  9(02)       COMP-6
           VALUE  06.
       77  FLD0875E                       PIC X  VALUE 'N'.

       77  FLD0876A                       PIC  9(01)       COMP-6
           VALUE  0.
       77  FLD0876B                       PIC  9(07)V9(23) COMP-3
           VALUE  7928238.87607293276147402139031.
       77  FLD0876E                       PIC X  VALUE 'N'.

       77  FLD0877A                       PIC  9(08)V9(18) COMP-6
           VALUE  69924605.886404200827399790.
       77  FLD0877B                       PIC  9(09)V9(15) COMP-3
           VALUE  651975862.412979334514773.
       77  FLD0877E                       PIC X  VALUE 'N'.

       77  FLD0878A                       PIC  9(07)V9(22) COMP-3
           VALUE  7831260.9220719830993573395971.
       77  FLD0878B                       PIC  9(04)V9(29) COMP-3
           VALUE  8832.64528360225620318146866338793.
       77  FLD0878E                       PIC X  VALUE 'N'.

       77  FLD0879A                       PIC  9(07)V9(02) COMP-6
           VALUE  2371533.81.
       77  FLD0879B                       PIC  9(05)V9(27) COMP-3
           VALUE  85230.962794591269560129376259283.
       77  FLD0879E                       PIC X  VALUE 'N'.

       77  FLD0880A                       PIC S9(10)V9(06) COMP-3
           VALUE +4237732309.742536.
       77  FLD0880B                       PIC  9(05)V9(26) COMP-6
           VALUE  83915.37539577657023315282458497.
       77  FLD0880E                       PIC X  VALUE 'N'.

       77  FLD0881A                       PIC  9(10)V9(11) COMP-6
           VALUE  5571129514.90407404264.
       77  FLD0881B                       PIC S9(09)V9(04) COMP-3
           VALUE -360610120.1846.
       77  FLD0881E                       PIC X  VALUE 'N'.

       77  FLD0882A                       PIC  9(10)V9(12) COMP-6
           VALUE  5888713345.878072713546.
       77  FLD0882B                       PIC  9(09)V9(16) COMP-6
           VALUE  677832951.8186110291821933.
       77  FLD0882E                       PIC X  VALUE 'N'.

       77  FLD0883A                       PIC  9(09)V9(16) COMP-3
           VALUE  672192258.1526228457349247.
       77  FLD0883B                       PIC  9(07)V9(21) COMP-6
           VALUE  7561874.624389478549701948395.
       77  FLD0883E                       PIC X  VALUE 'N'.

       77  FLD0884A                       PIC  9(10)V9(08) COMP-6
           VALUE  4954020911.85092596.
       77  FLD0884B                       PIC  9(07)V9(21) COMP-3
           VALUE  7530519.818486510752464369033.
       77  FLD0884E                       PIC X  VALUE 'N'.

       77  FLD0885A                       PIC S9(05)       COMP-3
           VALUE +13360.
       77  FLD0885B                       PIC S9(05)       COMP-3
           VALUE -15432.
       77  FLD0885E                       PIC X  VALUE 'N'.

       77  FLD0886A                       PIC S9(09)V9(05) COMP-3
           VALUE -374529584.88504.
       77  FLD0886B                       PIC S9(09)V9(05) COMP-3
           VALUE -380480275.58811.
       77  FLD0886E                       PIC X  VALUE 'N'.

       77  FLD0887A                       PIC S9(07)V9(01) COMP-3
           VALUE +2114795.5.
       77  FLD0887B                       PIC  9(06)V9(25) COMP-6
           VALUE  815821.3018675709582439026235078.
       77  FLD0887E                       PIC X  VALUE 'N'.

       77  FLD0888A                       PIC  9(08)V9(19) COMP-6
           VALUE  73580519.1914812417586233550.
       77  FLD0888B                       PIC  9(07)V9(02) COMP-6
           VALUE  2394446.18.
       77  FLD0888E                       PIC X  VALUE 'N'.

       77  FLD0889A                       PIC S9(05)       COMP-3
           VALUE -15225.
       77  FLD0889B                       PIC  9(02)V9(34) COMP-3
           VALUE  96.3719675610497206186266794247785583.
       77  FLD0889E                       PIC X  VALUE 'N'.

       77  FLD0890A                       PIC S9(01)       COMP-3
           VALUE +0.
       77  FLD0890B                       PIC  9(08)V9(19) COMP-3
           VALUE  72161358.3480198661490589984.
       77  FLD0890E                       PIC X  VALUE 'N'.

       77  FLD0891A                       PIC  9(02)V9(34) COMP-6
           VALUE  95.7956124985634538404610793804749846.
       77  FLD0891B                       PIC  9(08)V9(19) COMP-6
           VALUE  73526985.6204998628612656830.
       77  FLD0891E                       PIC X  VALUE 'N'.

       77  FLD0892A                       PIC  9(10)V9(09) COMP-6
           VALUE  5079027644.377075434.
       77  FLD0892B                       PIC  9(03)       COMP-6
           VALUE  088.
       77  FLD0892E                       PIC X  VALUE 'N'.

       77  FLD0893A                       PIC  9(10)V9(12) COMP-3
           VALUE  5900775083.003402254888.
       77  FLD0893B                       PIC  9(02)       COMP-6
           VALUE  07.
       77  FLD0893E                       PIC X  VALUE 'N'.

       77  FLD0894A                       PIC  9(06)V9(25) COMP-6
           VALUE  819872.1409522375935807758651208.
       77  FLD0894B                       PIC  9(09)V9(15) COMP-6
           VALUE  655129000.141700390535959.
       77  FLD0894E                       PIC X  VALUE 'N'.

       77  FLD0895A                       PIC  9(10)V9(09) COMP-6
           VALUE  5099949658.575000377.
       77  FLD0895B                       PIC  9(08)V9(02) COMP-6
           VALUE  28944204.51.
       77  FLD0895E                       PIC X  VALUE 'N'.

       77  FLD0896A                       PIC  9(10)V9(07) COMP-6
           VALUE  4576511370.6787369.
       77  FLD0896B                       PIC S9(01)       COMP-3
           VALUE +0.
       77  FLD0896E                       PIC X  VALUE 'N'.

       77  FLD0897A                       PIC  9(01)V9(36) COMP-6
           VALUE  9.997543976245016894566219889384228736.
       77  FLD0897B                       PIC S9(09)V9(07) COMP-3
           VALUE +440492210.0858147.
       77  FLD0897E                       PIC X  VALUE 'N'.

       77  FLD0898A                       PIC  9(09)V9(05) COMP-6
           VALUE  378033726.09171.
       77  FLD0898B                       PIC  9(06)V9(01) COMP-6
           VALUE  199374.1.
       77  FLD0898E                       PIC X  VALUE 'N'.

       77  FLD0899A                       PIC  9(08)V9(20) COMP-6
           VALUE  74918436.40783237834313013081.
       77  FLD0899B                       PIC  9(09)V9(07) COMP-6
           VALUE  438142184.6749312.
       77  FLD0899E                       PIC X  VALUE 'N'.

       77  FLD0900A                       PIC  9(03)V9(32) COMP-6
           VALUE  929.41329164379282712360463847289793.
       77  FLD0900B                       PIC  9(06)V9(01) COMP-6
           VALUE  185639.8.
       77  FLD0900E                       PIC X  VALUE 'N'.

       77  FLD0901A                       PIC  9(10)V9(07) COMP-6
           VALUE  4563598931.5070740.
       77  FLD0901B                       PIC  9(01)V9(36) COMP-6
           VALUE  9.782322298369796609307513790554367005.
       77  FLD0901E                       PIC X  VALUE 'N'.

       77  FLD0902A                       PIC  9(05)V9(28) COMP-3
           VALUE  87405.6741908566081633580324705690.
       77  FLD0902B                       PIC  9(10)V9(09) COMP-3
           VALUE  5131137190.755751253.
       77  FLD0902E                       PIC X  VALUE 'N'.

       77  FLD0903A                       PIC  9(08)V9(02) COMP-6
           VALUE  28616952.10.
       77  FLD0903B                       PIC S9(02)       COMP-3
           VALUE -06.
       77  FLD0903E                       PIC X  VALUE 'N'.

       77  FLD0904A                       PIC S9(04)       COMP-3
           VALUE +1137.
       77  FLD0904B                       PIC S9(01)       COMP-3
           VALUE -0.
       77  FLD0904E                       PIC X  VALUE 'N'.

       77  FLD0905A                       PIC  9(09)V9(04) COMP-6
           VALUE  357938124.4724.
       77  FLD0905B                       PIC  9(09)V9(04) COMP-6
           VALUE  349599231.9688.
       77  FLD0905E                       PIC X  VALUE 'N'.

       77  FLD0906A                       PIC  9(09)V9(16) COMP-6
           VALUE  669388906.6218295935684068.
       77  FLD0906B                       PIC  9(01)       COMP-6
           VALUE  0.
       77  FLD0906E                       PIC X  VALUE 'N'.

       77  FLD0907A                       PIC S9(09)V9(05) COMP-3
           VALUE -390800584.69506.
       77  FLD0907B                       PIC  9(10)V9(11) COMP-6
           VALUE  5692874702.16027324809.
       77  FLD0907E                       PIC X  VALUE 'N'.

       77  FLD0908A                       PIC S9(10)V9(06) COMP-3
           VALUE +4306350776.286586.
       77  FLD0908B                       PIC  9(03)V9(31) COMP-3
           VALUE  912.0472776451683527554337160836439.
       77  FLD0908E                       PIC X  VALUE 'N'.

       77  FLD0909A                       PIC  9(08)V9(03) COMP-6
           VALUE  30663800.453.
       77  FLD0909B                       PIC  9(01)       COMP-6
           VALUE  0.
       77  FLD0909E                       PIC X  VALUE 'N'.

       77  FLD0910A                       PIC S9(06)V9(01) COMP-3
           VALUE -193158.9.
       77  FLD0910B                       PIC  9(04)V9(30) COMP-6
           VALUE  9098.433765600096867487422969134058.
       77  FLD0910E                       PIC X  VALUE 'N'.

       77  FLD0911A                       PIC S9(10)V9(07) COMP-3
           VALUE -4611964452.0728980.
       77  FLD0911B                       PIC  9(08)V9(20) COMP-3
           VALUE  74305071.04102702653491974160.
       77  FLD0911E                       PIC X  VALUE 'N'.

       77  FLD0912A                       PIC  9(10)V9(09) COMP-3
           VALUE  5000191930.396378214.
       77  FLD0912B                       PIC  9(01)       COMP-6
           VALUE  0.
       77  FLD0912E                       PIC X  VALUE 'N'.

       77  FLD0913A                       PIC S9(04)       COMP-3
           VALUE +1246.
       77  FLD0913B                       PIC  9(03)       COMP-6
           VALUE  079.
       77  FLD0913E                       PIC X  VALUE 'N'.

       77  FLD0914A                       PIC  9(03)V9(31) COMP-6
           VALUE  917.2012666333545505281676923914346.
       77  FLD0914B                       PIC  9(01)V9(36) COMP-3
           VALUE  9.801144784183424274459639491396956145.
       77  FLD0914E                       PIC X  VALUE 'N'.

       77  FLD0915A                       PIC  9(08)V9(20) COMP-6
           VALUE  74750906.49492384109464637731.
       77  FLD0915B                       PIC S9(04)       COMP-3
           VALUE +1130.
       77  FLD0915E                       PIC X  VALUE 'N'.

       77  FLD0916A                       PIC S9(01)       COMP-3
           VALUE +0.
       77  FLD0916B                       PIC  9(10)V9(06) COMP-6
           VALUE  4372777685.598984.
       77  FLD0916E                       PIC X  VALUE 'N'.

       77  FLD0917A                       PIC  9(01)       COMP-6
           VALUE  0.
       77  FLD0917B                       PIC  9(04)       COMP-6
           VALUE  1084.
       77  FLD0917E                       PIC X  VALUE 'N'.

       77  FLD0918A                       PIC  9(04)       COMP-6
           VALUE  1059.
       77  FLD0918B                       PIC  9(10)V9(11) COMP-6
           VALUE  5693106161.94893204244.
       77  FLD0918E                       PIC X  VALUE 'N'.

       77  FLD0919A                       PIC S9(02)       COMP-3
           VALUE -06.
       77  FLD0919B                       PIC S9(01)       COMP-3
           VALUE +0.
       77  FLD0919E                       PIC X  VALUE 'N'.

       77  FLD0920A                       PIC S9(05)V9(01) COMP-3
           VALUE -17474.9.
       77  FLD0920B                       PIC  9(09)V9(16) COMP-6
           VALUE  669843285.3658151664433262.
       77  FLD0920E                       PIC X  VALUE 'N'.

       77  FLD0921A                       PIC  9(10)V9(10) COMP-6
           VALUE  5463494999.0456427304.
       77  FLD0921B                       PIC S9(01)       COMP-3
           VALUE +0.
       77  FLD0921E                       PIC X  VALUE 'N'.

       77  FLD0922A                       PIC S9(01)       COMP-3
           VALUE +0.
       77  FLD0922B                       PIC S9(05)V9(01) COMP-3
           VALUE -18331.8.
       77  FLD0922E                       PIC X  VALUE 'N'.

       77  FLD0923A                       PIC  9(06)       COMP-6
           VALUE  159582.
       77  FLD0923B                       PIC S9(04)       COMP-3
           VALUE +1310.
       77  FLD0923E                       PIC X  VALUE 'N'.

       77  FLD0924A                       PIC  9(10)V9(11) COMP-6
           VALUE  5650505738.70210182114.
       77  FLD0924B                       PIC  9(06)V9(25) COMP-3
           VALUE  830413.4742864166529585645548650.
       77  FLD0924E                       PIC X  VALUE 'N'.

       77  FLD0925A                       PIC S9(04)       COMP-3
           VALUE +1236.
       77  FLD0925B                       PIC S9(01)       COMP-3
           VALUE +0.
       77  FLD0925E                       PIC X  VALUE 'N'.

       77  FLD0926A                       PIC  9(08)V9(18) COMP-6
           VALUE  69535643.175280814620720093.
       77  FLD0926B                       PIC S9(07)V9(02) COMP-3
           VALUE -2533128.95.
       77  FLD0926E                       PIC X  VALUE 'N'.

       77  FLD0927A                       PIC  9(06)V9(24) COMP-3
           VALUE  800954.558131814597921049880824.
       77  FLD0927B                       PIC  9(10)V9(09) COMP-3
           VALUE  5121064754.192180545.
       77  FLD0927E                       PIC X  VALUE 'N'.

       77  FLD0928A                       PIC  9(01)       COMP-6
           VALUE  0.
       77  FLD0928B                       PIC  9(07)V9(02) COMP-6
           VALUE  2551694.92.
       77  FLD0928E                       PIC X  VALUE 'N'.

       77  FLD0929A                       PIC  9(05)V9(28) COMP-3
           VALUE  87174.0739403786824013309342262800.
       77  FLD0929B                       PIC  9(08)V9(19) COMP-3
           VALUE  71306594.2354483839338286088.
       77  FLD0929E                       PIC X  VALUE 'N'.

       77  FLD0930A                       PIC  9(01)V9(36) COMP-3
           VALUE  9.911281003002671008417223674769047647.
       77  FLD0930B                       PIC  9(09)V9(13) COMP-3
           VALUE  591594874.8305130955316.
       77  FLD0930E                       PIC X  VALUE 'N'.

       77  FLD0931A                       PIC  9(09)V9(12) COMP-3
           VALUE  573747057.720371378408.
       77  FLD0931B                       PIC S9(07)V9(02) COMP-3
           VALUE -2503283.13.
       77  FLD0931E                       PIC X  VALUE 'N'.

       77  FLD0932A                       PIC  9(10)V9(09) COMP-6
           VALUE  5079506475.355934913.
       77  FLD0932B                       PIC  9(10)V9(09) COMP-6
           VALUE  5196217943.575858200.
       77  FLD0932E                       PIC X  VALUE 'N'.

       77  FLD0933A                       PIC  9(07)V9(22) COMP-6
           VALUE  7776883.1704294028028812135744.
       77  FLD0933B                       PIC  9(09)V9(03) COMP-6
           VALUE  328435728.864.
       77  FLD0933E                       PIC X  VALUE 'N'.

       77  FLD0934A                       PIC  9(05)V9(01) COMP-6
           VALUE  16899.6.
       77  FLD0934B                       PIC  9(07)V9(02) COMP-6
           VALUE  2394400.51.
       77  FLD0934E                       PIC X  VALUE 'N'.

       77  FLD0935A                       PIC  9(05)V9(01) COMP-6
           VALUE  16691.2.
       77  FLD0935B                       PIC  9(10)V9(08) COMP-6
           VALUE  4853829665.64275264.
       77  FLD0935E                       PIC X  VALUE 'N'.

       77  FLD0936A                       PIC  9(08)V9(03) COMP-6
           VALUE  29560937.131.
       77  FLD0936B                       PIC  9(02)V9(34) COMP-3
           VALUE  95.2998853185021421730027668672846630.
       77  FLD0936E                       PIC X  VALUE 'N'.

       77  FLD0937A                       PIC  9(02)V9(33) COMP-3
           VALUE  94.462893191714936147462822191300801.
       77  FLD0937B                       PIC  9(01)       COMP-6
           VALUE  0.
       77  FLD0937E                       PIC X  VALUE 'N'.

       77  FLD0938A                       PIC  9(09)V9(12) COMP-6
           VALUE  578242437.999430092254.
       77  FLD0938B                       PIC  9(08)V9(18) COMP-6
           VALUE  70721875.972746128802270959.
       77  FLD0938E                       PIC X  VALUE 'N'.

       77  FLD0939A                       PIC  9(10)V9(13) COMP-6
           VALUE  6084884727.3780637401330.
       77  FLD0939B                       PIC S9(01)       COMP-3
           VALUE -0.
       77  FLD0939E                       PIC X  VALUE 'N'.

       77  FLD0940A                       PIC  9(09)V9(12) COMP-6
           VALUE  577997061.609985873786.
       77  FLD0940B                       PIC  9(10)V9(08) COMP-6
           VALUE  4780052522.48498546.
       77  FLD0940E                       PIC X  VALUE 'N'.

       77  FLD0941A                       PIC  9(09)V9(16) COMP-3
           VALUE  670449367.9367865555107641.
       77  FLD0941B                       PIC  9(09)V9(04) COMP-6
           VALUE  345028332.3540.
       77  FLD0941E                       PIC X  VALUE 'N'.

       77  FLD0942A                       PIC  9(10)V9(10) COMP-3
           VALUE  5309347867.8071082121.
       77  FLD0942B                       PIC  9(03)V9(32) COMP-3
           VALUE  922.70492697630424050458941565011627.
       77  FLD0942E                       PIC X  VALUE 'N'.

       77  FLD0943A                       PIC S9(09)V9(03) COMP-3
           VALUE +323766798.919.
       77  FLD0943B                       PIC S9(06)V9(01) COMP-3
           VALUE +203018.6.
       77  FLD0943E                       PIC X  VALUE 'N'.

       77  FLD0944A                       PIC  9(02)V9(34) COMP-6
           VALUE  95.7363239628727824559462078468641266.
       77  FLD0944B                       PIC S9(07)V9(02) COMP-3
           VALUE -2600465.21.
       77  FLD0944E                       PIC X  VALUE 'N'.

       77  FLD0945A                       PIC  9(10)V9(10) COMP-3
           VALUE  5427766423.1255295934.
       77  FLD0945B                       PIC S9(10)V9(06) COMP-3
           VALUE +4211785767.712989.
       77  FLD0945E                       PIC X  VALUE 'N'.

       77  FLD0946A                       PIC S9(07)V9(02) COMP-3
           VALUE -2603132.30.
       77  FLD0946B                       PIC  9(02)V9(34) COMP-3
           VALUE  96.2407519811451561686510558502050116.
       77  FLD0946E                       PIC X  VALUE 'N'.

       77  FLD0947A                       PIC  9(05)V9(27) COMP-6
           VALUE  85846.989065825540787812997223227.
       77  FLD0947B                       PIC  9(09)V9(16) COMP-3
           VALUE  671942080.3697424560141371.
       77  FLD0947E                       PIC X  VALUE 'N'.

       77  FLD0948A                       PIC  9(04)       COMP-6
           VALUE  1058.
       77  FLD0948B                       PIC  9(07)V9(21) COMP-6
           VALUE  7582594.805549627281493485497.
       77  FLD0948E                       PIC X  VALUE 'N'.

       77  FLD0949A                       PIC S9(10)V9(06) COMP-3
           VALUE +4307044196.647341.
       77  FLD0949B                       PIC  9(10)V9(07) COMP-6
           VALUE  4670230467.6696332.
       77  FLD0949E                       PIC X  VALUE 'N'.

       77  FLD0950A                       PIC  9(09)V9(14) COMP-3
           VALUE  614898523.03850200954116.
       77  FLD0950B                       PIC  9(04)V9(30) COMP-6
           VALUE  9056.465512238127679722765606129541.
       77  FLD0950E                       PIC X  VALUE 'N'.

       77  FLD0951A                       PIC S9(08)V9(03) COMP-3
           VALUE +31116955.475.
       77  FLD0951B                       PIC  9(08)V9(20) COMP-6
           VALUE  74599134.92992847894313968026.
       77  FLD0951E                       PIC X  VALUE 'N'.

       77  FLD0952A                       PIC  9(09)V9(03) COMP-6
           VALUE  315844571.317.
       77  FLD0952B                       PIC  9(02)       COMP-6
           VALUE  06.
       77  FLD0952E                       PIC X  VALUE 'N'.

       77  FLD0953A                       PIC  9(06)       COMP-6
           VALUE  166635.
       77  FLD0953B                       PIC  9(10)V9(09) COMP-6
           VALUE  5187782319.462912461.
       77  FLD0953E                       PIC X  VALUE 'N'.

       77  FLD0954A                       PIC  9(10)V9(11) COMP-6
           VALUE  5577123049.60128579800.
       77  FLD0954B                       PIC  9(02)V9(34) COMP-3
           VALUE  97.0603521071659591790137255884474143.
       77  FLD0954E                       PIC X  VALUE 'N'.

       77  FLD0955A                       PIC S9(08)V9(02) COMP-3
           VALUE -27357789.23.
       77  FLD0955B                       PIC  9(06)V9(25) COMP-3
           VALUE  823687.4590304759102821208216482.
       77  FLD0955E                       PIC X  VALUE 'N'.

       77  FLD0956A                       PIC S9(08)V9(02) COMP-3
           VALUE -27355040.84.
       77  FLD0956B                       PIC  9(08)V9(18) COMP-3
           VALUE  70029518.862281070479269828.
       77  FLD0956E                       PIC X  VALUE 'N'.

       77  FLD0957A                       PIC  9(09)V9(15) COMP-6
           VALUE  637627083.330792543414133.
       77  FLD0957B                       PIC S9(04)       COMP-3
           VALUE +1212.
       77  FLD0957E                       PIC X  VALUE 'N'.

       77  FLD0958A                       PIC S9(08)V9(03) COMP-3
           VALUE -29370744.150.
       77  FLD0958B                       PIC  9(10)V9(06) COMP-6
           VALUE  4358178846.720288.
       77  FLD0958E                       PIC X  VALUE 'N'.

       77  FLD0959A                       PIC  9(06)V9(25) COMP-6
           VALUE  827211.6833605048791255853757320.
       77  FLD0959B                       PIC S9(01)       COMP-3
           VALUE +0.
       77  FLD0959E                       PIC X  VALUE 'N'.

       77  FLD0960A                       PIC  9(10)V9(11) COMP-6
           VALUE  5559976801.18206716315.
       77  FLD0960B                       PIC S9(01)       COMP-3
           VALUE +0.
       77  FLD0960E                       PIC X  VALUE 'N'.

       77  FLD0961A                       PIC  9(08)V9(19) COMP-6
           VALUE  72708740.7191407630868695832.
       77  FLD0961B                       PIC S9(04)       COMP-3
           VALUE +1315.
       77  FLD0961E                       PIC X  VALUE 'N'.

       77  FLD0962A                       PIC  9(02)V9(34) COMP-6
           VALUE  96.8081984946274620718043024680810049.
       77  FLD0962B                       PIC  9(08)V9(17) COMP-3
           VALUE  68265700.44059103725686554.
       77  FLD0962E                       PIC X  VALUE 'N'.

       77  FLD0963A                       PIC  9(01)V9(36) COMP-3
           VALUE  9.803573230667260718362854277074802666.
       77  FLD0963B                       PIC  9(09)V9(16) COMP-6
           VALUE  657950850.8072698935720268.
       77  FLD0963E                       PIC X  VALUE 'N'.

       77  FLD0964A                       PIC  9(09)V9(15) COMP-6
           VALUE  639504907.969730918004813.
       77  FLD0964B                       PIC  9(09)V9(13) COMP-6
           VALUE  599568613.7680703575725.
       77  FLD0964E                       PIC X  VALUE 'N'.

       77  FLD0965A                       PIC  9(05)       COMP-6
           VALUE  13581.
       77  FLD0965B                       PIC  9(01)       COMP-6
           VALUE  0.
       77  FLD0965E                       PIC X  VALUE 'N'.

       77  FLD0966A                       PIC  9(06)V9(01) COMP-6
           VALUE  189200.6.
       77  FLD0966B                       PIC  9(06)V9(01) COMP-6
           VALUE  189757.7.
       77  FLD0966E                       PIC X  VALUE 'N'.

       77  FLD0967A                       PIC  9(02)       COMP-6
           VALUE  06.
       77  FLD0967B                       PIC  9(09)V9(04) COMP-6
           VALUE  356045641.3147.
       77  FLD0967E                       PIC X  VALUE 'N'.

       77  FLD0968A                       PIC  9(09)V9(15) COMP-6
           VALUE  649996663.320669743058033.
       77  FLD0968B                       PIC S9(04)       COMP-3
           VALUE +1132.
       77  FLD0968E                       PIC X  VALUE 'N'.

       77  FLD0969A                       PIC S9(05)       COMP-3
           VALUE -15366.
       77  FLD0969B                       PIC  9(09)V9(13) COMP-3
           VALUE  594539058.0989867723715.
       77  FLD0969E                       PIC X  VALUE 'N'.

       77  FLD0970A                       PIC  9(09)V9(14) COMP-3
           VALUE  631417540.20798013247173.
       77  FLD0970B                       PIC  9(02)V9(34) COMP-6
           VALUE  96.8862081091470539462306987843476235.
       77  FLD0970E                       PIC X  VALUE 'N'.

       77  FLD0971A                       PIC  9(07)V9(01) COMP-6
           VALUE  2161446.9.
       77  FLD0971B                       PIC S9(09)V9(06) COMP-3
           VALUE +400705169.115322.
       77  FLD0971E                       PIC X  VALUE 'N'.

       77  FLD0972A                       PIC  9(09)V9(15) COMP-6
           VALUE  647710182.878484586055378.
       77  FLD0972B                       PIC  9(05)       COMP-6
           VALUE  13649.
       77  FLD0972E                       PIC X  VALUE 'N'.

       77  FLD0973A                       PIC  9(05)       COMP-6
           VALUE  13817.
       77  FLD0973B                       PIC  9(06)V9(25) COMP-6
           VALUE  828260.5282429751358819203232997.
       77  FLD0973E                       PIC X  VALUE 'N'.

       77  FLD0974A                       PIC  9(04)       COMP-6
           VALUE  1180.
       77  FLD0974B                       PIC S9(03)       COMP-3
           VALUE +104.
       77  FLD0974E                       PIC X  VALUE 'N'.

       77  FLD0975A                       PIC S9(02)       COMP-3
           VALUE -06.
       77  FLD0975B                       PIC  9(09)V9(03) COMP-6
           VALUE  329183580.054.
       77  FLD0975E                       PIC X  VALUE 'N'.

       77  FLD0976A                       PIC S9(07)V9(01) COMP-3
           VALUE +2206144.7.
       77  FLD0976B                       PIC  9(10)V9(09) COMP-6
           VALUE  5191401776.232426046.
       77  FLD0976E                       PIC X  VALUE 'N'.

       77  FLD0977A                       PIC  9(09)V9(03) COMP-6
           VALUE  327431372.704.
       77  FLD0977B                       PIC S9(09)V9(05) COMP-3
           VALUE -393208707.80387.
       77  FLD0977E                       PIC X  VALUE 'N'.

       77  FLD0978A                       PIC  9(09)V9(16) COMP-6
           VALUE  675062190.8116747338368668.
       77  FLD0978B                       PIC S9(09)V9(06) COMP-3
           VALUE +411411057.685845.
       77  FLD0978E                       PIC X  VALUE 'N'.

       77  FLD0979A                       PIC  9(03)V9(32) COMP-6
           VALUE  925.33169671466619643496187563869170.
       77  FLD0979B                       PIC  9(09)V9(05) COMP-6
           VALUE  388509802.38797.
       77  FLD0979E                       PIC X  VALUE 'N'.

       77  FLD0980A                       PIC  9(03)V9(32) COMP-6
           VALUE  935.82234581280043794748735308530740.
       77  FLD0980B                       PIC  9(09)V9(15) COMP-6
           VALUE  647159992.565670250108667.
       77  FLD0980E                       PIC X  VALUE 'N'.

       77  FLD0981A                       PIC  9(06)V9(01) COMP-6
           VALUE  195132.7.
       77  FLD0981B                       PIC S9(09)V9(04) COMP-3
           VALUE -360473610.9762.
       77  FLD0981E                       PIC X  VALUE 'N'.

       77  FLD0982A                       PIC  9(06)V9(25) COMP-6
           VALUE  816610.1728260642955703474399342.
       77  FLD0982B                       PIC S9(08)V9(03) COMP-3
           VALUE +31469845.616.
       77  FLD0982E                       PIC X  VALUE 'N'.

       77  FLD0983A                       PIC  9(10)V9(09) COMP-3
           VALUE  5114754992.436914005.
       77  FLD0983B                       PIC  9(02)V9(34) COMP-6
           VALUE  95.8147071945383510538363225350622087.
       77  FLD0983E                       PIC X  VALUE 'N'.

       77  FLD0984A                       PIC  9(09)V9(15) COMP-3
           VALUE  632949921.330981046807551.
       77  FLD0984B                       PIC  9(10)V9(09) COMP-6
           VALUE  5090793805.153389639.
       77  FLD0984E                       PIC X  VALUE 'N'.

       77  FLD0985A                       PIC  9(10)V9(06) COMP-6
           VALUE  4296662473.303992.
       77  FLD0985B                       PIC  9(05)V9(28) COMP-3
           VALUE  87137.5808353749947698929645412135.
       77  FLD0985E                       PIC X  VALUE 'N'.

       77  FLD0986A                       PIC  9(05)       COMP-6
           VALUE  14588.
       77  FLD0986B                       PIC  9(01)       COMP-6
           VALUE  0.
       77  FLD0986E                       PIC X  VALUE 'N'.

       77  FLD0987A                       PIC  9(01)V9(36) COMP-3
           VALUE  9.834402345123109956404050535638816654.
       77  FLD0987B                       PIC  9(06)V9(26) COMP-3
           VALUE  842525.10302045313661523096016026.
       77  FLD0987E                       PIC X  VALUE 'N'.

       77  FLD0988A                       PIC  9(01)       COMP-6
           VALUE  0.
       77  FLD0988B                       PIC S9(05)V9(01) COMP-3
           VALUE -18152.0.
       77  FLD0988E                       PIC X  VALUE 'N'.

       77  FLD0989A                       PIC S9(04)       COMP-3
           VALUE +1235.
       77  FLD0989B                       PIC  9(09)V9(13) COMP-3
           VALUE  593212782.9792923634499.
       77  FLD0989E                       PIC X  VALUE 'N'.

       77  FLD0990A                       PIC  9(07)V9(22) COMP-3
           VALUE  7806084.0781040319313888176111.
       77  FLD0990B                       PIC  9(06)V9(01) COMP-6
           VALUE  208986.1.
       77  FLD0990E                       PIC X  VALUE 'N'.

       77  FLD0991A                       PIC  9(06)V9(24) COMP-6
           VALUE  807774.663029880435338725419569.
       77  FLD0991B                       PIC S9(09)V9(06) COMP-3
           VALUE +403465254.324070.
       77  FLD0991E                       PIC X  VALUE 'N'.

       77  FLD0992A                       PIC  9(07)V9(22) COMP-6
           VALUE  7784108.2583169551867285917978.
       77  FLD0992B                       PIC  9(04)V9(29) COMP-3
           VALUE  8920.19846678347883006665597349638.
       77  FLD0992E                       PIC X  VALUE 'N'.

       77  FLD0993A                       PIC  9(08)V9(20) COMP-6
           VALUE  74534466.64416291111976420324.
       77  FLD0993B                       PIC S9(04)       COMP-3
           VALUE +1132.
       77  FLD0993E                       PIC X  VALUE 'N'.

       77  FLD0994A                       PIC  9(06)V9(24) COMP-6
           VALUE  815107.307501011568717785849003.
       77  FLD0994B                       PIC S9(10)V9(08) COMP-3
           VALUE -4847118976.22432053.
       77  FLD0994E                       PIC X  VALUE 'N'.

       77  FLD0995A                       PIC S9(01)       COMP-3
           VALUE +0.
       77  FLD0995B                       PIC  9(06)V9(01) COMP-6
           VALUE  188825.8.
       77  FLD0995E                       PIC X  VALUE 'N'.

       77  FLD0996A                       PIC  9(09)V9(14) COMP-6
           VALUE  619241405.61761309431432.
       77  FLD0996B                       PIC  9(09)V9(16) COMP-6
           VALUE  669751940.2443259384227758.
       77  FLD0996E                       PIC X  VALUE 'N'.

       77  FLD0997A                       PIC  9(10)V9(09) COMP-3
           VALUE  5006446394.611311356.
       77  FLD0997B                       PIC  9(10)V9(09) COMP-3
           VALUE  5005353152.147143935.
       77  FLD0997E                       PIC X  VALUE 'N'.

       77  FLD0998A                       PIC  9(09)V9(13) COMP-6
           VALUE  598229443.4201559374386.
       77  FLD0998B                       PIC S9(01)       COMP-3
           VALUE +0.
       77  FLD0998E                       PIC X  VALUE 'N'.

       77  FLD0999A                       PIC S9(03)       COMP-3
           VALUE -081.
       77  FLD0999B                       PIC S9(01)       COMP-3
           VALUE -0.
       77  FLD0999E                       PIC X  VALUE 'N'.

      * RESULTS-AREA.

       78  XPC-FLD0500B
           VALUE X'0708'.
       78  XPC-FLD0500E          VALUE 'N'.
       78  XPC-FLD0501B
           VALUE X'062809334873677369337485'.
       78  XPC-FLD0501E          VALUE 'Y'.
       78  XPC-FLD0502B
           VALUE X'078931626286150020034995122841'.
       78  XPC-FLD0502E          VALUE 'N'.
       78  XPC-FLD0503B
           VALUE X'241748150924885620905391882843105F'.
       78  XPC-FLD0503E          VALUE 'N'.
       78  XPC-FLD0504B
           VALUE X'5028930926587901486F'.
       78  XPC-FLD0504E          VALUE 'N'.
       78  XPC-FLD0505B
           VALUE X'054079887440916072855F'.
       78  XPC-FLD0505E          VALUE 'N'.
       78  XPC-FLD0506B
           VALUE X'044983810D'.
       78  XPC-FLD0506E          VALUE 'N'.
       78  XPC-FLD0507B
           VALUE X'5276166649082409209F'.
       78  XPC-FLD0507E          VALUE 'N'.
       78  XPC-FLD0508B
           VALUE X'02144088220848885D'.
       78  XPC-FLD0508E          VALUE 'N'.
       78  XPC-FLD0509B
           VALUE X'488937338626299289'.
       78  XPC-FLD0509E          VALUE 'N'.
       78  XPC-FLD0510B
           VALUE X'092D'.
       78  XPC-FLD0510E          VALUE 'Y'.
       78  XPC-FLD0511B
           VALUE X'05257737010265951195'.
       78  XPC-FLD0511E          VALUE 'N'.
       78  XPC-FLD0512B
           VALUE X'5091717968686512163500879069033544511F'.
       78  XPC-FLD0512E          VALUE 'N'.
       78  XPC-FLD0513B
           VALUE X'07412408747450585089211472222F'.
       78  XPC-FLD0513E          VALUE 'Y'.
       78  XPC-FLD0514B
           VALUE X'02787819996822'.
       78  XPC-FLD0514E          VALUE 'N'.
       78  XPC-FLD0515B
           VALUE X'37690011845231452527479784448514692F'.
       78  XPC-FLD0515E          VALUE 'N'.
       78  XPC-FLD0516B
           VALUE X'09'.
       78  XPC-FLD0516E          VALUE 'N'.
       78  XPC-FLD0517B
           VALUE X'0031340134042710696D'.
       78  XPC-FLD0517E          VALUE 'N'.
       78  XPC-FLD0518B
           VALUE X'089D'.
       78  XPC-FLD0518E          VALUE 'N'.
       78  XPC-FLD0519B
           VALUE X'6841259606583623975595287F'.
       78  XPC-FLD0519E          VALUE 'Y'.
       78  XPC-FLD0520B
           VALUE X'61059553432451049552742F'.
       78  XPC-FLD0520E          VALUE 'N'.
       78  XPC-FLD0521B
           VALUE X'28055C'.
       78  XPC-FLD0521E          VALUE 'N'.
       78  XPC-FLD0522B
           VALUE X'3510676144076D'.
       78  XPC-FLD0522E          VALUE 'N'.
       78  XPC-FLD0523B
           VALUE X'04280314707C'.
       78  XPC-FLD0523E          VALUE 'N'.
       78  XPC-FLD0524B
           VALUE X'5046008862205329081F'.
       78  XPC-FLD0524E          VALUE 'N'.
       78  XPC-FLD0525B
           VALUE X'0887336156634660588871099662355845'.
       78  XPC-FLD0525E          VALUE 'N'.
       78  XPC-FLD0526B
           VALUE X'0535158707'.
       78  XPC-FLD0526E          VALUE 'N'.
       78  XPC-FLD0527B
           VALUE X'0993866582275886311F'.
       78  XPC-FLD0527E          VALUE 'N'.
       78  XPC-FLD0528B
           VALUE X'01207C'.
       78  XPC-FLD0528E          VALUE 'Y'.
       78  XPC-FLD0529B
           VALUE X'06852906977087936C'.
       78  XPC-FLD0529E          VALUE 'N'.
       78  XPC-FLD0530B
           VALUE X'042D'.
       78  XPC-FLD0530E          VALUE 'N'.
       78  XPC-FLD0531B
           VALUE X'023227722C'.
       78  XPC-FLD0531E          VALUE 'Y'.
       78  XPC-FLD0532B
           VALUE X'6D'.
       78  XPC-FLD0532E          VALUE 'N'.
       78  XPC-FLD0533B
           VALUE X'0014'.
       78  XPC-FLD0533E          VALUE 'N'.
       78  XPC-FLD0534B
           VALUE X'4796286047627412578F'.
       78  XPC-FLD0534E          VALUE 'N'.
       78  XPC-FLD0535B
           VALUE X'086934843746367858133650045201648F'.
       78  XPC-FLD0535E          VALUE 'N'.
       78  XPC-FLD0536B
           VALUE X'0C'.
       78  XPC-FLD0536E          VALUE 'N'.
       78  XPC-FLD0537B
           VALUE X'1199'.
       78  XPC-FLD0537E          VALUE 'Y'.
       78  XPC-FLD0538B
           VALUE X'0793946754459935233327882997400592'.
       78  XPC-FLD0538E          VALUE 'N'.
       78  XPC-FLD0539B
           VALUE X'070042059898033071085876599681795F'.
       78  XPC-FLD0539E          VALUE 'N'.
       78  XPC-FLD0540B
           VALUE X'00'.
       78  XPC-FLD0540E          VALUE 'Y'.
       78  XPC-FLD0541B
           VALUE X'049167641848286621388982121061'.
       78  XPC-FLD0541E          VALUE 'N'.
       78  XPC-FLD0542B
           VALUE X'553207696393934218126F'.
       78  XPC-FLD0542E          VALUE 'N'.
       78  XPC-FLD0543B
           VALUE X'0277016069'.
       78  XPC-FLD0543E          VALUE 'N'.
       78  XPC-FLD0544B
           VALUE X'1381302823'.
       78  XPC-FLD0544E          VALUE 'N'.
       78  XPC-FLD0545B
           VALUE X'944856446145206807507570674F'.
       78  XPC-FLD0545E          VALUE 'N'.
       78  XPC-FLD0546B
           VALUE X'60995883518421766866790F'.
       78  XPC-FLD0546E          VALUE 'N'.
       78  XPC-FLD0547B
           VALUE X'3598695862059D'.
       78  XPC-FLD0547E          VALUE 'N'.
       78  XPC-FLD0548B
           VALUE X'68119457212008152846571817'.
       78  XPC-FLD0548E          VALUE 'N'.
       78  XPC-FLD0549B
           VALUE X'0417916211751954'.
       78  XPC-FLD0549E          VALUE 'N'.
       78  XPC-FLD0550B
           VALUE X'94'.
       78  XPC-FLD0550E          VALUE 'N'.
       78  XPC-FLD0551B
           VALUE X'0655119044597454263904505F'.
       78  XPC-FLD0551E          VALUE 'N'.
       78  XPC-FLD0552B
           VALUE X'014745'.
       78  XPC-FLD0552E          VALUE 'Y'.
       78  XPC-FLD0553B
           VALUE X'3608710969090D'.
       78  XPC-FLD0553E          VALUE 'N'.
       78  XPC-FLD0554B
           VALUE X'28615763752268179551663251913851128F'.
       78  XPC-FLD0554E          VALUE 'N'.
       78  XPC-FLD0555B
           VALUE X'5605686733653602811F'.
       78  XPC-FLD0555E          VALUE 'N'.
       78  XPC-FLD0556B
           VALUE X'0568555321722934526833'.
       78  XPC-FLD0556E          VALUE 'N'.
       78  XPC-FLD0557B
           VALUE X'90340C'.
       78  XPC-FLD0557E          VALUE 'N'.
       78  XPC-FLD0558B
           VALUE X'02096049'.
       78  XPC-FLD0558E          VALUE 'Y'.
       78  XPC-FLD0559B
           VALUE X'099142824147194545678672682843'.
       78  XPC-FLD0559E          VALUE 'N'.
       78  XPC-FLD0560B
           VALUE X'0351025116078023'.
       78  XPC-FLD0560E          VALUE 'N'.
       78  XPC-FLD0561B
           VALUE X'00'.
       78  XPC-FLD0561E          VALUE 'Y'.
       78  XPC-FLD0562B
           VALUE X'958208334412512741096179524902254343'.
       78  XPC-FLD0562E          VALUE 'N'.
       78  XPC-FLD0563B
           VALUE X'72227339713C'.
       78  XPC-FLD0563E          VALUE 'N'.
       78  XPC-FLD0564B
           VALUE X'092573034981753798966508384182816371'.
       78  XPC-FLD0564E          VALUE 'Y'.
       78  XPC-FLD0565B
           VALUE X'02180881'.
       78  XPC-FLD0565E          VALUE 'N'.
       78  XPC-FLD0566B
           VALUE X'134200212625'.
       78  XPC-FLD0566E          VALUE 'N'.
       78  XPC-FLD0567B
           VALUE X'0878970351596639054569948257267242'.
       78  XPC-FLD0567E          VALUE 'Y'.
       78  XPC-FLD0568B
           VALUE X'064501399773583058336459'.
       78  XPC-FLD0568E          VALUE 'N'.
       78  XPC-FLD0569B
           VALUE X'722108073354755C'.
       78  XPC-FLD0569E          VALUE 'N'.
       78  XPC-FLD0570B
           VALUE X'720060225322646066764775696F'.
       78  XPC-FLD0570E          VALUE 'N'.
       78  XPC-FLD0571B
           VALUE X'06621729185931387539619251'.
       78  XPC-FLD0571E          VALUE 'N'.
       78  XPC-FLD0572B
           VALUE X'0363058D'.
       78  XPC-FLD0572E          VALUE 'N'.
       78  XPC-FLD0573B
           VALUE X'9908582147727897915245875992695800960F'.
       78  XPC-FLD0573E          VALUE 'Y'.
       78  XPC-FLD0574B
           VALUE X'6D'.
       78  XPC-FLD0574E          VALUE 'N'.
       78  XPC-FLD0575B
           VALUE X'6C'.
       78  XPC-FLD0575E          VALUE 'N'.
       78  XPC-FLD0576B
           VALUE X'47238400610562072401'.
       78  XPC-FLD0576E          VALUE 'N'.
       78  XPC-FLD0577B
           VALUE X'805001512301445405164770363626303151'.
       78  XPC-FLD0577E          VALUE 'N'.
       78  XPC-FLD0578B
           VALUE X'273809'.
       78  XPC-FLD0578E          VALUE 'N'.
       78  XPC-FLD0579B
           VALUE X'5908380596787501714F'.
       78  XPC-FLD0579E          VALUE 'N'.
       78  XPC-FLD0580B
           VALUE X'0646450258967046645771858948137378321F'.
       78  XPC-FLD0580E          VALUE 'N'.
       78  XPC-FLD0581B
           VALUE X'610062973643881143036828'.
       78  XPC-FLD0581E          VALUE 'N'.
       78  XPC-FLD0582B
           VALUE X'062856274902063530202835'.
       78  XPC-FLD0582E          VALUE 'N'.
       78  XPC-FLD0583B
           VALUE X'4C'.
       78  XPC-FLD0583E          VALUE 'N'.
       78  XPC-FLD0584B
           VALUE X'955867594557756605766485336062032729'.
       78  XPC-FLD0584E          VALUE 'N'.
       78  XPC-FLD0585B
           VALUE X'092667442032915370297985191427869722'.
       78  XPC-FLD0585E          VALUE 'Y'.
       78  XPC-FLD0586B
           VALUE X'077794189960829245200635284617'.
       78  XPC-FLD0586E          VALUE 'N'.
       78  XPC-FLD0587B
           VALUE X'02128D'.
       78  XPC-FLD0587E          VALUE 'N'.
       78  XPC-FLD0588B
           VALUE X'09002074772136551272794235956098418F'.
       78  XPC-FLD0588E          VALUE 'Y'.
       78  XPC-FLD0589B
           VALUE X'03292C'.
       78  XPC-FLD0589E          VALUE 'N'.
       78  XPC-FLD0590B
           VALUE X'1062119D'.
       78  XPC-FLD0590E          VALUE 'N'.
       78  XPC-FLD0591B
           VALUE X'5700661418154348791F'.
       78  XPC-FLD0591E          VALUE 'N'.
       78  XPC-FLD0592B
           VALUE X'73907098193D'.
       78  XPC-FLD0592E          VALUE 'N'.
       78  XPC-FLD0593B
           VALUE X'037C'.
       78  XPC-FLD0593E          VALUE 'N'.
       78  XPC-FLD0594B
           VALUE X'77388935043103479483050932685F'.
       78  XPC-FLD0594E          VALUE 'Y'.
       78  XPC-FLD0595B
           VALUE X'3197374054167890777833347730124F'.
       78  XPC-FLD0595E          VALUE 'N'.
       78  XPC-FLD0596B
           VALUE X'657855963298508210108650'.
       78  XPC-FLD0596E          VALUE 'N'.
       78  XPC-FLD0597B
           VALUE X'08162559991782142310157155407068'.
       78  XPC-FLD0597E          VALUE 'Y'.
       78  XPC-FLD0598B
           VALUE X'468477633184507D'.
       78  XPC-FLD0598E          VALUE 'N'.
       78  XPC-FLD0599B
           VALUE X'09'.
       78  XPC-FLD0599E          VALUE 'N'.
       78  XPC-FLD0600B
           VALUE X'0804504375985138686644404515391F'.
       78  XPC-FLD0600E          VALUE 'Y'.
       78  XPC-FLD0601B
           VALUE X'029749813110'.
       78  XPC-FLD0601E          VALUE 'N'.
       78  XPC-FLD0602B
           VALUE X'0303615938'.
       78  XPC-FLD0602E          VALUE 'N'.
       78  XPC-FLD0603B
           VALUE X'0170896D'.
       78  XPC-FLD0603E          VALUE 'Y'.
       78  XPC-FLD0604B
           VALUE X'0551440145498789572319'.
       78  XPC-FLD0604E          VALUE 'N'.
       78  XPC-FLD0605B
           VALUE X'4256957897307752'.
       78  XPC-FLD0605E          VALUE 'N'.
       78  XPC-FLD0606B
           VALUE X'0254178383481C'.
       78  XPC-FLD0606E          VALUE 'N'.
       78  XPC-FLD0607B
           VALUE X'025781'.
       78  XPC-FLD0607E          VALUE 'N'.
       78  XPC-FLD0608B
           VALUE X'225226869583767068085933260590536520'.
       78  XPC-FLD0608E          VALUE 'N'.
       78  XPC-FLD0609B
           VALUE X'045126229228847267'.
       78  XPC-FLD0609E          VALUE 'N'.
       78  XPC-FLD0610B
           VALUE X'2786455271'.
       78  XPC-FLD0610E          VALUE 'N'.
       78  XPC-FLD0611B
           VALUE X'03'.
       78  XPC-FLD0611E          VALUE 'N'.
       78  XPC-FLD0612B
           VALUE X'078744622890006543691754359315'.
       78  XPC-FLD0612E          VALUE 'Y'.
       78  XPC-FLD0613B
           VALUE X'022648276C'.
       78  XPC-FLD0613E          VALUE 'N'.
       78  XPC-FLD0614B
           VALUE X'6052981544136128984377'.
       78  XPC-FLD0614E          VALUE 'N'.
       78  XPC-FLD0615B
           VALUE X'023341961C'.
       78  XPC-FLD0615E          VALUE 'N'.
       78  XPC-FLD0616B
           VALUE X'23'.
       78  XPC-FLD0616E          VALUE 'N'.
       78  XPC-FLD0617B
           VALUE X'00'.
       78  XPC-FLD0617E          VALUE 'N'.
       78  XPC-FLD0618B
           VALUE X'0079'.
       78  XPC-FLD0618E          VALUE 'N'.
       78  XPC-FLD0619B
           VALUE X'053429823777539313843F'.
       78  XPC-FLD0619E          VALUE 'N'.
       78  XPC-FLD0620B
           VALUE X'583959822349086421500174'.
       78  XPC-FLD0620E          VALUE 'N'.
       78  XPC-FLD0621B
           VALUE X'734334021823122911598602513F'.
       78  XPC-FLD0621E          VALUE 'N'.
       78  XPC-FLD0622B
           VALUE X'9542421746848D'.
       78  XPC-FLD0622E          VALUE 'N'.
       78  XPC-FLD0623B
           VALUE X'0641616922896418195095066F'.
       78  XPC-FLD0623E          VALUE 'N'.
       78  XPC-FLD0624B
           VALUE X'4356505095582531'.
       78  XPC-FLD0624E          VALUE 'N'.
       78  XPC-FLD0625B
           VALUE X'78308435769811728739000500354F'.
       78  XPC-FLD0625E          VALUE 'N'.
       78  XPC-FLD0626B
           VALUE X'037427477932063D'.
       78  XPC-FLD0626E          VALUE 'N'.
       78  XPC-FLD0627B
           VALUE X'023249882C'.
       78  XPC-FLD0627E          VALUE 'N'.
       78  XPC-FLD0628B
           VALUE X'029681727729'.
       78  XPC-FLD0628E          VALUE 'N'.
       78  XPC-FLD0629B
           VALUE X'880171084163677411860149391031882F'.
       78  XPC-FLD0629E          VALUE 'N'.
       78  XPC-FLD0630B
           VALUE X'0174519095249753304734'.
       78  XPC-FLD0630E          VALUE 'N'.
       78  XPC-FLD0631B
           VALUE X'824634'.
       78  XPC-FLD0631E          VALUE 'N'.
       78  XPC-FLD0632B
           VALUE X'05012280455704922587'.
       78  XPC-FLD0632E          VALUE 'N'.
       78  XPC-FLD0633B
           VALUE X'0405176751227C'.
       78  XPC-FLD0633E          VALUE 'N'.
       78  XPC-FLD0634B
           VALUE X'0868098250115819156979655872420F'.
       78  XPC-FLD0634E          VALUE 'N'.
       78  XPC-FLD0635B
           VALUE X'0558066570900784292498'.
       78  XPC-FLD0635E          VALUE 'N'.
       78  XPC-FLD0636B
           VALUE X'015706'.
       78  XPC-FLD0636E          VALUE 'Y'.
       78  XPC-FLD0637B
           VALUE X'053791487329715233167F'.
       78  XPC-FLD0637E          VALUE 'N'.
       78  XPC-FLD0638B
           VALUE X'9300997013279628244930563595546F'.
       78  XPC-FLD0638E          VALUE 'N'.
       78  XPC-FLD0639B
           VALUE X'09751092072024196699686626743641681969'.
       78  XPC-FLD0639E          VALUE 'Y'.
       78  XPC-FLD0640B
           VALUE X'89710938089320346744415246575953928F'.
       78  XPC-FLD0640E          VALUE 'N'.
       78  XPC-FLD0641B
           VALUE X'0802113336084028338834883697'.
       78  XPC-FLD0641E          VALUE 'N'.
       78  XPC-FLD0642B
           VALUE X'05220924521868707701698F'.
       78  XPC-FLD0642E          VALUE 'N'.
       78  XPC-FLD0643B
           VALUE X'2890586849'.
       78  XPC-FLD0643E          VALUE 'N'.
       78  XPC-FLD0644B
           VALUE X'092997460492260109532480782945640385'.
       78  XPC-FLD0644E          VALUE 'N'.
       78  XPC-FLD0645B
           VALUE X'0246821544'.
       78  XPC-FLD0645E          VALUE 'N'.
       78  XPC-FLD0646B
           VALUE X'5883231932131506547456'.
       78  XPC-FLD0646E          VALUE 'N'.
       78  XPC-FLD0647B
           VALUE X'06598931491456289340839020'.
       78  XPC-FLD0647E          VALUE 'N'.
       78  XPC-FLD0648B
           VALUE X'0634285861942461315643470F'.
       78  XPC-FLD0648E          VALUE 'N'.
       78  XPC-FLD0649B
           VALUE X'5034432631533975375F'.
       78  XPC-FLD0649E          VALUE 'N'.
       78  XPC-FLD0650B
           VALUE X'6715745920981104473110078F'.
       78  XPC-FLD0650E          VALUE 'N'.
       78  XPC-FLD0651B
           VALUE X'032093946374946D'.
       78  XPC-FLD0651E          VALUE 'N'.
       78  XPC-FLD0652B
           VALUE X'020927047C'.
       78  XPC-FLD0652E          VALUE 'N'.
       78  XPC-FLD0653B
           VALUE X'398302'.
       78  XPC-FLD0653E          VALUE 'N'.
       78  XPC-FLD0654B
           VALUE X'2781322351'.
       78  XPC-FLD0654E          VALUE 'Y'.
       78  XPC-FLD0655B
           VALUE X'05949843308386091165206F'.
       78  XPC-FLD0655E          VALUE 'N'.
       78  XPC-FLD0656B
           VALUE X'0650007677567117914204561F'.
       78  XPC-FLD0656E          VALUE 'N'.
       78  XPC-FLD0657B
           VALUE X'070469220160326710801212967F'.
       78  XPC-FLD0657E          VALUE 'N'.
       78  XPC-FLD0658B
           VALUE X'053680173247006238712F'.
       78  XPC-FLD0658E          VALUE 'N'.
       78  XPC-FLD0659B
           VALUE X'0719555666672452026677575531'.
       78  XPC-FLD0659E          VALUE 'N'.
       78  XPC-FLD0660B
           VALUE X'15464D'.
       78  XPC-FLD0660E          VALUE 'Y'.
       78  XPC-FLD0661B
           VALUE X'570540954971062823984F'.
       78  XPC-FLD0661E          VALUE 'N'.
       78  XPC-FLD0662B
           VALUE X'06678282186476681732324323'.
       78  XPC-FLD0662E          VALUE 'N'.
       78  XPC-FLD0663B
           VALUE X'0889469232052811142885673234559362'.
       78  XPC-FLD0663E          VALUE 'Y'.
       78  XPC-FLD0664B
           VALUE X'04405659595288489C'.
       78  XPC-FLD0664E          VALUE 'N'.
       78  XPC-FLD0665B
           VALUE X'6766161649406166886924393F'.
       78  XPC-FLD0665E          VALUE 'N'.
       78  XPC-FLD0666B
           VALUE X'05'.
       78  XPC-FLD0666E          VALUE 'Y'.
       78  XPC-FLD0667B
           VALUE X'0632143970272669745917437F'.
       78  XPC-FLD0667E          VALUE 'N'.
       78  XPC-FLD0668B
           VALUE X'5144628458672427460F'.
       78  XPC-FLD0668E          VALUE 'N'.
       78  XPC-FLD0669B
           VALUE X'0395936640779813'.
       78  XPC-FLD0669E          VALUE 'N'.
       78  XPC-FLD0670B
           VALUE X'0164380926561097741789296833303524182F'.
       78  XPC-FLD0670E          VALUE 'N'.
       78  XPC-FLD0671B
           VALUE X'08090443'.
       78  XPC-FLD0671E          VALUE 'N'.
       78  XPC-FLD0672B
           VALUE X'637002039815689924395769'.
       78  XPC-FLD0672E          VALUE 'Y'.
       78  XPC-FLD0673B
           VALUE X'0749211223'.
       78  XPC-FLD0673E          VALUE 'N'.
       78  XPC-FLD0674B
           VALUE X'08225787711159490474084418921848'.
       78  XPC-FLD0674E          VALUE 'N'.
       78  XPC-FLD0675B
           VALUE X'05083625274155812857'.
       78  XPC-FLD0675E          VALUE 'N'.
       78  XPC-FLD0676B
           VALUE X'0004664170342459437179627457226160913F'.
       78  XPC-FLD0676E          VALUE 'N'.
       78  XPC-FLD0677B
           VALUE X'708676445455624266891447859961772F'.
       78  XPC-FLD0677E          VALUE 'N'.
       78  XPC-FLD0678B
           VALUE X'85979366357613359468814451247453'.
       78  XPC-FLD0678E          VALUE 'N'.
       78  XPC-FLD0679B
           VALUE X'044902781556612852'.
       78  XPC-FLD0679E          VALUE 'N'.
       78  XPC-FLD0680B
           VALUE X'564571038982083600804F'.
       78  XPC-FLD0680E          VALUE 'N'.
       78  XPC-FLD0681B
           VALUE X'8213717547801553386932482681004F'.
       78  XPC-FLD0681E          VALUE 'Y'.
       78  XPC-FLD0682B
           VALUE X'5608815389721361803129542749957F'.
       78  XPC-FLD0682E          VALUE 'N'.
       78  XPC-FLD0683B
           VALUE X'05829822468269903673642F'.
       78  XPC-FLD0683E          VALUE 'N'.
       78  XPC-FLD0684B
           VALUE X'4383394737646870'.
       78  XPC-FLD0684E          VALUE 'Y'.
       78  XPC-FLD0685B
           VALUE X'0536985204876752143500539204978F'.
       78  XPC-FLD0685E          VALUE 'N'.
       78  XPC-FLD0686B
           VALUE X'00180741962593756744226F'.
       78  XPC-FLD0686E          VALUE 'N'.
       78  XPC-FLD0687B
           VALUE X'456697463326542715'.
       78  XPC-FLD0687E          VALUE 'N'.
       78  XPC-FLD0688B
           VALUE X'0131'.
       78  XPC-FLD0688E          VALUE 'N'.
       78  XPC-FLD0689B
           VALUE X'0933318323051C'.
       78  XPC-FLD0689E          VALUE 'N'.
       78  XPC-FLD0690B
           VALUE X'02807895954D'.
       78  XPC-FLD0690E          VALUE 'N'.
       78  XPC-FLD0691B
           VALUE X'04747985190129339C'.
       78  XPC-FLD0691E          VALUE 'N'.
       78  XPC-FLD0692B
           VALUE X'278067587806645121846764'.
       78  XPC-FLD0692E          VALUE 'N'.
       78  XPC-FLD0693B
           VALUE X'0C'.
       78  XPC-FLD0693E          VALUE 'Y'.
       78  XPC-FLD0694B
           VALUE X'06'.
       78  XPC-FLD0694E          VALUE 'N'.
       78  XPC-FLD0695B
           VALUE X'285416863016785357397587'.
       78  XPC-FLD0695E          VALUE 'N'.
       78  XPC-FLD0696B
           VALUE X'318862710902'.
       78  XPC-FLD0696E          VALUE 'N'.
       78  XPC-FLD0697B
           VALUE X'05576423548738693906'.
       78  XPC-FLD0697E          VALUE 'N'.
       78  XPC-FLD0698B
           VALUE X'613D'.
       78  XPC-FLD0698E          VALUE 'N'.
       78  XPC-FLD0699B
           VALUE X'63028840127729701681147F'.
       78  XPC-FLD0699E          VALUE 'Y'.
       78  XPC-FLD0700B
           VALUE X'4D'.
       78  XPC-FLD0700E          VALUE 'N'.
       78  XPC-FLD0701B
           VALUE X'0824434325033338688548667501709982529F'.
       78  XPC-FLD0701E          VALUE 'N'.
       78  XPC-FLD0702B
           VALUE X'23424178'.
       78  XPC-FLD0702E          VALUE 'N'.
       78  XPC-FLD0703B
           VALUE X'335267041235'.
       78  XPC-FLD0703E          VALUE 'N'.
       78  XPC-FLD0704B
           VALUE X'08515404888861616825987F'.
       78  XPC-FLD0704E          VALUE 'N'.
       78  XPC-FLD0705B
           VALUE X'046999504797278301'.
       78  XPC-FLD0705E          VALUE 'Y'.
       78  XPC-FLD0706B
           VALUE X'0327398D'.
       78  XPC-FLD0706E          VALUE 'N'.
       78  XPC-FLD0707B
           VALUE X'5129442198407349051F'.
       78  XPC-FLD0707E          VALUE 'N'.
       78  XPC-FLD0708B
           VALUE X'338347991943'.
       78  XPC-FLD0708E          VALUE 'N'.
       78  XPC-FLD0709B
           VALUE X'37934595068404'.
       78  XPC-FLD0709E          VALUE 'N'.
       78  XPC-FLD0710B
           VALUE X'0322996288512C'.
       78  XPC-FLD0710E          VALUE 'N'.
       78  XPC-FLD0711B
           VALUE X'06'.
       78  XPC-FLD0711E          VALUE 'Y'.
       78  XPC-FLD0712B
           VALUE X'0555782537921349383D'.
       78  XPC-FLD0712E          VALUE 'N'.
       78  XPC-FLD0713B
           VALUE X'71121008'.
       78  XPC-FLD0713E          VALUE 'N'.
       78  XPC-FLD0714B
           VALUE X'03473859515252'.
       78  XPC-FLD0714E          VALUE 'Y'.
       78  XPC-FLD0715B
           VALUE X'58869262308134147685'.
       78  XPC-FLD0715E          VALUE 'N'.
       78  XPC-FLD0716B
           VALUE X'04094336916239737930141018296126276F'.
       78  XPC-FLD0716E          VALUE 'N'.
       78  XPC-FLD0717B
           VALUE X'7657108845718485268250219632'.
       78  XPC-FLD0717E          VALUE 'N'.
       78  XPC-FLD0718B
           VALUE X'4283258317648062'.
       78  XPC-FLD0718E          VALUE 'N'.
       78  XPC-FLD0719B
           VALUE X'0239090461'.
       78  XPC-FLD0719E          VALUE 'N'.
       78  XPC-FLD0720B
           VALUE X'404886229426392C'.
       78  XPC-FLD0720E          VALUE 'N'.
       78  XPC-FLD0721B
           VALUE X'45808242'.
       78  XPC-FLD0721E          VALUE 'N'.
       78  XPC-FLD0722B
           VALUE X'07624904820924922808538326535F'.
       78  XPC-FLD0722E          VALUE 'N'.
       78  XPC-FLD0723B
           VALUE X'07'.
       78  XPC-FLD0723E          VALUE 'Y'.
       78  XPC-FLD0724B
           VALUE X'04934011851187240393'.
       78  XPC-FLD0724E          VALUE 'N'.
       78  XPC-FLD0725B
           VALUE X'04444137342530902C'.
       78  XPC-FLD0725E          VALUE 'N'.
       78  XPC-FLD0726B
           VALUE X'401820868675800C'.
       78  XPC-FLD0726E          VALUE 'N'.
       78  XPC-FLD0727B
           VALUE X'00896082861134319673904889'.
       78  XPC-FLD0727E          VALUE 'N'.
       78  XPC-FLD0728B
           VALUE X'081076915652245D'.
       78  XPC-FLD0728E          VALUE 'N'.
       78  XPC-FLD0729B
           VALUE X'795979478015814722415832704882'.
       78  XPC-FLD0729E          VALUE 'N'.
       78  XPC-FLD0730B
           VALUE X'62944830238001500322119F'.
       78  XPC-FLD0730E          VALUE 'N'.
       78  XPC-FLD0731B
           VALUE X'04086517499647340789789F'.
       78  XPC-FLD0731E          VALUE 'N'.
       78  XPC-FLD0732B
           VALUE X'00313C'.
       78  XPC-FLD0732E          VALUE 'N'.
       78  XPC-FLD0733B
           VALUE X'965641152048700750127567'.
       78  XPC-FLD0733E          VALUE 'N'.
       78  XPC-FLD0734B
           VALUE X'26'.
       78  XPC-FLD0734E          VALUE 'N'.
       78  XPC-FLD0735B
           VALUE X'0641708846027484955070190F'.
       78  XPC-FLD0735E          VALUE 'N'.
       78  XPC-FLD0736B
           VALUE X'072589764082146861645222974767'.
       78  XPC-FLD0736E          VALUE 'N'.
       78  XPC-FLD0737B
           VALUE X'522443922D'.
       78  XPC-FLD0737E          VALUE 'N'.
       78  XPC-FLD0738B
           VALUE X'967470462418068333221299326396547257'.
       78  XPC-FLD0738E          VALUE 'Y'.
       78  XPC-FLD0739B
           VALUE X'0459162078493461292D'.
       78  XPC-FLD0739E          VALUE 'N'.
       78  XPC-FLD0740B
           VALUE X'072773632191726975291885537444614F'.
       78  XPC-FLD0740E          VALUE 'N'.
       78  XPC-FLD0741B
           VALUE X'0644169236711C'.
       78  XPC-FLD0741E          VALUE 'N'.
       78  XPC-FLD0742B
           VALUE X'88899021862D'.
       78  XPC-FLD0742E          VALUE 'N'.
       78  XPC-FLD0743B
           VALUE X'02956850'.
       78  XPC-FLD0743E          VALUE 'N'.
       78  XPC-FLD0744B
           VALUE X'2695622879'.
       78  XPC-FLD0744E          VALUE 'N'.
       78  XPC-FLD0745B
           VALUE X'013557'.
       78  XPC-FLD0745E          VALUE 'N'.
       78  XPC-FLD0746B
           VALUE X'0231527099755997057F'.
       78  XPC-FLD0746E          VALUE 'N'.
       78  XPC-FLD0747B
           VALUE X'9169159297409485986918298294767737'.
       78  XPC-FLD0747E          VALUE 'Y'.
       78  XPC-FLD0748B
           VALUE X'0181187D'.
       78  XPC-FLD0748E          VALUE 'N'.
       78  XPC-FLD0749B
           VALUE X'2760411381430374631233670697839F'.
       78  XPC-FLD0749E          VALUE 'N'.
       78  XPC-FLD0750B
           VALUE X'262999561973'.
       78  XPC-FLD0750E          VALUE 'N'.
       78  XPC-FLD0751B
           VALUE X'15170D'.
       78  XPC-FLD0751E          VALUE 'N'.
       78  XPC-FLD0752B
           VALUE X'91538508268330654527034084821934811F'.
       78  XPC-FLD0752E          VALUE 'N'.
       78  XPC-FLD0753B
           VALUE X'0C'.
       78  XPC-FLD0753E          VALUE 'Y'.
       78  XPC-FLD0754B
           VALUE X'0961172589'.
       78  XPC-FLD0754E          VALUE 'N'.
       78  XPC-FLD0755B
           VALUE X'053471365948751090643F'.
       78  XPC-FLD0755E          VALUE 'N'.
       78  XPC-FLD0756B
           VALUE X'15366D'.
       78  XPC-FLD0756E          VALUE 'Y'.
       78  XPC-FLD0757B
           VALUE X'389641442C'.
       78  XPC-FLD0757E          VALUE 'N'.
       78  XPC-FLD0758B
           VALUE X'0455928D'.
       78  XPC-FLD0758E          VALUE 'N'.
       78  XPC-FLD0759B
           VALUE X'07622235272467824718001239148F'.
       78  XPC-FLD0759E          VALUE 'N'.
       78  XPC-FLD0760B
           VALUE X'09469886609778104836721013271017001F'.
       78  XPC-FLD0760E          VALUE 'N'.
       78  XPC-FLD0761B
           VALUE X'031926781976263429729811'.
       78  XPC-FLD0761E          VALUE 'N'.
       78  XPC-FLD0762B
           VALUE X'0259134361'.
       78  XPC-FLD0762E          VALUE 'Y'.
       78  XPC-FLD0763B
           VALUE X'283690925904618196362605387461'.
       78  XPC-FLD0763E          VALUE 'N'.
       78  XPC-FLD0764B
           VALUE X'055560951487484800'.
       78  XPC-FLD0764E          VALUE 'N'.
       78  XPC-FLD0765B
           VALUE X'01212C'.
       78  XPC-FLD0765E          VALUE 'Y'.
       78  XPC-FLD0766B
           VALUE X'22949432'.
       78  XPC-FLD0766E          VALUE 'N'.
       78  XPC-FLD0767B
           VALUE X'0D'.
       78  XPC-FLD0767E          VALUE 'N'.
       78  XPC-FLD0768B
           VALUE X'007D'.
       78  XPC-FLD0768E          VALUE 'Y'.
       78  XPC-FLD0769B
           VALUE X'03586597857349'.
       78  XPC-FLD0769E          VALUE 'N'.
       78  XPC-FLD0770B
           VALUE X'054829803888151060764504'.
       78  XPC-FLD0770E          VALUE 'N'.
       78  XPC-FLD0771B
           VALUE X'075991198999121606361129010F'.
       78  XPC-FLD0771E          VALUE 'N'.
       78  XPC-FLD0772B
           VALUE X'0090893446885685'.
       78  XPC-FLD0772E          VALUE 'N'.
       78  XPC-FLD0773B
           VALUE X'76783997423560348547511011929600499F'.
       78  XPC-FLD0773E          VALUE 'N'.
       78  XPC-FLD0774B
           VALUE X'242589104C'.
       78  XPC-FLD0774E          VALUE 'N'.
       78  XPC-FLD0775B
           VALUE X'83006085498341006789723905967548489F'.
       78  XPC-FLD0775E          VALUE 'N'.
       78  XPC-FLD0776B
           VALUE X'65983936382796708763014976284467'.
       78  XPC-FLD0776E          VALUE 'N'.
       78  XPC-FLD0777B
           VALUE X'563799910901816754889F'.
       78  XPC-FLD0777E          VALUE 'N'.
       78  XPC-FLD0778B
           VALUE X'6562465464730475300569878527312539'.
       78  XPC-FLD0778E          VALUE 'N'.
       78  XPC-FLD0779B
           VALUE X'0474089855326103228D'.
       78  XPC-FLD0779E          VALUE 'N'.
       78  XPC-FLD0780B
           VALUE X'8227596235369002419801631731388F'.
       78  XPC-FLD0780E          VALUE 'Y'.
       78  XPC-FLD0781B
           VALUE X'096874455399'.
       78  XPC-FLD0781E          VALUE 'N'.
       78  XPC-FLD0782B
           VALUE X'974841984908992382763415207591606305'.
       78  XPC-FLD0782E          VALUE 'N'.
       78  XPC-FLD0783B
           VALUE X'04236442572674454C'.
       78  XPC-FLD0783E          VALUE 'N'.
       78  XPC-FLD0784B
           VALUE X'1401654002801979714825902150218F'.
       78  XPC-FLD0784E          VALUE 'N'.
       78  XPC-FLD0785B
           VALUE X'393300524050'.
       78  XPC-FLD0785E          VALUE 'N'.
       78  XPC-FLD0786B
           VALUE X'085407905679605532414111479511119F'.
       78  XPC-FLD0786E          VALUE 'N'.
       78  XPC-FLD0787B
           VALUE X'00464284'.
       78  XPC-FLD0787E          VALUE 'N'.
       78  XPC-FLD0788B
           VALUE X'077898336505928358503125785715'.
       78  XPC-FLD0788E          VALUE 'N'.
       78  XPC-FLD0789B
           VALUE X'6604278565132847496040994F'.
       78  XPC-FLD0789E          VALUE 'N'.
       78  XPC-FLD0790B
           VALUE X'31694368662D'.
       78  XPC-FLD0790E          VALUE 'N'.
       78  XPC-FLD0791B
           VALUE X'7382741348868294886190710712'.
       78  XPC-FLD0791E          VALUE 'N'.
       78  XPC-FLD0792B
           VALUE X'37982443954012'.
       78  XPC-FLD0792E          VALUE 'N'.
       78  XPC-FLD0793B
           VALUE X'0559177637820166807230'.
       78  XPC-FLD0793E          VALUE 'N'.
       78  XPC-FLD0794B
           VALUE X'9D'.
       78  XPC-FLD0794E          VALUE 'N'.
       78  XPC-FLD0795B
           VALUE X'0334944006958C'.
       78  XPC-FLD0795E          VALUE 'N'.
       78  XPC-FLD0796B
           VALUE X'0653841465915909014761098205'.
       78  XPC-FLD0796E          VALUE 'N'.
       78  XPC-FLD0797B
           VALUE X'03487774860252'.
       78  XPC-FLD0797E          VALUE 'N'.
       78  XPC-FLD0798B
           VALUE X'3415780672379371043808250F'.
       78  XPC-FLD0798E          VALUE 'N'.
       78  XPC-FLD0799B
           VALUE X'024239306208646738127F'.
       78  XPC-FLD0799E          VALUE 'N'.
       78  XPC-FLD0800B
           VALUE X'4337360023'.
       78  XPC-FLD0800E          VALUE 'N'.
       78  XPC-FLD0801B
           VALUE X'9827967002397862694706986985693220049F'.
       78  XPC-FLD0801E          VALUE 'Y'.
       78  XPC-FLD0802B
           VALUE X'059390909987167776897365456534317F'.
       78  XPC-FLD0802E          VALUE 'N'.
       78  XPC-FLD0803B
           VALUE X'0555623043499399698487'.
       78  XPC-FLD0803E          VALUE 'N'.
       78  XPC-FLD0804B
           VALUE X'00'.
       78  XPC-FLD0804E          VALUE 'Y'.
       78  XPC-FLD0805B
           VALUE X'479868190466873291'.
       78  XPC-FLD0805E          VALUE 'N'.
       78  XPC-FLD0806B
           VALUE X'2580784568425466'.
       78  XPC-FLD0806E          VALUE 'N'.
       78  XPC-FLD0807B
           VALUE X'090D'.
       78  XPC-FLD0807E          VALUE 'Y'.
       78  XPC-FLD0808B
           VALUE X'045744550475690953'.
       78  XPC-FLD0808E          VALUE 'N'.
       78  XPC-FLD0809B
           VALUE X'04404211618158995C'.
       78  XPC-FLD0809E          VALUE 'N'.
       78  XPC-FLD0810B
           VALUE X'021294550C'.
       78  XPC-FLD0810E          VALUE 'N'.
       78  XPC-FLD0811B
           VALUE X'5454913861947337423021251372119877487F'.
       78  XPC-FLD0811E          VALUE 'N'.
       78  XPC-FLD0812B
           VALUE X'5678497418'.
       78  XPC-FLD0812E          VALUE 'N'.
       78  XPC-FLD0813B
           VALUE X'29113136400D'.
       78  XPC-FLD0813E          VALUE 'Y'.
       78  XPC-FLD0814B
           VALUE X'07525119595496631362479433846F'.
       78  XPC-FLD0814E          VALUE 'N'.
       78  XPC-FLD0815B
           VALUE X'0714304561558653405839436344638434439F'.
       78  XPC-FLD0815E          VALUE 'N'.
       78  XPC-FLD0816B
           VALUE X'0885915144904112161761133847903693'.
       78  XPC-FLD0816E          VALUE 'Y'.
       78  XPC-FLD0817B
           VALUE X'00322267276165150162'.
       78  XPC-FLD0817E          VALUE 'N'.
       78  XPC-FLD0818B
           VALUE X'0409797454111609544843745425'.
       78  XPC-FLD0818E          VALUE 'N'.
       78  XPC-FLD0819B
           VALUE X'082D'.
       78  XPC-FLD0819E          VALUE 'N'.
       78  XPC-FLD0820B
           VALUE X'956537139953218984445015848905313760'.
       78  XPC-FLD0820E          VALUE 'N'.
       78  XPC-FLD0821B
           VALUE X'016692042005410C'.
       78  XPC-FLD0821E          VALUE 'N'.
       78  XPC-FLD0822B
           VALUE X'1092'.
       78  XPC-FLD0822E          VALUE 'Y'.
       78  XPC-FLD0823B
           VALUE X'484310601769554C'.
       78  XPC-FLD0823E          VALUE 'N'.
       78  XPC-FLD0824B
           VALUE X'073189644908504480898002'.
       78  XPC-FLD0824E          VALUE 'N'.
       78  XPC-FLD0825B
           VALUE X'0170692D'.
       78  XPC-FLD0825E          VALUE 'N'.
       78  XPC-FLD0826B
           VALUE X'0480578557209735916D'.
       78  XPC-FLD0826E          VALUE 'N'.
       78  XPC-FLD0827B
           VALUE X'046910500983725489'.
       78  XPC-FLD0827E          VALUE 'N'.
       78  XPC-FLD0828B
           VALUE X'15016D'.
       78  XPC-FLD0828E          VALUE 'Y'.
       78  XPC-FLD0829B
           VALUE X'944972866636283770347403930829'.
       78  XPC-FLD0829E          VALUE 'N'.
       78  XPC-FLD0830B
           VALUE X'0565534908381171491839'.
       78  XPC-FLD0830E          VALUE 'N'.
       78  XPC-FLD0831B
           VALUE X'6602934475151655210356515F'.
       78  XPC-FLD0831E          VALUE 'N'.
       78  XPC-FLD0832B
           VALUE X'0419047953539795'.
       78  XPC-FLD0832E          VALUE 'N'.
       78  XPC-FLD0833B
           VALUE X'6657954482808921498060427F'.
       78  XPC-FLD0833E          VALUE 'N'.
       78  XPC-FLD0834B
           VALUE X'711918981740956136050613167F'.
       78  XPC-FLD0834E          VALUE 'Y'.
       78  XPC-FLD0835B
           VALUE X'090696211292909090229130697187'.
       78  XPC-FLD0835E          VALUE 'N'.
       78  XPC-FLD0836B
           VALUE X'01479247899592904941896F'.
       78  XPC-FLD0836E          VALUE 'N'.
       78  XPC-FLD0837B
           VALUE X'29137776510D'.
       78  XPC-FLD0837E          VALUE 'N'.
       78  XPC-FLD0838B
           VALUE X'54394205787057270376334726969F'.
       78  XPC-FLD0838E          VALUE 'N'.
       78  XPC-FLD0839B
           VALUE X'05300514'.
       78  XPC-FLD0839E          VALUE 'N'.
       78  XPC-FLD0840B
           VALUE X'1153'.
       78  XPC-FLD0840E          VALUE 'N'.
       78  XPC-FLD0841B
           VALUE X'0992981736583248397742806176703F'.
       78  XPC-FLD0841E          VALUE 'N'.
       78  XPC-FLD0842B
           VALUE X'054030708425366313836265591069241055'.
       78  XPC-FLD0842E          VALUE 'N'.
       78  XPC-FLD0843B
           VALUE X'31166916723C'.
       78  XPC-FLD0843E          VALUE 'N'.
       78  XPC-FLD0844B
           VALUE X'044793585873382490'.
       78  XPC-FLD0844E          VALUE 'N'.
       78  XPC-FLD0845B
           VALUE X'0555020066479501195111220F'.
       78  XPC-FLD0845E          VALUE 'N'.
       78  XPC-FLD0846B
           VALUE X'045502277490866085'.
       78  XPC-FLD0846E          VALUE 'N'.
       78  XPC-FLD0847B
           VALUE X'029702735772'.
       78  XPC-FLD0847E          VALUE 'N'.
       78  XPC-FLD0848B
           VALUE X'631805001566330881601629698F'.
       78  XPC-FLD0848E          VALUE 'N'.
       78  XPC-FLD0849B
           VALUE X'07527838155592773139446194363F'.
       78  XPC-FLD0849E          VALUE 'Y'.
       78  XPC-FLD0850B
           VALUE X'0213070204849290532925563F'.
       78  XPC-FLD0850E          VALUE 'N'.
       78  XPC-FLD0851B
           VALUE X'22519773'.
       78  XPC-FLD0851E          VALUE 'N'.
       78  XPC-FLD0852B
           VALUE X'2868257988'.
       78  XPC-FLD0852E          VALUE 'Y'.
       78  XPC-FLD0853B
           VALUE X'0C'.
       78  XPC-FLD0853E          VALUE 'N'.
       78  XPC-FLD0854B
           VALUE X'09'.
       78  XPC-FLD0854E          VALUE 'N'.
       78  XPC-FLD0855B
           VALUE X'167054'.
       78  XPC-FLD0855E          VALUE 'Y'.
       78  XPC-FLD0856B
           VALUE X'30842D'.
       78  XPC-FLD0856E          VALUE 'N'.
       78  XPC-FLD0857B
           VALUE X'010C'.
       78  XPC-FLD0857E          VALUE 'N'.
       78  XPC-FLD0858B
           VALUE X'030966624473'.
       78  XPC-FLD0858E          VALUE 'Y'.
       78  XPC-FLD0859B
           VALUE X'0971628168143447767945986015547532588F'.
       78  XPC-FLD0859E          VALUE 'N'.
       78  XPC-FLD0860B
           VALUE X'310782983915'.
       78  XPC-FLD0860E          VALUE 'N'.
       78  XPC-FLD0861B
           VALUE X'1091'.
       78  XPC-FLD0861E          VALUE 'Y'.
       78  XPC-FLD0862B
           VALUE X'0568978369365978243753'.
       78  XPC-FLD0862E          VALUE 'N'.
       78  XPC-FLD0863B
           VALUE X'05171345793694755750'.
       78  XPC-FLD0863E          VALUE 'N'.
       78  XPC-FLD0864B
           VALUE X'0879130787212824560405977081245509'.
       78  XPC-FLD0864E          VALUE 'Y'.
       78  XPC-FLD0865B
           VALUE X'327C'.
       78  XPC-FLD0865E          VALUE 'N'.
       78  XPC-FLD0866B
           VALUE X'0973651490201067931957936707476620'.
       78  XPC-FLD0866E          VALUE 'N'.
       78  XPC-FLD0867B
           VALUE X'0728938616966572774526298417'.
       78  XPC-FLD0867E          VALUE 'N'.
       78  XPC-FLD0868B
           VALUE X'05841479951825634534534F'.
       78  XPC-FLD0868E          VALUE 'N'.
       78  XPC-FLD0869B
           VALUE X'6815782206919422936408636F'.
       78  XPC-FLD0869E          VALUE 'N'.
       78  XPC-FLD0870B
           VALUE X'657570531523696821807334'.
       78  XPC-FLD0870E          VALUE 'N'.
       78  XPC-FLD0871B
           VALUE X'5744601464762396635F'.
       78  XPC-FLD0871E          VALUE 'N'.
       78  XPC-FLD0872B
           VALUE X'045914011344767276'.
       78  XPC-FLD0872E          VALUE 'N'.
       78  XPC-FLD0873B
           VALUE X'015597'.
       78  XPC-FLD0873E          VALUE 'Y'.
       78  XPC-FLD0874B
           VALUE X'01881063'.
       78  XPC-FLD0874E          VALUE 'N'.
       78  XPC-FLD0875B
           VALUE X'32'.
       78  XPC-FLD0875E          VALUE 'N'.
       78  XPC-FLD0876B
           VALUE X'0792823887607293276147402139031F'.
       78  XPC-FLD0876E          VALUE 'N'.
       78  XPC-FLD0877B
           VALUE X'0721900468299383535342172F'.
       78  XPC-FLD0877E          VALUE 'N'.
       78  XPC-FLD0878B
           VALUE X'242827678838084315415812843661207F'.
       78  XPC-FLD0878E          VALUE 'N'.
       78  XPC-FLD0879B
           VALUE X'085230962794591269560129376259283F'.
       78  XPC-FLD0879E          VALUE 'Y'.
       78  XPC-FLD0880B
           VALUE X'04839436714022342976684717541503'.
       78  XPC-FLD0880E          VALUE 'N'.
       78  XPC-FLD0881B
           VALUE X'2105193947194C'.
       78  XPC-FLD0881E          VALUE 'N'.
       78  XPC-FLD0882B
           VALUE X'06778329518186110291821933'.
       78  XPC-FLD0882E          VALUE 'Y'.
       78  XPC-FLD0883B
           VALUE X'9754132777012324284626648395'.
       78  XPC-FLD0883E          VALUE 'N'.
       78  XPC-FLD0884B
           VALUE X'06490392032439449247535630967F'.
       78  XPC-FLD0884E          VALUE 'N'.
       78  XPC-FLD0885B
           VALUE X'02072D'.
       78  XPC-FLD0885E          VALUE 'N'.
       78  XPC-FLD0886B
           VALUE X'000595069070307D'.
       78  XPC-FLD0886E          VALUE 'N'.
       78  XPC-FLD0887B
           VALUE X'09306168018675709582439026235078'.
       78  XPC-FLD0887E          VALUE 'N'.
       78  XPC-FLD0888B
           VALUE X'0239444618'.
       78  XPC-FLD0888E          VALUE 'Y'.
       78  XPC-FLD0889B
           VALUE X'0286280324389502793813733205752214417F'.
       78  XPC-FLD0889E          VALUE 'N'.
       78  XPC-FLD0890B
           VALUE X'721613583480198661490589984F'.
       78  XPC-FLD0890E          VALUE 'N'.
       78  XPC-FLD0891B
           VALUE X'0735270814161123614247195234'.
       78  XPC-FLD0891E          VALUE 'N'.
       78  XPC-FLD0892B
           VALUE X'0556'.
       78  XPC-FLD0892E          VALUE 'N'.
       78  XPC-FLD0893B
           VALUE X'90'.
       78  XPC-FLD0893E          VALUE 'N'.
       78  XPC-FLD0894B
           VALUE X'654309128000748152942378'.
       78  XPC-FLD0894E          VALUE 'N'.
       78  XPC-FLD0895B
           VALUE X'2889386308'.
       78  XPC-FLD0895E          VALUE 'N'.
       78  XPC-FLD0896B
           VALUE X'0D'.
       78  XPC-FLD0896E          VALUE 'N'.
       78  XPC-FLD0897B
           VALUE X'04404922200833586C'.
       78  XPC-FLD0897E          VALUE 'N'.
       78  XPC-FLD0898B
           VALUE X'08343519'.
       78  XPC-FLD0898E          VALUE 'N'.
       78  XPC-FLD0899B
           VALUE X'5130606210827635'.
       78  XPC-FLD0899E          VALUE 'N'.
       78  XPC-FLD0900B
           VALUE X'01847103'.
       78  XPC-FLD0900E          VALUE 'N'.
       78  XPC-FLD0901B
           VALUE X'01289396298369796609307513790554367005'.
       78  XPC-FLD0901E          VALUE 'N'.
       78  XPC-FLD0902B
           VALUE X'5131049785081560396F'.
       78  XPC-FLD0902E          VALUE 'N'.
       78  XPC-FLD0903B
           VALUE X'006D'.
       78  XPC-FLD0903E          VALUE 'Y'.
       78  XPC-FLD0904B
           VALUE X'7D'.
       78  XPC-FLD0904E          VALUE 'N'.
       78  XPC-FLD0905B
           VALUE X'07075373564412'.
       78  XPC-FLD0905E          VALUE 'N'.
       78  XPC-FLD0906B
           VALUE X'00'.
       78  XPC-FLD0906E          VALUE 'Y'.
       78  XPC-FLD0907B
           VALUE X'0530207411746521324809'.
       78  XPC-FLD0907E          VALUE 'N'.
       78  XPC-FLD0908B
           VALUE X'08642393083548316472445662839163561F'.
       78  XPC-FLD0908E          VALUE 'N'.
       78  XPC-FLD0909B
           VALUE X'00'.
       78  XPC-FLD0909E          VALUE 'Y'.
       78  XPC-FLD0910B
           VALUE X'2257333765600096867487422969134058'.
       78  XPC-FLD0910E          VALUE 'N'.
       78  XPC-FLD0911B
           VALUE X'03765938103187097346508025840F'.
       78  XPC-FLD0911E          VALUE 'N'.
       78  XPC-FLD0912B
           VALUE X'00'.
       78  XPC-FLD0912E          VALUE 'Y'.
       78  XPC-FLD0913B
           VALUE X'0325'.
       78  XPC-FLD0913E          VALUE 'N'.
       78  XPC-FLD0914B
           VALUE X'7400121849171126253708052900037643855F'.
       78  XPC-FLD0914E          VALUE 'N'.
       78  XPC-FLD0915B
           VALUE X'01130C'.
       78  XPC-FLD0915E          VALUE 'Y'.
       78  XPC-FLD0916B
           VALUE X'4372777685598984'.
       78  XPC-FLD0916E          VALUE 'N'.
       78  XPC-FLD0917B
           VALUE X'1084'.
       78  XPC-FLD0917E          VALUE 'N'.
       78  XPC-FLD0918B
           VALUE X'0569310510294893204244'.
       78  XPC-FLD0918E          VALUE 'N'.
       78  XPC-FLD0919B
           VALUE X'6D'.
       78  XPC-FLD0919E          VALUE 'N'.
       78  XPC-FLD0920B
           VALUE X'06698607602658151664433262'.
       78  XPC-FLD0920E          VALUE 'N'.
       78  XPC-FLD0921B
           VALUE X'0C'.
       78  XPC-FLD0921E          VALUE 'Y'.
       78  XPC-FLD0922B
           VALUE X'0183318D'.
       78  XPC-FLD0922E          VALUE 'N'.
       78  XPC-FLD0923B
           VALUE X'60892C'.
       78  XPC-FLD0923E          VALUE 'N'.
       78  XPC-FLD0924B
           VALUE X'8304134742864166529585645548650F'.
       78  XPC-FLD0924E          VALUE 'Y'.
       78  XPC-FLD0925B
           VALUE X'6C'.
       78  XPC-FLD0925E          VALUE 'N'.
       78  XPC-FLD0926B
           VALUE X'206877212D'.
       78  XPC-FLD0926E          VALUE 'N'.
       78  XPC-FLD0927B
           VALUE X'5121865708750312359F'.
       78  XPC-FLD0927E          VALUE 'N'.
       78  XPC-FLD0928B
           VALUE X'0255169492'.
       78  XPC-FLD0928E          VALUE 'N'.
       78  XPC-FLD0929B
           VALUE X'713937683093887626162299397F'.
       78  XPC-FLD0929E          VALUE 'N'.
       78  XPC-FLD0930B
           VALUE X'05915948649192320925289F'.
       78  XPC-FLD0930E          VALUE 'N'.
       78  XPC-FLD0931B
           VALUE X'124377459C'.
       78  XPC-FLD0931E          VALUE 'N'.
       78  XPC-FLD0932B
           VALUE X'00116711468219923287'.
       78  XPC-FLD0932E          VALUE 'N'.
       78  XPC-FLD0933B
           VALUE X'336212612034'.
       78  XPC-FLD0933E          VALUE 'N'.
       78  XPC-FLD0934B
           VALUE X'0237750091'.
       78  XPC-FLD0934E          VALUE 'N'.
       78  XPC-FLD0935B
           VALUE X'485384635684275264'.
       78  XPC-FLD0935E          VALUE 'N'.
       78  XPC-FLD0936B
           VALUE X'0952998853185021421730027668672846630F'.
       78  XPC-FLD0936E          VALUE 'Y'.
       78  XPC-FLD0937B
           VALUE X'04'.
       78  XPC-FLD0937E          VALUE 'N'.
       78  XPC-FLD0938B
           VALUE X'07520562026683963451729041'.
       78  XPC-FLD0938E          VALUE 'N'.
       78  XPC-FLD0939B
           VALUE X'0C'.
       78  XPC-FLD0939E          VALUE 'Y'.
       78  XPC-FLD0940B
           VALUE X'420205546087499958'.
       78  XPC-FLD0940E          VALUE 'N'.
       78  XPC-FLD0941B
           VALUE X'00154777002907'.
       78  XPC-FLD0941E          VALUE 'N'.
       78  XPC-FLD0942B
           VALUE X'92270492697630424050458941565011627F'.
       78  XPC-FLD0942E          VALUE 'Y'.
       78  XPC-FLD0943B
           VALUE X'9698175C'.
       78  XPC-FLD0943E          VALUE 'N'.
       78  XPC-FLD0944B
           VALUE X'260056094D'.
       78  XPC-FLD0944E          VALUE 'N'.
       78  XPC-FLD0945B
           VALUE X'09639552190838518C'.
       78  XPC-FLD0945E          VALUE 'N'.
       78  XPC-FLD0946B
           VALUE X'0285407519811451561686510558502050116F'.
       78  XPC-FLD0946E          VALUE 'N'.
       78  XPC-FLD0947B
           VALUE X'6720279273588082815549249F'.
       78  XPC-FLD0947E          VALUE 'N'.
       78  XPC-FLD0948B
           VALUE X'7581536805549627281493485497'.
       78  XPC-FLD0948E          VALUE 'N'.
       78  XPC-FLD0949B
           VALUE X'089772746643169742'.
       78  XPC-FLD0949E          VALUE 'N'.
       78  XPC-FLD0950B
           VALUE X'9466572989771413480277234393870459'.
       78  XPC-FLD0950E          VALUE 'N'.
       78  XPC-FLD0951B
           VALUE X'7459913492992847894313968026'.
       78  XPC-FLD0951E          VALUE 'Y'.
       78  XPC-FLD0952B
           VALUE X'65'.
       78  XPC-FLD0952E          VALUE 'N'.
       78  XPC-FLD0953B
           VALUE X'05187948954462912461'.
       78  XPC-FLD0953E          VALUE 'N'.
       78  XPC-FLD0954B
           VALUE X'0970603521071659591790137255884474143F'.
       78  XPC-FLD0954E          VALUE 'Y'.
       78  XPC-FLD0955B
           VALUE X'5341017709695240897178791783518F'.
       78  XPC-FLD0955E          VALUE 'N'.
       78  XPC-FLD0956B
           VALUE X'097384559702281070479269828F'.
       78  XPC-FLD0956E          VALUE 'N'.
       78  XPC-FLD0957B
           VALUE X'01212C'.
       78  XPC-FLD0957E          VALUE 'Y'.
       78  XPC-FLD0958B
           VALUE X'4387549590870288'.
       78  XPC-FLD0958E          VALUE 'N'.
       78  XPC-FLD0959B
           VALUE X'1C'.
       78  XPC-FLD0959E          VALUE 'N'.
       78  XPC-FLD0960B
           VALUE X'0C'.
       78  XPC-FLD0960E          VALUE 'Y'.
       78  XPC-FLD0961B
           VALUE X'00055C'.
       78  XPC-FLD0961E          VALUE 'N'.
       78  XPC-FLD0962B
           VALUE X'6826560363239254262940346F'.
       78  XPC-FLD0962E          VALUE 'N'.
       78  XPC-FLD0963B
           VALUE X'06579508606108431242392875'.
       78  XPC-FLD0963E          VALUE 'N'.
       78  XPC-FLD0964B
           VALUE X'0399362942016605604323'.
       78  XPC-FLD0964E          VALUE 'N'.
       78  XPC-FLD0965B
           VALUE X'01'.
       78  XPC-FLD0965E          VALUE 'N'.
       78  XPC-FLD0966B
           VALUE X'00005571'.
       78  XPC-FLD0966E          VALUE 'N'.
       78  XPC-FLD0967B
           VALUE X'03560456473147'.
       78  XPC-FLD0967E          VALUE 'N'.
       78  XPC-FLD0968B
           VALUE X'05531D'.
       78  XPC-FLD0968E          VALUE 'N'.
       78  XPC-FLD0969B
           VALUE X'05945236920989867723715F'.
       78  XPC-FLD0969E          VALUE 'N'.
       78  XPC-FLD0970B
           VALUE X'433217720233246760537693012156523765'.
       78  XPC-FLD0970E          VALUE 'N'.
       78  XPC-FLD0971B
           VALUE X'402866616015322C'.
       78  XPC-FLD0971E          VALUE 'N'.
       78  XPC-FLD0972B
           VALUE X'013649'.
       78  XPC-FLD0972E          VALUE 'Y'.
       78  XPC-FLD0973B
           VALUE X'08420775282429751358819203232997'.
       78  XPC-FLD0973E          VALUE 'N'.
       78  XPC-FLD0974B
           VALUE X'076D'.
       78  XPC-FLD0974E          VALUE 'N'.
       78  XPC-FLD0975B
           VALUE X'329183574054'.
       78  XPC-FLD0975E          VALUE 'N'.
       78  XPC-FLD0976B
           VALUE X'05189195631532426046'.
       78  XPC-FLD0976E          VALUE 'N'.
       78  XPC-FLD0977B
           VALUE X'006577733509987D'.
       78  XPC-FLD0977E          VALUE 'N'.
       78  XPC-FLD0978B
           VALUE X'263651133125829D'.
       78  XPC-FLD0978E          VALUE 'N'.
       78  XPC-FLD0979B
           VALUE X'38851072771966'.
       78  XPC-FLD0979E          VALUE 'N'.
       78  XPC-FLD0980B
           VALUE X'647159056743324437308229'.
       78  XPC-FLD0980E          VALUE 'N'.
       78  XPC-FLD0981B
           VALUE X'3602784782762D'.
       78  XPC-FLD0981E          VALUE 'N'.
       78  XPC-FLD0982B
           VALUE X'30653235443C'.
       78  XPC-FLD0982E          VALUE 'N'.
       78  XPC-FLD0983B
           VALUE X'882516211995383510538363225350622087'.
       78  XPC-FLD0983E          VALUE 'N'.
       78  XPC-FLD0984B
           VALUE X'04457843883822408592'.
       78  XPC-FLD0984E          VALUE 'N'.
       78  XPC-FLD0985B
           VALUE X'496108848273749947698929645412135F'.
       78  XPC-FLD0985E          VALUE 'N'.
       78  XPC-FLD0986B
           VALUE X'08'.
       78  XPC-FLD0986E          VALUE 'N'.
       78  XPC-FLD0987B
           VALUE X'084253493742279825972518736421079F'.
       78  XPC-FLD0987E          VALUE 'N'.
       78  XPC-FLD0988B
           VALUE X'0181520D'.
       78  XPC-FLD0988E          VALUE 'N'.
       78  XPC-FLD0989B
           VALUE X'05932140179792923634499F'.
       78  XPC-FLD0989E          VALUE 'N'.
       78  XPC-FLD0990B
           VALUE X'02089861'.
       78  XPC-FLD0990E          VALUE 'Y'.
       78  XPC-FLD0991B
           VALUE X'404273028987099C'.
       78  XPC-FLD0991E          VALUE 'N'.
       78  XPC-FLD0992B
           VALUE X'518805985017170789852514182650362F'.
       78  XPC-FLD0992E          VALUE 'N'.
       78  XPC-FLD0993B
           VALUE X'01132C'.
       78  XPC-FLD0993E          VALUE 'Y'.
       78  XPC-FLD0994B
           VALUE X'0484793408353182154D'.
       78  XPC-FLD0994E          VALUE 'N'.
       78  XPC-FLD0995B
           VALUE X'01888258'.
       78  XPC-FLD0995E          VALUE 'N'.
       78  XPC-FLD0996B
           VALUE X'00505105346267128441084558'.
       78  XPC-FLD0996E          VALUE 'N'.
       78  XPC-FLD0997B
           VALUE X'0011799546758455291F'.
       78  XPC-FLD0997E          VALUE 'N'.
       78  XPC-FLD0998B
           VALUE X'3D'.
       78  XPC-FLD0998E          VALUE 'N'.
       78  XPC-FLD0999B
           VALUE X'0C'.
       78  XPC-FLD0999E          VALUE 'Y'.

       01  FILLER       USAGE BINARY-INT VALUE 0.
           88 DO-DISP   VALUE 0.
           88 NO-DISP   VALUE 1.

       REPLACE ==DISPLAY== BY ==IF DO-DISP  DISPLAY==.
       PROCEDURE        DIVISION.
       MAIN.
      *    Test with DISPLAY on error
           PERFORM DO-CHECK.
       >> IF CHECK-PERF IS DEFINED
           SET  NO-DISP    TO TRUE
      *    some performance checks on the way...
           PERFORM DO-CHECK 10000 TIMES.
       >> END-IF
           GOBACK.

       DO-CHECK.
      *2000-TEST.

           SUBTRACT FLD0500A        FROM FLD0500B.
           ADD FLD0501A        TO FLD0501B
               ON SIZE ERROR MOVE 'Y' TO FLD0501E.
           SUBTRACT FLD0502A        FROM FLD0502B.
           ADD FLD0503A        TO FLD0503B.
           SUBTRACT FLD0504A        FROM FLD0504B
               ON SIZE ERROR MOVE 'Y' TO FLD0504E.
           ADD FLD0505A        TO FLD0505B.
           SUBTRACT FLD0506A        FROM FLD0506B.
           ADD FLD0507A        TO FLD0507B
               ON SIZE ERROR MOVE 'Y' TO FLD0507E.
           SUBTRACT FLD0508A        FROM FLD0508B.
           ADD FLD0509A        TO FLD0509B.
           SUBTRACT FLD0510A        FROM FLD0510B
               ON SIZE ERROR MOVE 'Y' TO FLD0510E.
           ADD FLD0511A        TO FLD0511B.
           SUBTRACT FLD0512A        FROM FLD0512B.
           ADD FLD0513A        TO FLD0513B
               ON SIZE ERROR MOVE 'Y' TO FLD0513E.
           SUBTRACT FLD0514A        FROM FLD0514B.
           ADD FLD0515A        TO FLD0515B.
           SUBTRACT FLD0516A        FROM FLD0516B
               ON SIZE ERROR MOVE 'Y' TO FLD0516E.
           ADD FLD0517A        TO FLD0517B.
           SUBTRACT FLD0518A        FROM FLD0518B.
           ADD FLD0519A        TO FLD0519B
               ON SIZE ERROR MOVE 'Y' TO FLD0519E.
           SUBTRACT FLD0520A        FROM FLD0520B.
           ADD FLD0521A        TO FLD0521B.
           SUBTRACT FLD0522A        FROM FLD0522B
               ON SIZE ERROR MOVE 'Y' TO FLD0522E.
           ADD FLD0523A        TO FLD0523B.
           SUBTRACT FLD0524A        FROM FLD0524B.
           ADD FLD0525A        TO FLD0525B
               ON SIZE ERROR MOVE 'Y' TO FLD0525E.
           SUBTRACT FLD0526A        FROM FLD0526B.
           ADD FLD0527A        TO FLD0527B.
           SUBTRACT FLD0528A        FROM FLD0528B
               ON SIZE ERROR MOVE 'Y' TO FLD0528E.
           ADD FLD0529A        TO FLD0529B.
           SUBTRACT FLD0530A        FROM FLD0530B.
           ADD FLD0531A        TO FLD0531B
               ON SIZE ERROR MOVE 'Y' TO FLD0531E.
           SUBTRACT FLD0532A        FROM FLD0532B.
           ADD FLD0533A        TO FLD0533B.
           SUBTRACT FLD0534A        FROM FLD0534B
               ON SIZE ERROR MOVE 'Y' TO FLD0534E.
           ADD FLD0535A        TO FLD0535B.
           SUBTRACT FLD0536A        FROM FLD0536B.
           ADD FLD0537A        TO FLD0537B
               ON SIZE ERROR MOVE 'Y' TO FLD0537E.
           SUBTRACT FLD0538A        FROM FLD0538B.
           ADD FLD0539A        TO FLD0539B.
           SUBTRACT FLD0540A        FROM FLD0540B
               ON SIZE ERROR MOVE 'Y' TO FLD0540E.
           ADD FLD0541A        TO FLD0541B.
           SUBTRACT FLD0542A        FROM FLD0542B.
           ADD FLD0543A        TO FLD0543B
               ON SIZE ERROR MOVE 'Y' TO FLD0543E.
           SUBTRACT FLD0544A        FROM FLD0544B.
           ADD FLD0545A        TO FLD0545B.
           SUBTRACT FLD0546A        FROM FLD0546B
               ON SIZE ERROR MOVE 'Y' TO FLD0546E.
           ADD FLD0547A        TO FLD0547B.
           SUBTRACT FLD0548A        FROM FLD0548B.
           ADD FLD0549A        TO FLD0549B
               ON SIZE ERROR MOVE 'Y' TO FLD0549E.
           SUBTRACT FLD0550A        FROM FLD0550B.
           ADD FLD0551A        TO FLD0551B.
           SUBTRACT FLD0552A        FROM FLD0552B
               ON SIZE ERROR MOVE 'Y' TO FLD0552E.
           ADD FLD0553A        TO FLD0553B.
           SUBTRACT FLD0554A        FROM FLD0554B.
           ADD FLD0555A        TO FLD0555B
               ON SIZE ERROR MOVE 'Y' TO FLD0555E.
           SUBTRACT FLD0556A        FROM FLD0556B.
           ADD FLD0557A        TO FLD0557B.
           SUBTRACT FLD0558A        FROM FLD0558B
               ON SIZE ERROR MOVE 'Y' TO FLD0558E.
           ADD FLD0559A        TO FLD0559B.
           SUBTRACT FLD0560A        FROM FLD0560B.
           ADD FLD0561A        TO FLD0561B
               ON SIZE ERROR MOVE 'Y' TO FLD0561E.
           SUBTRACT FLD0562A        FROM FLD0562B.
           ADD FLD0563A        TO FLD0563B.
           SUBTRACT FLD0564A        FROM FLD0564B
               ON SIZE ERROR MOVE 'Y' TO FLD0564E.
           ADD FLD0565A        TO FLD0565B.
           SUBTRACT FLD0566A        FROM FLD0566B.
           ADD FLD0567A        TO FLD0567B
               ON SIZE ERROR MOVE 'Y' TO FLD0567E.
           SUBTRACT FLD0568A        FROM FLD0568B.
           ADD FLD0569A        TO FLD0569B.
           SUBTRACT FLD0570A        FROM FLD0570B
               ON SIZE ERROR MOVE 'Y' TO FLD0570E.
           ADD FLD0571A        TO FLD0571B.
           SUBTRACT FLD0572A        FROM FLD0572B.
           ADD FLD0573A        TO FLD0573B
               ON SIZE ERROR MOVE 'Y' TO FLD0573E.
           SUBTRACT FLD0574A        FROM FLD0574B.
           ADD FLD0575A        TO FLD0575B.
           SUBTRACT FLD0576A        FROM FLD0576B
               ON SIZE ERROR MOVE 'Y' TO FLD0576E.
           ADD FLD0577A        TO FLD0577B.
           SUBTRACT FLD0578A        FROM FLD0578B.
           ADD FLD0579A        TO FLD0579B
               ON SIZE ERROR MOVE 'Y' TO FLD0579E.
           SUBTRACT FLD0580A        FROM FLD0580B.
           ADD FLD0581A        TO FLD0581B.
           SUBTRACT FLD0582A        FROM FLD0582B
               ON SIZE ERROR MOVE 'Y' TO FLD0582E.
           ADD FLD0583A        TO FLD0583B.
           SUBTRACT FLD0584A        FROM FLD0584B.
           ADD FLD0585A        TO FLD0585B
               ON SIZE ERROR MOVE 'Y' TO FLD0585E.
           SUBTRACT FLD0586A        FROM FLD0586B.
           ADD FLD0587A        TO FLD0587B.
           SUBTRACT FLD0588A        FROM FLD0588B
               ON SIZE ERROR MOVE 'Y' TO FLD0588E.
           ADD FLD0589A        TO FLD0589B.
           SUBTRACT FLD0590A        FROM FLD0590B.
           ADD FLD0591A        TO FLD0591B
               ON SIZE ERROR MOVE 'Y' TO FLD0591E.
           SUBTRACT FLD0592A        FROM FLD0592B.
           ADD FLD0593A        TO FLD0593B.
           SUBTRACT FLD0594A        FROM FLD0594B
               ON SIZE ERROR MOVE 'Y' TO FLD0594E.
           ADD FLD0595A        TO FLD0595B.
           SUBTRACT FLD0596A        FROM FLD0596B.
           ADD FLD0597A        TO FLD0597B
               ON SIZE ERROR MOVE 'Y' TO FLD0597E.
           SUBTRACT FLD0598A        FROM FLD0598B.
           ADD FLD0599A        TO FLD0599B.
           SUBTRACT FLD0600A        FROM FLD0600B
               ON SIZE ERROR MOVE 'Y' TO FLD0600E.
           ADD FLD0601A        TO FLD0601B.
           SUBTRACT FLD0602A        FROM FLD0602B.
           ADD FLD0603A        TO FLD0603B
               ON SIZE ERROR MOVE 'Y' TO FLD0603E.
           SUBTRACT FLD0604A        FROM FLD0604B.
           ADD FLD0605A        TO FLD0605B.
           SUBTRACT FLD0606A        FROM FLD0606B
               ON SIZE ERROR MOVE 'Y' TO FLD0606E.
           ADD FLD0607A        TO FLD0607B.
           SUBTRACT FLD0608A        FROM FLD0608B.
           ADD FLD0609A        TO FLD0609B
               ON SIZE ERROR MOVE 'Y' TO FLD0609E.
           SUBTRACT FLD0610A        FROM FLD0610B.
           ADD FLD0611A        TO FLD0611B.
           SUBTRACT FLD0612A        FROM FLD0612B
               ON SIZE ERROR MOVE 'Y' TO FLD0612E.
           ADD FLD0613A        TO FLD0613B.
           SUBTRACT FLD0614A        FROM FLD0614B.
           ADD FLD0615A        TO FLD0615B
               ON SIZE ERROR MOVE 'Y' TO FLD0615E.
           SUBTRACT FLD0616A        FROM FLD0616B.
           ADD FLD0617A        TO FLD0617B.
           SUBTRACT FLD0618A        FROM FLD0618B
               ON SIZE ERROR MOVE 'Y' TO FLD0618E.
           ADD FLD0619A        TO FLD0619B.
           SUBTRACT FLD0620A        FROM FLD0620B.
           ADD FLD0621A        TO FLD0621B
               ON SIZE ERROR MOVE 'Y' TO FLD0621E.
           SUBTRACT FLD0622A        FROM FLD0622B.
           ADD FLD0623A        TO FLD0623B.
           SUBTRACT FLD0624A        FROM FLD0624B
               ON SIZE ERROR MOVE 'Y' TO FLD0624E.
           ADD FLD0625A        TO FLD0625B.
           SUBTRACT FLD0626A        FROM FLD0626B.
           ADD FLD0627A        TO FLD0627B
               ON SIZE ERROR MOVE 'Y' TO FLD0627E.
           SUBTRACT FLD0628A        FROM FLD0628B.
           ADD FLD0629A        TO FLD0629B.
           SUBTRACT FLD0630A        FROM FLD0630B
               ON SIZE ERROR MOVE 'Y' TO FLD0630E.
           ADD FLD0631A        TO FLD0631B.
           SUBTRACT FLD0632A        FROM FLD0632B.
           ADD FLD0633A        TO FLD0633B
               ON SIZE ERROR MOVE 'Y' TO FLD0633E.
           SUBTRACT FLD0634A        FROM FLD0634B.
           ADD FLD0635A        TO FLD0635B.
           SUBTRACT FLD0636A        FROM FLD0636B
               ON SIZE ERROR MOVE 'Y' TO FLD0636E.
           ADD FLD0637A        TO FLD0637B.
           SUBTRACT FLD0638A        FROM FLD0638B.
           ADD FLD0639A        TO FLD0639B
               ON SIZE ERROR MOVE 'Y' TO FLD0639E.
           SUBTRACT FLD0640A        FROM FLD0640B.
           ADD FLD0641A        TO FLD0641B.
           SUBTRACT FLD0642A        FROM FLD0642B
               ON SIZE ERROR MOVE 'Y' TO FLD0642E.
           ADD FLD0643A        TO FLD0643B.
           SUBTRACT FLD0644A        FROM FLD0644B.
           ADD FLD0645A        TO FLD0645B
               ON SIZE ERROR MOVE 'Y' TO FLD0645E.
           SUBTRACT FLD0646A        FROM FLD0646B.
           ADD FLD0647A        TO FLD0647B.
           SUBTRACT FLD0648A        FROM FLD0648B
               ON SIZE ERROR MOVE 'Y' TO FLD0648E.
           ADD FLD0649A        TO FLD0649B.
           SUBTRACT FLD0650A        FROM FLD0650B.
           ADD FLD0651A        TO FLD0651B
               ON SIZE ERROR MOVE 'Y' TO FLD0651E.
           SUBTRACT FLD0652A        FROM FLD0652B.
           ADD FLD0653A        TO FLD0653B.
           SUBTRACT FLD0654A        FROM FLD0654B
               ON SIZE ERROR MOVE 'Y' TO FLD0654E.
           ADD FLD0655A        TO FLD0655B.
           SUBTRACT FLD0656A        FROM FLD0656B.
           ADD FLD0657A        TO FLD0657B
               ON SIZE ERROR MOVE 'Y' TO FLD0657E.
           SUBTRACT FLD0658A        FROM FLD0658B.
           ADD FLD0659A        TO FLD0659B.
           SUBTRACT FLD0660A        FROM FLD0660B
               ON SIZE ERROR MOVE 'Y' TO FLD0660E.
           ADD FLD0661A        TO FLD0661B.
           SUBTRACT FLD0662A        FROM FLD0662B.
           ADD FLD0663A        TO FLD0663B
               ON SIZE ERROR MOVE 'Y' TO FLD0663E.
           SUBTRACT FLD0664A        FROM FLD0664B.
           ADD FLD0665A        TO FLD0665B.
           SUBTRACT FLD0666A        FROM FLD0666B
               ON SIZE ERROR MOVE 'Y' TO FLD0666E.
           ADD FLD0667A        TO FLD0667B.
           SUBTRACT FLD0668A        FROM FLD0668B.
           ADD FLD0669A        TO FLD0669B
               ON SIZE ERROR MOVE 'Y' TO FLD0669E.
           SUBTRACT FLD0670A        FROM FLD0670B.
           ADD FLD0671A        TO FLD0671B.
           SUBTRACT FLD0672A        FROM FLD0672B
               ON SIZE ERROR MOVE 'Y' TO FLD0672E.
           ADD FLD0673A        TO FLD0673B.
           SUBTRACT FLD0674A        FROM FLD0674B.
           ADD FLD0675A        TO FLD0675B
               ON SIZE ERROR MOVE 'Y' TO FLD0675E.
           SUBTRACT FLD0676A        FROM FLD0676B.
           ADD FLD0677A        TO FLD0677B.
           SUBTRACT FLD0678A        FROM FLD0678B
               ON SIZE ERROR MOVE 'Y' TO FLD0678E.
           ADD FLD0679A        TO FLD0679B.
           SUBTRACT FLD0680A        FROM FLD0680B.
           ADD FLD0681A        TO FLD0681B
               ON SIZE ERROR MOVE 'Y' TO FLD0681E.
           SUBTRACT FLD0682A        FROM FLD0682B.
           ADD FLD0683A        TO FLD0683B.
           SUBTRACT FLD0684A        FROM FLD0684B
               ON SIZE ERROR MOVE 'Y' TO FLD0684E.
           ADD FLD0685A        TO FLD0685B.
           SUBTRACT FLD0686A        FROM FLD0686B.
           ADD FLD0687A        TO FLD0687B
               ON SIZE ERROR MOVE 'Y' TO FLD0687E.
           SUBTRACT FLD0688A        FROM FLD0688B.
           ADD FLD0689A        TO FLD0689B.
           SUBTRACT FLD0690A        FROM FLD0690B
               ON SIZE ERROR MOVE 'Y' TO FLD0690E.
           ADD FLD0691A        TO FLD0691B.
           SUBTRACT FLD0692A        FROM FLD0692B.
           ADD FLD0693A        TO FLD0693B
               ON SIZE ERROR MOVE 'Y' TO FLD0693E.
           SUBTRACT FLD0694A        FROM FLD0694B.
           ADD FLD0695A        TO FLD0695B.
           SUBTRACT FLD0696A        FROM FLD0696B
               ON SIZE ERROR MOVE 'Y' TO FLD0696E.
           ADD FLD0697A        TO FLD0697B.
           SUBTRACT FLD0698A        FROM FLD0698B.
           ADD FLD0699A        TO FLD0699B
               ON SIZE ERROR MOVE 'Y' TO FLD0699E.
           SUBTRACT FLD0700A        FROM FLD0700B.
           ADD FLD0701A        TO FLD0701B.
           SUBTRACT FLD0702A        FROM FLD0702B
               ON SIZE ERROR MOVE 'Y' TO FLD0702E.
           ADD FLD0703A        TO FLD0703B.
           SUBTRACT FLD0704A        FROM FLD0704B.
           ADD FLD0705A        TO FLD0705B
               ON SIZE ERROR MOVE 'Y' TO FLD0705E.
           SUBTRACT FLD0706A        FROM FLD0706B.
           ADD FLD0707A        TO FLD0707B.
           SUBTRACT FLD0708A        FROM FLD0708B
               ON SIZE ERROR MOVE 'Y' TO FLD0708E.
           ADD FLD0709A        TO FLD0709B.
           SUBTRACT FLD0710A        FROM FLD0710B.
           ADD FLD0711A        TO FLD0711B
               ON SIZE ERROR MOVE 'Y' TO FLD0711E.
           SUBTRACT FLD0712A        FROM FLD0712B.
           ADD FLD0713A        TO FLD0713B.
           SUBTRACT FLD0714A        FROM FLD0714B
               ON SIZE ERROR MOVE 'Y' TO FLD0714E.
           ADD FLD0715A        TO FLD0715B.
           SUBTRACT FLD0716A        FROM FLD0716B.
           ADD FLD0717A        TO FLD0717B
               ON SIZE ERROR MOVE 'Y' TO FLD0717E.
           SUBTRACT FLD0718A        FROM FLD0718B.
           ADD FLD0719A        TO FLD0719B.
           SUBTRACT FLD0720A        FROM FLD0720B
               ON SIZE ERROR MOVE 'Y' TO FLD0720E.
           ADD FLD0721A        TO FLD0721B.
           SUBTRACT FLD0722A        FROM FLD0722B.
           ADD FLD0723A        TO FLD0723B
               ON SIZE ERROR MOVE 'Y' TO FLD0723E.
           SUBTRACT FLD0724A        FROM FLD0724B.
           ADD FLD0725A        TO FLD0725B.
           SUBTRACT FLD0726A        FROM FLD0726B
               ON SIZE ERROR MOVE 'Y' TO FLD0726E.
           ADD FLD0727A        TO FLD0727B.
           SUBTRACT FLD0728A        FROM FLD0728B.
           ADD FLD0729A        TO FLD0729B
               ON SIZE ERROR MOVE 'Y' TO FLD0729E.
           SUBTRACT FLD0730A        FROM FLD0730B.
           ADD FLD0731A        TO FLD0731B.
           SUBTRACT FLD0732A        FROM FLD0732B
               ON SIZE ERROR MOVE 'Y' TO FLD0732E.
           ADD FLD0733A        TO FLD0733B.
           SUBTRACT FLD0734A        FROM FLD0734B.
           ADD FLD0735A        TO FLD0735B
               ON SIZE ERROR MOVE 'Y' TO FLD0735E.
           SUBTRACT FLD0736A        FROM FLD0736B.
           ADD FLD0737A        TO FLD0737B.
           SUBTRACT FLD0738A        FROM FLD0738B
               ON SIZE ERROR MOVE 'Y' TO FLD0738E.
           ADD FLD0739A        TO FLD0739B.
           SUBTRACT FLD0740A        FROM FLD0740B.
           ADD FLD0741A        TO FLD0741B
               ON SIZE ERROR MOVE 'Y' TO FLD0741E.
           SUBTRACT FLD0742A        FROM FLD0742B.
           ADD FLD0743A        TO FLD0743B.
           SUBTRACT FLD0744A        FROM FLD0744B
               ON SIZE ERROR MOVE 'Y' TO FLD0744E.
           ADD FLD0745A        TO FLD0745B.
           SUBTRACT FLD0746A        FROM FLD0746B.
           ADD FLD0747A        TO FLD0747B
               ON SIZE ERROR MOVE 'Y' TO FLD0747E.
           SUBTRACT FLD0748A        FROM FLD0748B.
           ADD FLD0749A        TO FLD0749B.
           SUBTRACT FLD0750A        FROM FLD0750B
               ON SIZE ERROR MOVE 'Y' TO FLD0750E.
           ADD FLD0751A        TO FLD0751B.
           SUBTRACT FLD0752A        FROM FLD0752B.
           ADD FLD0753A        TO FLD0753B
               ON SIZE ERROR MOVE 'Y' TO FLD0753E.
           SUBTRACT FLD0754A        FROM FLD0754B.
           ADD FLD0755A        TO FLD0755B.
           SUBTRACT FLD0756A        FROM FLD0756B
               ON SIZE ERROR MOVE 'Y' TO FLD0756E.
           ADD FLD0757A        TO FLD0757B.
           SUBTRACT FLD0758A        FROM FLD0758B.
           ADD FLD0759A        TO FLD0759B
               ON SIZE ERROR MOVE 'Y' TO FLD0759E.
           SUBTRACT FLD0760A        FROM FLD0760B.
           ADD FLD0761A        TO FLD0761B.
           SUBTRACT FLD0762A        FROM FLD0762B
               ON SIZE ERROR MOVE 'Y' TO FLD0762E.
           ADD FLD0763A        TO FLD0763B.
           SUBTRACT FLD0764A        FROM FLD0764B.
           ADD FLD0765A        TO FLD0765B
               ON SIZE ERROR MOVE 'Y' TO FLD0765E.
           SUBTRACT FLD0766A        FROM FLD0766B.
           ADD FLD0767A        TO FLD0767B.
           SUBTRACT FLD0768A        FROM FLD0768B
               ON SIZE ERROR MOVE 'Y' TO FLD0768E.
           ADD FLD0769A        TO FLD0769B.
           SUBTRACT FLD0770A        FROM FLD0770B.
           ADD FLD0771A        TO FLD0771B
               ON SIZE ERROR MOVE 'Y' TO FLD0771E.
           SUBTRACT FLD0772A        FROM FLD0772B.
           ADD FLD0773A        TO FLD0773B.
           SUBTRACT FLD0774A        FROM FLD0774B
               ON SIZE ERROR MOVE 'Y' TO FLD0774E.
           ADD FLD0775A        TO FLD0775B.
           SUBTRACT FLD0776A        FROM FLD0776B.
           ADD FLD0777A        TO FLD0777B
               ON SIZE ERROR MOVE 'Y' TO FLD0777E.
           SUBTRACT FLD0778A        FROM FLD0778B.
           ADD FLD0779A        TO FLD0779B.
           SUBTRACT FLD0780A        FROM FLD0780B
               ON SIZE ERROR MOVE 'Y' TO FLD0780E.
           ADD FLD0781A        TO FLD0781B.
           SUBTRACT FLD0782A        FROM FLD0782B.
           ADD FLD0783A        TO FLD0783B
               ON SIZE ERROR MOVE 'Y' TO FLD0783E.
           SUBTRACT FLD0784A        FROM FLD0784B.
           ADD FLD0785A        TO FLD0785B.
           SUBTRACT FLD0786A        FROM FLD0786B
               ON SIZE ERROR MOVE 'Y' TO FLD0786E.
           ADD FLD0787A        TO FLD0787B.
           SUBTRACT FLD0788A        FROM FLD0788B.
           ADD FLD0789A        TO FLD0789B
               ON SIZE ERROR MOVE 'Y' TO FLD0789E.
           SUBTRACT FLD0790A        FROM FLD0790B.
           ADD FLD0791A        TO FLD0791B.
           SUBTRACT FLD0792A        FROM FLD0792B
               ON SIZE ERROR MOVE 'Y' TO FLD0792E.
           ADD FLD0793A        TO FLD0793B.
           SUBTRACT FLD0794A        FROM FLD0794B.
           ADD FLD0795A        TO FLD0795B
               ON SIZE ERROR MOVE 'Y' TO FLD0795E.
           SUBTRACT FLD0796A        FROM FLD0796B.
           ADD FLD0797A        TO FLD0797B.
           SUBTRACT FLD0798A        FROM FLD0798B
               ON SIZE ERROR MOVE 'Y' TO FLD0798E.
           ADD FLD0799A        TO FLD0799B.
           SUBTRACT FLD0800A        FROM FLD0800B.
           ADD FLD0801A        TO FLD0801B
               ON SIZE ERROR MOVE 'Y' TO FLD0801E.
           SUBTRACT FLD0802A        FROM FLD0802B.
           ADD FLD0803A        TO FLD0803B.
           SUBTRACT FLD0804A        FROM FLD0804B
               ON SIZE ERROR MOVE 'Y' TO FLD0804E.
           ADD FLD0805A        TO FLD0805B.
           SUBTRACT FLD0806A        FROM FLD0806B.
           ADD FLD0807A        TO FLD0807B
               ON SIZE ERROR MOVE 'Y' TO FLD0807E.
           SUBTRACT FLD0808A        FROM FLD0808B.
           ADD FLD0809A        TO FLD0809B.
           SUBTRACT FLD0810A        FROM FLD0810B
               ON SIZE ERROR MOVE 'Y' TO FLD0810E.
           ADD FLD0811A        TO FLD0811B.
           SUBTRACT FLD0812A        FROM FLD0812B.
           ADD FLD0813A        TO FLD0813B
               ON SIZE ERROR MOVE 'Y' TO FLD0813E.
           SUBTRACT FLD0814A        FROM FLD0814B.
           ADD FLD0815A        TO FLD0815B.
           SUBTRACT FLD0816A        FROM FLD0816B
               ON SIZE ERROR MOVE 'Y' TO FLD0816E.
           ADD FLD0817A        TO FLD0817B.
           SUBTRACT FLD0818A        FROM FLD0818B.
           ADD FLD0819A        TO FLD0819B
               ON SIZE ERROR MOVE 'Y' TO FLD0819E.
           SUBTRACT FLD0820A        FROM FLD0820B.
           ADD FLD0821A        TO FLD0821B.
           SUBTRACT FLD0822A        FROM FLD0822B
               ON SIZE ERROR MOVE 'Y' TO FLD0822E.
           ADD FLD0823A        TO FLD0823B.
           SUBTRACT FLD0824A        FROM FLD0824B.
           ADD FLD0825A        TO FLD0825B
               ON SIZE ERROR MOVE 'Y' TO FLD0825E.
           SUBTRACT FLD0826A        FROM FLD0826B.
           ADD FLD0827A        TO FLD0827B.
           SUBTRACT FLD0828A        FROM FLD0828B
               ON SIZE ERROR MOVE 'Y' TO FLD0828E.
           ADD FLD0829A        TO FLD0829B.
           SUBTRACT FLD0830A        FROM FLD0830B.
           ADD FLD0831A        TO FLD0831B
               ON SIZE ERROR MOVE 'Y' TO FLD0831E.
           SUBTRACT FLD0832A        FROM FLD0832B.
           ADD FLD0833A        TO FLD0833B.
           SUBTRACT FLD0834A        FROM FLD0834B
               ON SIZE ERROR MOVE 'Y' TO FLD0834E.
           ADD FLD0835A        TO FLD0835B.
           SUBTRACT FLD0836A        FROM FLD0836B.
           ADD FLD0837A        TO FLD0837B
               ON SIZE ERROR MOVE 'Y' TO FLD0837E.
           SUBTRACT FLD0838A        FROM FLD0838B.
           ADD FLD0839A        TO FLD0839B.
           SUBTRACT FLD0840A        FROM FLD0840B
               ON SIZE ERROR MOVE 'Y' TO FLD0840E.
           ADD FLD0841A        TO FLD0841B.
           SUBTRACT FLD0842A        FROM FLD0842B.
           ADD FLD0843A        TO FLD0843B
               ON SIZE ERROR MOVE 'Y' TO FLD0843E.
           SUBTRACT FLD0844A        FROM FLD0844B.
           ADD FLD0845A        TO FLD0845B.
           SUBTRACT FLD0846A        FROM FLD0846B
               ON SIZE ERROR MOVE 'Y' TO FLD0846E.
           ADD FLD0847A        TO FLD0847B.
           SUBTRACT FLD0848A        FROM FLD0848B.
           ADD FLD0849A        TO FLD0849B
               ON SIZE ERROR MOVE 'Y' TO FLD0849E.
           SUBTRACT FLD0850A        FROM FLD0850B.
           ADD FLD0851A        TO FLD0851B.
           SUBTRACT FLD0852A        FROM FLD0852B
               ON SIZE ERROR MOVE 'Y' TO FLD0852E.
           ADD FLD0853A        TO FLD0853B.
           SUBTRACT FLD0854A        FROM FLD0854B.
           ADD FLD0855A        TO FLD0855B
               ON SIZE ERROR MOVE 'Y' TO FLD0855E.
           SUBTRACT FLD0856A        FROM FLD0856B.
           ADD FLD0857A        TO FLD0857B.
           SUBTRACT FLD0858A        FROM FLD0858B
               ON SIZE ERROR MOVE 'Y' TO FLD0858E.
           ADD FLD0859A        TO FLD0859B.
           SUBTRACT FLD0860A        FROM FLD0860B.
           ADD FLD0861A        TO FLD0861B
               ON SIZE ERROR MOVE 'Y' TO FLD0861E.
           SUBTRACT FLD0862A        FROM FLD0862B.
           ADD FLD0863A        TO FLD0863B.
           SUBTRACT FLD0864A        FROM FLD0864B
               ON SIZE ERROR MOVE 'Y' TO FLD0864E.
           ADD FLD0865A        TO FLD0865B.
           SUBTRACT FLD0866A        FROM FLD0866B.
           ADD FLD0867A        TO FLD0867B
               ON SIZE ERROR MOVE 'Y' TO FLD0867E.
           SUBTRACT FLD0868A        FROM FLD0868B.
           ADD FLD0869A        TO FLD0869B.
           SUBTRACT FLD0870A        FROM FLD0870B
               ON SIZE ERROR MOVE 'Y' TO FLD0870E.
           ADD FLD0871A        TO FLD0871B.
           SUBTRACT FLD0872A        FROM FLD0872B.
           ADD FLD0873A        TO FLD0873B
               ON SIZE ERROR MOVE 'Y' TO FLD0873E.
           SUBTRACT FLD0874A        FROM FLD0874B.
           ADD FLD0875A        TO FLD0875B.
           SUBTRACT FLD0876A        FROM FLD0876B
               ON SIZE ERROR MOVE 'Y' TO FLD0876E.
           ADD FLD0877A        TO FLD0877B.
           SUBTRACT FLD0878A        FROM FLD0878B.
           ADD FLD0879A        TO FLD0879B
               ON SIZE ERROR MOVE 'Y' TO FLD0879E.
           SUBTRACT FLD0880A        FROM FLD0880B.
           ADD FLD0881A        TO FLD0881B.
           SUBTRACT FLD0882A        FROM FLD0882B
               ON SIZE ERROR MOVE 'Y' TO FLD0882E.
           ADD FLD0883A        TO FLD0883B.
           SUBTRACT FLD0884A        FROM FLD0884B.
           ADD FLD0885A        TO FLD0885B
               ON SIZE ERROR MOVE 'Y' TO FLD0885E.
           SUBTRACT FLD0886A        FROM FLD0886B.
           ADD FLD0887A        TO FLD0887B.
           SUBTRACT FLD0888A        FROM FLD0888B
               ON SIZE ERROR MOVE 'Y' TO FLD0888E.
           ADD FLD0889A        TO FLD0889B.
           SUBTRACT FLD0890A        FROM FLD0890B.
           ADD FLD0891A        TO FLD0891B
               ON SIZE ERROR MOVE 'Y' TO FLD0891E.
           SUBTRACT FLD0892A        FROM FLD0892B.
           ADD FLD0893A        TO FLD0893B.
           SUBTRACT FLD0894A        FROM FLD0894B
               ON SIZE ERROR MOVE 'Y' TO FLD0894E.
           ADD FLD0895A        TO FLD0895B.
           SUBTRACT FLD0896A        FROM FLD0896B.
           ADD FLD0897A        TO FLD0897B
               ON SIZE ERROR MOVE 'Y' TO FLD0897E.
           SUBTRACT FLD0898A        FROM FLD0898B.
           ADD FLD0899A        TO FLD0899B.
           SUBTRACT FLD0900A        FROM FLD0900B
               ON SIZE ERROR MOVE 'Y' TO FLD0900E.
           ADD FLD0901A        TO FLD0901B.
           SUBTRACT FLD0902A        FROM FLD0902B.
           ADD FLD0903A        TO FLD0903B
               ON SIZE ERROR MOVE 'Y' TO FLD0903E.
           SUBTRACT FLD0904A        FROM FLD0904B.
           ADD FLD0905A        TO FLD0905B.
           SUBTRACT FLD0906A        FROM FLD0906B
               ON SIZE ERROR MOVE 'Y' TO FLD0906E.
           ADD FLD0907A        TO FLD0907B.
           SUBTRACT FLD0908A        FROM FLD0908B.
           ADD FLD0909A        TO FLD0909B
               ON SIZE ERROR MOVE 'Y' TO FLD0909E.
           SUBTRACT FLD0910A        FROM FLD0910B.
           ADD FLD0911A        TO FLD0911B.
           SUBTRACT FLD0912A        FROM FLD0912B
               ON SIZE ERROR MOVE 'Y' TO FLD0912E.
           ADD FLD0913A        TO FLD0913B.
           SUBTRACT FLD0914A        FROM FLD0914B.
           ADD FLD0915A        TO FLD0915B
               ON SIZE ERROR MOVE 'Y' TO FLD0915E.
           SUBTRACT FLD0916A        FROM FLD0916B.
           ADD FLD0917A        TO FLD0917B.
           SUBTRACT FLD0918A        FROM FLD0918B
               ON SIZE ERROR MOVE 'Y' TO FLD0918E.
           ADD FLD0919A        TO FLD0919B.
           SUBTRACT FLD0920A        FROM FLD0920B.
           ADD FLD0921A        TO FLD0921B
               ON SIZE ERROR MOVE 'Y' TO FLD0921E.
           SUBTRACT FLD0922A        FROM FLD0922B.
           ADD FLD0923A        TO FLD0923B.
           SUBTRACT FLD0924A        FROM FLD0924B
               ON SIZE ERROR MOVE 'Y' TO FLD0924E.
           ADD FLD0925A        TO FLD0925B.
           SUBTRACT FLD0926A        FROM FLD0926B.
           ADD FLD0927A        TO FLD0927B
               ON SIZE ERROR MOVE 'Y' TO FLD0927E.
           SUBTRACT FLD0928A        FROM FLD0928B.
           ADD FLD0929A        TO FLD0929B.
           SUBTRACT FLD0930A        FROM FLD0930B
               ON SIZE ERROR MOVE 'Y' TO FLD0930E.
           ADD FLD0931A        TO FLD0931B.
           SUBTRACT FLD0932A        FROM FLD0932B.
           ADD FLD0933A        TO FLD0933B
               ON SIZE ERROR MOVE 'Y' TO FLD0933E.
           SUBTRACT FLD0934A        FROM FLD0934B.
           ADD FLD0935A        TO FLD0935B.
           SUBTRACT FLD0936A        FROM FLD0936B
               ON SIZE ERROR MOVE 'Y' TO FLD0936E.
           ADD FLD0937A        TO FLD0937B.
           SUBTRACT FLD0938A        FROM FLD0938B.
           ADD FLD0939A        TO FLD0939B
               ON SIZE ERROR MOVE 'Y' TO FLD0939E.
           SUBTRACT FLD0940A        FROM FLD0940B.
           ADD FLD0941A        TO FLD0941B.
           SUBTRACT FLD0942A        FROM FLD0942B
               ON SIZE ERROR MOVE 'Y' TO FLD0942E.
           ADD FLD0943A        TO FLD0943B.
           SUBTRACT FLD0944A        FROM FLD0944B.
           ADD FLD0945A        TO FLD0945B
               ON SIZE ERROR MOVE 'Y' TO FLD0945E.
           SUBTRACT FLD0946A        FROM FLD0946B.
           ADD FLD0947A        TO FLD0947B.
           SUBTRACT FLD0948A        FROM FLD0948B
               ON SIZE ERROR MOVE 'Y' TO FLD0948E.
           ADD FLD0949A        TO FLD0949B.
           SUBTRACT FLD0950A        FROM FLD0950B.
           ADD FLD0951A        TO FLD0951B
               ON SIZE ERROR MOVE 'Y' TO FLD0951E.
           SUBTRACT FLD0952A        FROM FLD0952B.
           ADD FLD0953A        TO FLD0953B.
           SUBTRACT FLD0954A        FROM FLD0954B
               ON SIZE ERROR MOVE 'Y' TO FLD0954E.
           ADD FLD0955A        TO FLD0955B.
           SUBTRACT FLD0956A        FROM FLD0956B.
           ADD FLD0957A        TO FLD0957B
               ON SIZE ERROR MOVE 'Y' TO FLD0957E.
           SUBTRACT FLD0958A        FROM FLD0958B.
           ADD FLD0959A        TO FLD0959B.
           SUBTRACT FLD0960A        FROM FLD0960B
               ON SIZE ERROR MOVE 'Y' TO FLD0960E.
           ADD FLD0961A        TO FLD0961B.
           SUBTRACT FLD0962A        FROM FLD0962B.
           ADD FLD0963A        TO FLD0963B
               ON SIZE ERROR MOVE 'Y' TO FLD0963E.
           SUBTRACT FLD0964A        FROM FLD0964B.
           ADD FLD0965A        TO FLD0965B.
           SUBTRACT FLD0966A        FROM FLD0966B
               ON SIZE ERROR MOVE 'Y' TO FLD0966E.
           ADD FLD0967A        TO FLD0967B.
           SUBTRACT FLD0968A        FROM FLD0968B.
           ADD FLD0969A        TO FLD0969B
               ON SIZE ERROR MOVE 'Y' TO FLD0969E.
           SUBTRACT FLD0970A        FROM FLD0970B.
           ADD FLD0971A        TO FLD0971B.
           SUBTRACT FLD0972A        FROM FLD0972B
               ON SIZE ERROR MOVE 'Y' TO FLD0972E.
           ADD FLD0973A        TO FLD0973B.
           SUBTRACT FLD0974A        FROM FLD0974B.
           ADD FLD0975A        TO FLD0975B
               ON SIZE ERROR MOVE 'Y' TO FLD0975E.
           SUBTRACT FLD0976A        FROM FLD0976B.
           ADD FLD0977A        TO FLD0977B.
           SUBTRACT FLD0978A        FROM FLD0978B
               ON SIZE ERROR MOVE 'Y' TO FLD0978E.
           ADD FLD0979A        TO FLD0979B.
           SUBTRACT FLD0980A        FROM FLD0980B.
           ADD FLD0981A        TO FLD0981B
               ON SIZE ERROR MOVE 'Y' TO FLD0981E.
           SUBTRACT FLD0982A        FROM FLD0982B.
           ADD FLD0983A        TO FLD0983B.
           SUBTRACT FLD0984A        FROM FLD0984B
               ON SIZE ERROR MOVE 'Y' TO FLD0984E.
           ADD FLD0985A        TO FLD0985B.
           SUBTRACT FLD0986A        FROM FLD0986B.
           ADD FLD0987A        TO FLD0987B
               ON SIZE ERROR MOVE 'Y' TO FLD0987E.
           SUBTRACT FLD0988A        FROM FLD0988B.
           ADD FLD0989A        TO FLD0989B.
           SUBTRACT FLD0990A        FROM FLD0990B
               ON SIZE ERROR MOVE 'Y' TO FLD0990E.
           ADD FLD0991A        TO FLD0991B.
           SUBTRACT FLD0992A        FROM FLD0992B.
           ADD FLD0993A        TO FLD0993B
               ON SIZE ERROR MOVE 'Y' TO FLD0993E.
           SUBTRACT FLD0994A        FROM FLD0994B.
           ADD FLD0995A        TO FLD0995B.
           SUBTRACT FLD0996A        FROM FLD0996B
               ON SIZE ERROR MOVE 'Y' TO FLD0996E.
           ADD FLD0997A        TO FLD0997B.
           SUBTRACT FLD0998A        FROM FLD0998B.
           ADD FLD0999A        TO FLD0999B
               ON SIZE ERROR MOVE 'Y' TO FLD0999E.

      *4000-COMPARE.

           IF FLD0500B (1:)    NOT EQUAL XPC-FLD0500B
              DISPLAY 'FLD0500B ==> ' HEX-OF (FLD0500B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0500B).
           IF FLD0500E   NOT EQUAL XPC-FLD0500E
              DISPLAY 'FLD0500E  ==> ' FLD0500E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0500E.
           IF FLD0501B (1:)    NOT EQUAL XPC-FLD0501B
              DISPLAY 'FLD0501B ==> ' HEX-OF (FLD0501B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0501B).
           IF FLD0501E   NOT EQUAL XPC-FLD0501E
              DISPLAY 'FLD0501E  ==> ' FLD0501E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0501E.
           IF FLD0502B (1:)    NOT EQUAL XPC-FLD0502B
              DISPLAY 'FLD0502B ==> ' HEX-OF (FLD0502B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0502B).
           IF FLD0502E   NOT EQUAL XPC-FLD0502E
              DISPLAY 'FLD0502E  ==> ' FLD0502E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0502E.
           IF FLD0503B (1:)    NOT EQUAL XPC-FLD0503B
              DISPLAY 'FLD0503B ==> ' HEX-OF (FLD0503B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0503B).
           IF FLD0503E   NOT EQUAL XPC-FLD0503E
              DISPLAY 'FLD0503E  ==> ' FLD0503E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0503E.
           IF FLD0504B (1:)    NOT EQUAL XPC-FLD0504B
              DISPLAY 'FLD0504B ==> ' HEX-OF (FLD0504B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0504B).
           IF FLD0504E   NOT EQUAL XPC-FLD0504E
              DISPLAY 'FLD0504E  ==> ' FLD0504E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0504E.
           IF FLD0505B (1:)    NOT EQUAL XPC-FLD0505B
              DISPLAY 'FLD0505B ==> ' HEX-OF (FLD0505B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0505B).
           IF FLD0505E   NOT EQUAL XPC-FLD0505E
              DISPLAY 'FLD0505E  ==> ' FLD0505E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0505E.
           IF FLD0506B (1:)    NOT EQUAL XPC-FLD0506B
              DISPLAY 'FLD0506B ==> ' HEX-OF (FLD0506B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0506B).
           IF FLD0506E   NOT EQUAL XPC-FLD0506E
              DISPLAY 'FLD0506E  ==> ' FLD0506E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0506E.
           IF FLD0507B (1:)    NOT EQUAL XPC-FLD0507B
              DISPLAY 'FLD0507B ==> ' HEX-OF (FLD0507B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0507B).
           IF FLD0507E   NOT EQUAL XPC-FLD0507E
              DISPLAY 'FLD0507E  ==> ' FLD0507E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0507E.
           IF FLD0508B (1:)    NOT EQUAL XPC-FLD0508B
              DISPLAY 'FLD0508B ==> ' HEX-OF (FLD0508B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0508B).
           IF FLD0508E   NOT EQUAL XPC-FLD0508E
              DISPLAY 'FLD0508E  ==> ' FLD0508E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0508E.
           IF FLD0509B (1:)    NOT EQUAL XPC-FLD0509B
              DISPLAY 'FLD0509B ==> ' HEX-OF (FLD0509B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0509B).
           IF FLD0509E   NOT EQUAL XPC-FLD0509E
              DISPLAY 'FLD0509E  ==> ' FLD0509E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0509E.
           IF FLD0510B (1:)    NOT EQUAL XPC-FLD0510B
              DISPLAY 'FLD0510B ==> ' HEX-OF (FLD0510B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0510B).
           IF FLD0510E   NOT EQUAL XPC-FLD0510E
              DISPLAY 'FLD0510E  ==> ' FLD0510E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0510E.
           IF FLD0511B (1:)    NOT EQUAL XPC-FLD0511B
              DISPLAY 'FLD0511B ==> ' HEX-OF (FLD0511B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0511B).
           IF FLD0511E   NOT EQUAL XPC-FLD0511E
              DISPLAY 'FLD0511E  ==> ' FLD0511E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0511E.
           IF FLD0512B (1:)    NOT EQUAL XPC-FLD0512B
              DISPLAY 'FLD0512B ==> ' HEX-OF (FLD0512B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0512B).
           IF FLD0512E   NOT EQUAL XPC-FLD0512E
              DISPLAY 'FLD0512E  ==> ' FLD0512E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0512E.
           IF FLD0513B (1:)    NOT EQUAL XPC-FLD0513B
              DISPLAY 'FLD0513B ==> ' HEX-OF (FLD0513B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0513B).
           IF FLD0513E   NOT EQUAL XPC-FLD0513E
              DISPLAY 'FLD0513E  ==> ' FLD0513E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0513E.
           IF FLD0514B (1:)    NOT EQUAL XPC-FLD0514B
              DISPLAY 'FLD0514B ==> ' HEX-OF (FLD0514B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0514B).
           IF FLD0514E   NOT EQUAL XPC-FLD0514E
              DISPLAY 'FLD0514E  ==> ' FLD0514E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0514E.
           IF FLD0515B (1:)    NOT EQUAL XPC-FLD0515B
              DISPLAY 'FLD0515B ==> ' HEX-OF (FLD0515B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0515B).
           IF FLD0515E   NOT EQUAL XPC-FLD0515E
              DISPLAY 'FLD0515E  ==> ' FLD0515E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0515E.
           IF FLD0516B (1:)    NOT EQUAL XPC-FLD0516B
              DISPLAY 'FLD0516B ==> ' HEX-OF (FLD0516B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0516B).
           IF FLD0516E   NOT EQUAL XPC-FLD0516E
              DISPLAY 'FLD0516E  ==> ' FLD0516E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0516E.
           IF FLD0517B (1:)    NOT EQUAL XPC-FLD0517B
              DISPLAY 'FLD0517B ==> ' HEX-OF (FLD0517B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0517B).
           IF FLD0517E   NOT EQUAL XPC-FLD0517E
              DISPLAY 'FLD0517E  ==> ' FLD0517E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0517E.
           IF FLD0518B (1:)    NOT EQUAL XPC-FLD0518B
              DISPLAY 'FLD0518B ==> ' HEX-OF (FLD0518B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0518B).
           IF FLD0518E   NOT EQUAL XPC-FLD0518E
              DISPLAY 'FLD0518E  ==> ' FLD0518E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0518E.
           IF FLD0519B (1:)    NOT EQUAL XPC-FLD0519B
              DISPLAY 'FLD0519B ==> ' HEX-OF (FLD0519B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0519B).
           IF FLD0519E   NOT EQUAL XPC-FLD0519E
              DISPLAY 'FLD0519E  ==> ' FLD0519E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0519E.
           IF FLD0520B (1:)    NOT EQUAL XPC-FLD0520B
              DISPLAY 'FLD0520B ==> ' HEX-OF (FLD0520B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0520B).
           IF FLD0520E   NOT EQUAL XPC-FLD0520E
              DISPLAY 'FLD0520E  ==> ' FLD0520E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0520E.
           IF FLD0521B (1:)    NOT EQUAL XPC-FLD0521B
              DISPLAY 'FLD0521B ==> ' HEX-OF (FLD0521B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0521B).
           IF FLD0521E   NOT EQUAL XPC-FLD0521E
              DISPLAY 'FLD0521E  ==> ' FLD0521E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0521E.
           IF FLD0522B (1:)    NOT EQUAL XPC-FLD0522B
              DISPLAY 'FLD0522B ==> ' HEX-OF (FLD0522B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0522B).
           IF FLD0522E   NOT EQUAL XPC-FLD0522E
              DISPLAY 'FLD0522E  ==> ' FLD0522E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0522E.
           IF FLD0523B (1:)    NOT EQUAL XPC-FLD0523B
              DISPLAY 'FLD0523B ==> ' HEX-OF (FLD0523B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0523B).
           IF FLD0523E   NOT EQUAL XPC-FLD0523E
              DISPLAY 'FLD0523E  ==> ' FLD0523E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0523E.
           IF FLD0524B (1:)    NOT EQUAL XPC-FLD0524B
              DISPLAY 'FLD0524B ==> ' HEX-OF (FLD0524B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0524B).
           IF FLD0524E   NOT EQUAL XPC-FLD0524E
              DISPLAY 'FLD0524E  ==> ' FLD0524E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0524E.
           IF FLD0525B (1:)    NOT EQUAL XPC-FLD0525B
              DISPLAY 'FLD0525B ==> ' HEX-OF (FLD0525B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0525B).
           IF FLD0525E   NOT EQUAL XPC-FLD0525E
              DISPLAY 'FLD0525E  ==> ' FLD0525E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0525E.
           IF FLD0526B (1:)    NOT EQUAL XPC-FLD0526B
              DISPLAY 'FLD0526B ==> ' HEX-OF (FLD0526B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0526B).
           IF FLD0526E   NOT EQUAL XPC-FLD0526E
              DISPLAY 'FLD0526E  ==> ' FLD0526E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0526E.
           IF FLD0527B (1:)    NOT EQUAL XPC-FLD0527B
              DISPLAY 'FLD0527B ==> ' HEX-OF (FLD0527B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0527B).
           IF FLD0527E   NOT EQUAL XPC-FLD0527E
              DISPLAY 'FLD0527E  ==> ' FLD0527E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0527E.
           IF FLD0528B (1:)    NOT EQUAL XPC-FLD0528B
              DISPLAY 'FLD0528B ==> ' HEX-OF (FLD0528B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0528B).
           IF FLD0528E   NOT EQUAL XPC-FLD0528E
              DISPLAY 'FLD0528E  ==> ' FLD0528E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0528E.
           IF FLD0529B (1:)    NOT EQUAL XPC-FLD0529B
              DISPLAY 'FLD0529B ==> ' HEX-OF (FLD0529B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0529B).
           IF FLD0529E   NOT EQUAL XPC-FLD0529E
              DISPLAY 'FLD0529E  ==> ' FLD0529E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0529E.
           IF FLD0530B (1:)    NOT EQUAL XPC-FLD0530B
              DISPLAY 'FLD0530B ==> ' HEX-OF (FLD0530B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0530B).
           IF FLD0530E   NOT EQUAL XPC-FLD0530E
              DISPLAY 'FLD0530E  ==> ' FLD0530E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0530E.
           IF FLD0531B (1:)    NOT EQUAL XPC-FLD0531B
              DISPLAY 'FLD0531B ==> ' HEX-OF (FLD0531B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0531B).
           IF FLD0531E   NOT EQUAL XPC-FLD0531E
              DISPLAY 'FLD0531E  ==> ' FLD0531E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0531E.
           IF FLD0532B (1:)    NOT EQUAL XPC-FLD0532B
              DISPLAY 'FLD0532B ==> ' HEX-OF (FLD0532B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0532B).
           IF FLD0532E   NOT EQUAL XPC-FLD0532E
              DISPLAY 'FLD0532E  ==> ' FLD0532E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0532E.
           IF FLD0533B (1:)    NOT EQUAL XPC-FLD0533B
              DISPLAY 'FLD0533B ==> ' HEX-OF (FLD0533B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0533B).
           IF FLD0533E   NOT EQUAL XPC-FLD0533E
              DISPLAY 'FLD0533E  ==> ' FLD0533E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0533E.
           IF FLD0534B (1:)    NOT EQUAL XPC-FLD0534B
              DISPLAY 'FLD0534B ==> ' HEX-OF (FLD0534B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0534B).
           IF FLD0534E   NOT EQUAL XPC-FLD0534E
              DISPLAY 'FLD0534E  ==> ' FLD0534E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0534E.
           IF FLD0535B (1:)    NOT EQUAL XPC-FLD0535B
              DISPLAY 'FLD0535B ==> ' HEX-OF (FLD0535B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0535B).
           IF FLD0535E   NOT EQUAL XPC-FLD0535E
              DISPLAY 'FLD0535E  ==> ' FLD0535E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0535E.
           IF FLD0536B (1:)    NOT EQUAL XPC-FLD0536B
              DISPLAY 'FLD0536B ==> ' HEX-OF (FLD0536B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0536B).
           IF FLD0536E   NOT EQUAL XPC-FLD0536E
              DISPLAY 'FLD0536E  ==> ' FLD0536E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0536E.
           IF FLD0537B (1:)    NOT EQUAL XPC-FLD0537B
              DISPLAY 'FLD0537B ==> ' HEX-OF (FLD0537B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0537B).
           IF FLD0537E   NOT EQUAL XPC-FLD0537E
              DISPLAY 'FLD0537E  ==> ' FLD0537E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0537E.
           IF FLD0538B (1:)    NOT EQUAL XPC-FLD0538B
              DISPLAY 'FLD0538B ==> ' HEX-OF (FLD0538B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0538B).
           IF FLD0538E   NOT EQUAL XPC-FLD0538E
              DISPLAY 'FLD0538E  ==> ' FLD0538E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0538E.
           IF FLD0539B (1:)    NOT EQUAL XPC-FLD0539B
              DISPLAY 'FLD0539B ==> ' HEX-OF (FLD0539B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0539B).
           IF FLD0539E   NOT EQUAL XPC-FLD0539E
              DISPLAY 'FLD0539E  ==> ' FLD0539E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0539E.
           IF FLD0540B (1:)    NOT EQUAL XPC-FLD0540B
              DISPLAY 'FLD0540B ==> ' HEX-OF (FLD0540B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0540B).
           IF FLD0540E   NOT EQUAL XPC-FLD0540E
              DISPLAY 'FLD0540E  ==> ' FLD0540E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0540E.
           IF FLD0541B (1:)    NOT EQUAL XPC-FLD0541B
              DISPLAY 'FLD0541B ==> ' HEX-OF (FLD0541B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0541B).
           IF FLD0541E   NOT EQUAL XPC-FLD0541E
              DISPLAY 'FLD0541E  ==> ' FLD0541E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0541E.
           IF FLD0542B (1:)    NOT EQUAL XPC-FLD0542B
              DISPLAY 'FLD0542B ==> ' HEX-OF (FLD0542B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0542B).
           IF FLD0542E   NOT EQUAL XPC-FLD0542E
              DISPLAY 'FLD0542E  ==> ' FLD0542E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0542E.
           IF FLD0543B (1:)    NOT EQUAL XPC-FLD0543B
              DISPLAY 'FLD0543B ==> ' HEX-OF (FLD0543B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0543B).
           IF FLD0543E   NOT EQUAL XPC-FLD0543E
              DISPLAY 'FLD0543E  ==> ' FLD0543E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0543E.
           IF FLD0544B (1:)    NOT EQUAL XPC-FLD0544B
              DISPLAY 'FLD0544B ==> ' HEX-OF (FLD0544B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0544B).
           IF FLD0544E   NOT EQUAL XPC-FLD0544E
              DISPLAY 'FLD0544E  ==> ' FLD0544E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0544E.
           IF FLD0545B (1:)    NOT EQUAL XPC-FLD0545B
              DISPLAY 'FLD0545B ==> ' HEX-OF (FLD0545B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0545B).
           IF FLD0545E   NOT EQUAL XPC-FLD0545E
              DISPLAY 'FLD0545E  ==> ' FLD0545E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0545E.
           IF FLD0546B (1:)    NOT EQUAL XPC-FLD0546B
              DISPLAY 'FLD0546B ==> ' HEX-OF (FLD0546B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0546B).
           IF FLD0546E   NOT EQUAL XPC-FLD0546E
              DISPLAY 'FLD0546E  ==> ' FLD0546E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0546E.
           IF FLD0547B (1:)    NOT EQUAL XPC-FLD0547B
              DISPLAY 'FLD0547B ==> ' HEX-OF (FLD0547B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0547B).
           IF FLD0547E   NOT EQUAL XPC-FLD0547E
              DISPLAY 'FLD0547E  ==> ' FLD0547E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0547E.
           IF FLD0548B (1:)    NOT EQUAL XPC-FLD0548B
              DISPLAY 'FLD0548B ==> ' HEX-OF (FLD0548B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0548B).
           IF FLD0548E   NOT EQUAL XPC-FLD0548E
              DISPLAY 'FLD0548E  ==> ' FLD0548E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0548E.
           IF FLD0549B (1:)    NOT EQUAL XPC-FLD0549B
              DISPLAY 'FLD0549B ==> ' HEX-OF (FLD0549B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0549B).
           IF FLD0549E   NOT EQUAL XPC-FLD0549E
              DISPLAY 'FLD0549E  ==> ' FLD0549E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0549E.
           IF FLD0550B (1:)    NOT EQUAL XPC-FLD0550B
              DISPLAY 'FLD0550B ==> ' HEX-OF (FLD0550B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0550B).
           IF FLD0550E   NOT EQUAL XPC-FLD0550E
              DISPLAY 'FLD0550E  ==> ' FLD0550E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0550E.
           IF FLD0551B (1:)    NOT EQUAL XPC-FLD0551B
              DISPLAY 'FLD0551B ==> ' HEX-OF (FLD0551B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0551B).
           IF FLD0551E   NOT EQUAL XPC-FLD0551E
              DISPLAY 'FLD0551E  ==> ' FLD0551E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0551E.
           IF FLD0552B (1:)    NOT EQUAL XPC-FLD0552B
              DISPLAY 'FLD0552B ==> ' HEX-OF (FLD0552B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0552B).
           IF FLD0552E   NOT EQUAL XPC-FLD0552E
              DISPLAY 'FLD0552E  ==> ' FLD0552E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0552E.
           IF FLD0553B (1:)    NOT EQUAL XPC-FLD0553B
              DISPLAY 'FLD0553B ==> ' HEX-OF (FLD0553B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0553B).
           IF FLD0553E   NOT EQUAL XPC-FLD0553E
              DISPLAY 'FLD0553E  ==> ' FLD0553E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0553E.
           IF FLD0554B (1:)    NOT EQUAL XPC-FLD0554B
              DISPLAY 'FLD0554B ==> ' HEX-OF (FLD0554B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0554B).
           IF FLD0554E   NOT EQUAL XPC-FLD0554E
              DISPLAY 'FLD0554E  ==> ' FLD0554E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0554E.
           IF FLD0555B (1:)    NOT EQUAL XPC-FLD0555B
              DISPLAY 'FLD0555B ==> ' HEX-OF (FLD0555B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0555B).
           IF FLD0555E   NOT EQUAL XPC-FLD0555E
              DISPLAY 'FLD0555E  ==> ' FLD0555E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0555E.
           IF FLD0556B (1:)    NOT EQUAL XPC-FLD0556B
              DISPLAY 'FLD0556B ==> ' HEX-OF (FLD0556B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0556B).
           IF FLD0556E   NOT EQUAL XPC-FLD0556E
              DISPLAY 'FLD0556E  ==> ' FLD0556E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0556E.
           IF FLD0557B (1:)    NOT EQUAL XPC-FLD0557B
              DISPLAY 'FLD0557B ==> ' HEX-OF (FLD0557B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0557B).
           IF FLD0557E   NOT EQUAL XPC-FLD0557E
              DISPLAY 'FLD0557E  ==> ' FLD0557E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0557E.
           IF FLD0558B (1:)    NOT EQUAL XPC-FLD0558B
              DISPLAY 'FLD0558B ==> ' HEX-OF (FLD0558B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0558B).
           IF FLD0558E   NOT EQUAL XPC-FLD0558E
              DISPLAY 'FLD0558E  ==> ' FLD0558E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0558E.
           IF FLD0559B (1:)    NOT EQUAL XPC-FLD0559B
              DISPLAY 'FLD0559B ==> ' HEX-OF (FLD0559B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0559B).
           IF FLD0559E   NOT EQUAL XPC-FLD0559E
              DISPLAY 'FLD0559E  ==> ' FLD0559E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0559E.
           IF FLD0560B (1:)    NOT EQUAL XPC-FLD0560B
              DISPLAY 'FLD0560B ==> ' HEX-OF (FLD0560B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0560B).
           IF FLD0560E   NOT EQUAL XPC-FLD0560E
              DISPLAY 'FLD0560E  ==> ' FLD0560E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0560E.
           IF FLD0561B (1:)    NOT EQUAL XPC-FLD0561B
              DISPLAY 'FLD0561B ==> ' HEX-OF (FLD0561B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0561B).
           IF FLD0561E   NOT EQUAL XPC-FLD0561E
              DISPLAY 'FLD0561E  ==> ' FLD0561E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0561E.
           IF FLD0562B (1:)    NOT EQUAL XPC-FLD0562B
              DISPLAY 'FLD0562B ==> ' HEX-OF (FLD0562B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0562B).
           IF FLD0562E   NOT EQUAL XPC-FLD0562E
              DISPLAY 'FLD0562E  ==> ' FLD0562E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0562E.
           IF FLD0563B (1:)    NOT EQUAL XPC-FLD0563B
              DISPLAY 'FLD0563B ==> ' HEX-OF (FLD0563B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0563B).
           IF FLD0563E   NOT EQUAL XPC-FLD0563E
              DISPLAY 'FLD0563E  ==> ' FLD0563E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0563E.
           IF FLD0564B (1:)    NOT EQUAL XPC-FLD0564B
              DISPLAY 'FLD0564B ==> ' HEX-OF (FLD0564B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0564B).
           IF FLD0564E   NOT EQUAL XPC-FLD0564E
              DISPLAY 'FLD0564E  ==> ' FLD0564E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0564E.
           IF FLD0565B (1:)    NOT EQUAL XPC-FLD0565B
              DISPLAY 'FLD0565B ==> ' HEX-OF (FLD0565B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0565B).
           IF FLD0565E   NOT EQUAL XPC-FLD0565E
              DISPLAY 'FLD0565E  ==> ' FLD0565E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0565E.
           IF FLD0566B (1:)    NOT EQUAL XPC-FLD0566B
              DISPLAY 'FLD0566B ==> ' HEX-OF (FLD0566B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0566B).
           IF FLD0566E   NOT EQUAL XPC-FLD0566E
              DISPLAY 'FLD0566E  ==> ' FLD0566E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0566E.
           IF FLD0567B (1:)    NOT EQUAL XPC-FLD0567B
              DISPLAY 'FLD0567B ==> ' HEX-OF (FLD0567B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0567B).
           IF FLD0567E   NOT EQUAL XPC-FLD0567E
              DISPLAY 'FLD0567E  ==> ' FLD0567E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0567E.
           IF FLD0568B (1:)    NOT EQUAL XPC-FLD0568B
              DISPLAY 'FLD0568B ==> ' HEX-OF (FLD0568B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0568B).
           IF FLD0568E   NOT EQUAL XPC-FLD0568E
              DISPLAY 'FLD0568E  ==> ' FLD0568E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0568E.
           IF FLD0569B (1:)    NOT EQUAL XPC-FLD0569B
              DISPLAY 'FLD0569B ==> ' HEX-OF (FLD0569B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0569B).
           IF FLD0569E   NOT EQUAL XPC-FLD0569E
              DISPLAY 'FLD0569E  ==> ' FLD0569E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0569E.
           IF FLD0570B (1:)    NOT EQUAL XPC-FLD0570B
              DISPLAY 'FLD0570B ==> ' HEX-OF (FLD0570B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0570B).
           IF FLD0570E   NOT EQUAL XPC-FLD0570E
              DISPLAY 'FLD0570E  ==> ' FLD0570E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0570E.
           IF FLD0571B (1:)    NOT EQUAL XPC-FLD0571B
              DISPLAY 'FLD0571B ==> ' HEX-OF (FLD0571B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0571B).
           IF FLD0571E   NOT EQUAL XPC-FLD0571E
              DISPLAY 'FLD0571E  ==> ' FLD0571E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0571E.
           IF FLD0572B (1:)    NOT EQUAL XPC-FLD0572B
              DISPLAY 'FLD0572B ==> ' HEX-OF (FLD0572B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0572B).
           IF FLD0572E   NOT EQUAL XPC-FLD0572E
              DISPLAY 'FLD0572E  ==> ' FLD0572E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0572E.
           IF FLD0573B (1:)    NOT EQUAL XPC-FLD0573B
              DISPLAY 'FLD0573B ==> ' HEX-OF (FLD0573B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0573B).
           IF FLD0573E   NOT EQUAL XPC-FLD0573E
              DISPLAY 'FLD0573E  ==> ' FLD0573E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0573E.
           IF FLD0574B (1:)    NOT EQUAL XPC-FLD0574B
              DISPLAY 'FLD0574B ==> ' HEX-OF (FLD0574B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0574B).
           IF FLD0574E   NOT EQUAL XPC-FLD0574E
              DISPLAY 'FLD0574E  ==> ' FLD0574E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0574E.
           IF FLD0575B (1:)    NOT EQUAL XPC-FLD0575B
              DISPLAY 'FLD0575B ==> ' HEX-OF (FLD0575B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0575B).
           IF FLD0575E   NOT EQUAL XPC-FLD0575E
              DISPLAY 'FLD0575E  ==> ' FLD0575E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0575E.
           IF FLD0576B (1:)    NOT EQUAL XPC-FLD0576B
              DISPLAY 'FLD0576B ==> ' HEX-OF (FLD0576B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0576B).
           IF FLD0576E   NOT EQUAL XPC-FLD0576E
              DISPLAY 'FLD0576E  ==> ' FLD0576E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0576E.
           IF FLD0577B (1:)    NOT EQUAL XPC-FLD0577B
              DISPLAY 'FLD0577B ==> ' HEX-OF (FLD0577B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0577B).
           IF FLD0577E   NOT EQUAL XPC-FLD0577E
              DISPLAY 'FLD0577E  ==> ' FLD0577E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0577E.
           IF FLD0578B (1:)    NOT EQUAL XPC-FLD0578B
              DISPLAY 'FLD0578B ==> ' HEX-OF (FLD0578B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0578B).
           IF FLD0578E   NOT EQUAL XPC-FLD0578E
              DISPLAY 'FLD0578E  ==> ' FLD0578E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0578E.
           IF FLD0579B (1:)    NOT EQUAL XPC-FLD0579B
              DISPLAY 'FLD0579B ==> ' HEX-OF (FLD0579B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0579B).
           IF FLD0579E   NOT EQUAL XPC-FLD0579E
              DISPLAY 'FLD0579E  ==> ' FLD0579E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0579E.
           IF FLD0580B (1:)    NOT EQUAL XPC-FLD0580B
              DISPLAY 'FLD0580B ==> ' HEX-OF (FLD0580B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0580B).
           IF FLD0580E   NOT EQUAL XPC-FLD0580E
              DISPLAY 'FLD0580E  ==> ' FLD0580E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0580E.
           IF FLD0581B (1:)    NOT EQUAL XPC-FLD0581B
              DISPLAY 'FLD0581B ==> ' HEX-OF (FLD0581B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0581B).
           IF FLD0581E   NOT EQUAL XPC-FLD0581E
              DISPLAY 'FLD0581E  ==> ' FLD0581E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0581E.
           IF FLD0582B (1:)    NOT EQUAL XPC-FLD0582B
              DISPLAY 'FLD0582B ==> ' HEX-OF (FLD0582B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0582B).
           IF FLD0582E   NOT EQUAL XPC-FLD0582E
              DISPLAY 'FLD0582E  ==> ' FLD0582E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0582E.
           IF FLD0583B (1:)    NOT EQUAL XPC-FLD0583B
              DISPLAY 'FLD0583B ==> ' HEX-OF (FLD0583B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0583B).
           IF FLD0583E   NOT EQUAL XPC-FLD0583E
              DISPLAY 'FLD0583E  ==> ' FLD0583E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0583E.
           IF FLD0584B (1:)    NOT EQUAL XPC-FLD0584B
              DISPLAY 'FLD0584B ==> ' HEX-OF (FLD0584B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0584B).
           IF FLD0584E   NOT EQUAL XPC-FLD0584E
              DISPLAY 'FLD0584E  ==> ' FLD0584E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0584E.
           IF FLD0585B (1:)    NOT EQUAL XPC-FLD0585B
              DISPLAY 'FLD0585B ==> ' HEX-OF (FLD0585B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0585B).
           IF FLD0585E   NOT EQUAL XPC-FLD0585E
              DISPLAY 'FLD0585E  ==> ' FLD0585E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0585E.
           IF FLD0586B (1:)    NOT EQUAL XPC-FLD0586B
              DISPLAY 'FLD0586B ==> ' HEX-OF (FLD0586B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0586B).
           IF FLD0586E   NOT EQUAL XPC-FLD0586E
              DISPLAY 'FLD0586E  ==> ' FLD0586E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0586E.
           IF FLD0587B (1:)    NOT EQUAL XPC-FLD0587B
              DISPLAY 'FLD0587B ==> ' HEX-OF (FLD0587B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0587B).
           IF FLD0587E   NOT EQUAL XPC-FLD0587E
              DISPLAY 'FLD0587E  ==> ' FLD0587E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0587E.
           IF FLD0588B (1:)    NOT EQUAL XPC-FLD0588B
              DISPLAY 'FLD0588B ==> ' HEX-OF (FLD0588B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0588B).
           IF FLD0588E   NOT EQUAL XPC-FLD0588E
              DISPLAY 'FLD0588E  ==> ' FLD0588E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0588E.
           IF FLD0589B (1:)    NOT EQUAL XPC-FLD0589B
              DISPLAY 'FLD0589B ==> ' HEX-OF (FLD0589B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0589B).
           IF FLD0589E   NOT EQUAL XPC-FLD0589E
              DISPLAY 'FLD0589E  ==> ' FLD0589E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0589E.
           IF FLD0590B (1:)    NOT EQUAL XPC-FLD0590B
              DISPLAY 'FLD0590B ==> ' HEX-OF (FLD0590B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0590B).
           IF FLD0590E   NOT EQUAL XPC-FLD0590E
              DISPLAY 'FLD0590E  ==> ' FLD0590E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0590E.
           IF FLD0591B (1:)    NOT EQUAL XPC-FLD0591B
              DISPLAY 'FLD0591B ==> ' HEX-OF (FLD0591B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0591B).
           IF FLD0591E   NOT EQUAL XPC-FLD0591E
              DISPLAY 'FLD0591E  ==> ' FLD0591E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0591E.
           IF FLD0592B (1:)    NOT EQUAL XPC-FLD0592B
              DISPLAY 'FLD0592B ==> ' HEX-OF (FLD0592B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0592B).
           IF FLD0592E   NOT EQUAL XPC-FLD0592E
              DISPLAY 'FLD0592E  ==> ' FLD0592E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0592E.
           IF FLD0593B (1:)    NOT EQUAL XPC-FLD0593B
              DISPLAY 'FLD0593B ==> ' HEX-OF (FLD0593B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0593B).
           IF FLD0593E   NOT EQUAL XPC-FLD0593E
              DISPLAY 'FLD0593E  ==> ' FLD0593E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0593E.
           IF FLD0594B (1:)    NOT EQUAL XPC-FLD0594B
              DISPLAY 'FLD0594B ==> ' HEX-OF (FLD0594B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0594B).
           IF FLD0594E   NOT EQUAL XPC-FLD0594E
              DISPLAY 'FLD0594E  ==> ' FLD0594E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0594E.
           IF FLD0595B (1:)    NOT EQUAL XPC-FLD0595B
              DISPLAY 'FLD0595B ==> ' HEX-OF (FLD0595B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0595B).
           IF FLD0595E   NOT EQUAL XPC-FLD0595E
              DISPLAY 'FLD0595E  ==> ' FLD0595E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0595E.
           IF FLD0596B (1:)    NOT EQUAL XPC-FLD0596B
              DISPLAY 'FLD0596B ==> ' HEX-OF (FLD0596B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0596B).
           IF FLD0596E   NOT EQUAL XPC-FLD0596E
              DISPLAY 'FLD0596E  ==> ' FLD0596E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0596E.
           IF FLD0597B (1:)    NOT EQUAL XPC-FLD0597B
              DISPLAY 'FLD0597B ==> ' HEX-OF (FLD0597B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0597B).
           IF FLD0597E   NOT EQUAL XPC-FLD0597E
              DISPLAY 'FLD0597E  ==> ' FLD0597E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0597E.
           IF FLD0598B (1:)    NOT EQUAL XPC-FLD0598B
              DISPLAY 'FLD0598B ==> ' HEX-OF (FLD0598B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0598B).
           IF FLD0598E   NOT EQUAL XPC-FLD0598E
              DISPLAY 'FLD0598E  ==> ' FLD0598E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0598E.
           IF FLD0599B (1:)    NOT EQUAL XPC-FLD0599B
              DISPLAY 'FLD0599B ==> ' HEX-OF (FLD0599B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0599B).
           IF FLD0599E   NOT EQUAL XPC-FLD0599E
              DISPLAY 'FLD0599E  ==> ' FLD0599E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0599E.
           IF FLD0600B (1:)    NOT EQUAL XPC-FLD0600B
              DISPLAY 'FLD0600B ==> ' HEX-OF (FLD0600B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0600B).
           IF FLD0600E   NOT EQUAL XPC-FLD0600E
              DISPLAY 'FLD0600E  ==> ' FLD0600E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0600E.
           IF FLD0601B (1:)    NOT EQUAL XPC-FLD0601B
              DISPLAY 'FLD0601B ==> ' HEX-OF (FLD0601B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0601B).
           IF FLD0601E   NOT EQUAL XPC-FLD0601E
              DISPLAY 'FLD0601E  ==> ' FLD0601E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0601E.
           IF FLD0602B (1:)    NOT EQUAL XPC-FLD0602B
              DISPLAY 'FLD0602B ==> ' HEX-OF (FLD0602B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0602B).
           IF FLD0602E   NOT EQUAL XPC-FLD0602E
              DISPLAY 'FLD0602E  ==> ' FLD0602E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0602E.
           IF FLD0603B (1:)    NOT EQUAL XPC-FLD0603B
              DISPLAY 'FLD0603B ==> ' HEX-OF (FLD0603B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0603B).
           IF FLD0603E   NOT EQUAL XPC-FLD0603E
              DISPLAY 'FLD0603E  ==> ' FLD0603E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0603E.
           IF FLD0604B (1:)    NOT EQUAL XPC-FLD0604B
              DISPLAY 'FLD0604B ==> ' HEX-OF (FLD0604B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0604B).
           IF FLD0604E   NOT EQUAL XPC-FLD0604E
              DISPLAY 'FLD0604E  ==> ' FLD0604E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0604E.
           IF FLD0605B (1:)    NOT EQUAL XPC-FLD0605B
              DISPLAY 'FLD0605B ==> ' HEX-OF (FLD0605B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0605B).
           IF FLD0605E   NOT EQUAL XPC-FLD0605E
              DISPLAY 'FLD0605E  ==> ' FLD0605E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0605E.
           IF FLD0606B (1:)    NOT EQUAL XPC-FLD0606B
              DISPLAY 'FLD0606B ==> ' HEX-OF (FLD0606B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0606B).
           IF FLD0606E   NOT EQUAL XPC-FLD0606E
              DISPLAY 'FLD0606E  ==> ' FLD0606E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0606E.
           IF FLD0607B (1:)    NOT EQUAL XPC-FLD0607B
              DISPLAY 'FLD0607B ==> ' HEX-OF (FLD0607B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0607B).
           IF FLD0607E   NOT EQUAL XPC-FLD0607E
              DISPLAY 'FLD0607E  ==> ' FLD0607E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0607E.
           IF FLD0608B (1:)    NOT EQUAL XPC-FLD0608B
              DISPLAY 'FLD0608B ==> ' HEX-OF (FLD0608B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0608B).
           IF FLD0608E   NOT EQUAL XPC-FLD0608E
              DISPLAY 'FLD0608E  ==> ' FLD0608E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0608E.
           IF FLD0609B (1:)    NOT EQUAL XPC-FLD0609B
              DISPLAY 'FLD0609B ==> ' HEX-OF (FLD0609B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0609B).
           IF FLD0609E   NOT EQUAL XPC-FLD0609E
              DISPLAY 'FLD0609E  ==> ' FLD0609E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0609E.
           IF FLD0610B (1:)    NOT EQUAL XPC-FLD0610B
              DISPLAY 'FLD0610B ==> ' HEX-OF (FLD0610B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0610B).
           IF FLD0610E   NOT EQUAL XPC-FLD0610E
              DISPLAY 'FLD0610E  ==> ' FLD0610E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0610E.
           IF FLD0611B (1:)    NOT EQUAL XPC-FLD0611B
              DISPLAY 'FLD0611B ==> ' HEX-OF (FLD0611B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0611B).
           IF FLD0611E   NOT EQUAL XPC-FLD0611E
              DISPLAY 'FLD0611E  ==> ' FLD0611E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0611E.
           IF FLD0612B (1:)    NOT EQUAL XPC-FLD0612B
              DISPLAY 'FLD0612B ==> ' HEX-OF (FLD0612B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0612B).
           IF FLD0612E   NOT EQUAL XPC-FLD0612E
              DISPLAY 'FLD0612E  ==> ' FLD0612E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0612E.
           IF FLD0613B (1:)    NOT EQUAL XPC-FLD0613B
              DISPLAY 'FLD0613B ==> ' HEX-OF (FLD0613B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0613B).
           IF FLD0613E   NOT EQUAL XPC-FLD0613E
              DISPLAY 'FLD0613E  ==> ' FLD0613E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0613E.
           IF FLD0614B (1:)    NOT EQUAL XPC-FLD0614B
              DISPLAY 'FLD0614B ==> ' HEX-OF (FLD0614B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0614B).
           IF FLD0614E   NOT EQUAL XPC-FLD0614E
              DISPLAY 'FLD0614E  ==> ' FLD0614E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0614E.
           IF FLD0615B (1:)    NOT EQUAL XPC-FLD0615B
              DISPLAY 'FLD0615B ==> ' HEX-OF (FLD0615B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0615B).
           IF FLD0615E   NOT EQUAL XPC-FLD0615E
              DISPLAY 'FLD0615E  ==> ' FLD0615E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0615E.
           IF FLD0616B (1:)    NOT EQUAL XPC-FLD0616B
              DISPLAY 'FLD0616B ==> ' HEX-OF (FLD0616B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0616B).
           IF FLD0616E   NOT EQUAL XPC-FLD0616E
              DISPLAY 'FLD0616E  ==> ' FLD0616E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0616E.
           IF FLD0617B (1:)    NOT EQUAL XPC-FLD0617B
              DISPLAY 'FLD0617B ==> ' HEX-OF (FLD0617B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0617B).
           IF FLD0617E   NOT EQUAL XPC-FLD0617E
              DISPLAY 'FLD0617E  ==> ' FLD0617E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0617E.
           IF FLD0618B (1:)    NOT EQUAL XPC-FLD0618B
              DISPLAY 'FLD0618B ==> ' HEX-OF (FLD0618B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0618B).
           IF FLD0618E   NOT EQUAL XPC-FLD0618E
              DISPLAY 'FLD0618E  ==> ' FLD0618E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0618E.
           IF FLD0619B (1:)    NOT EQUAL XPC-FLD0619B
              DISPLAY 'FLD0619B ==> ' HEX-OF (FLD0619B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0619B).
           IF FLD0619E   NOT EQUAL XPC-FLD0619E
              DISPLAY 'FLD0619E  ==> ' FLD0619E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0619E.
           IF FLD0620B (1:)    NOT EQUAL XPC-FLD0620B
              DISPLAY 'FLD0620B ==> ' HEX-OF (FLD0620B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0620B).
           IF FLD0620E   NOT EQUAL XPC-FLD0620E
              DISPLAY 'FLD0620E  ==> ' FLD0620E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0620E.
           IF FLD0621B (1:)    NOT EQUAL XPC-FLD0621B
              DISPLAY 'FLD0621B ==> ' HEX-OF (FLD0621B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0621B).
           IF FLD0621E   NOT EQUAL XPC-FLD0621E
              DISPLAY 'FLD0621E  ==> ' FLD0621E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0621E.
           IF FLD0622B (1:)    NOT EQUAL XPC-FLD0622B
              DISPLAY 'FLD0622B ==> ' HEX-OF (FLD0622B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0622B).
           IF FLD0622E   NOT EQUAL XPC-FLD0622E
              DISPLAY 'FLD0622E  ==> ' FLD0622E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0622E.
           IF FLD0623B (1:)    NOT EQUAL XPC-FLD0623B
              DISPLAY 'FLD0623B ==> ' HEX-OF (FLD0623B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0623B).
           IF FLD0623E   NOT EQUAL XPC-FLD0623E
              DISPLAY 'FLD0623E  ==> ' FLD0623E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0623E.
           IF FLD0624B (1:)    NOT EQUAL XPC-FLD0624B
              DISPLAY 'FLD0624B ==> ' HEX-OF (FLD0624B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0624B).
           IF FLD0624E   NOT EQUAL XPC-FLD0624E
              DISPLAY 'FLD0624E  ==> ' FLD0624E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0624E.
           IF FLD0625B (1:)    NOT EQUAL XPC-FLD0625B
              DISPLAY 'FLD0625B ==> ' HEX-OF (FLD0625B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0625B).
           IF FLD0625E   NOT EQUAL XPC-FLD0625E
              DISPLAY 'FLD0625E  ==> ' FLD0625E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0625E.
           IF FLD0626B (1:)    NOT EQUAL XPC-FLD0626B
              DISPLAY 'FLD0626B ==> ' HEX-OF (FLD0626B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0626B).
           IF FLD0626E   NOT EQUAL XPC-FLD0626E
              DISPLAY 'FLD0626E  ==> ' FLD0626E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0626E.
           IF FLD0627B (1:)    NOT EQUAL XPC-FLD0627B
              DISPLAY 'FLD0627B ==> ' HEX-OF (FLD0627B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0627B).
           IF FLD0627E   NOT EQUAL XPC-FLD0627E
              DISPLAY 'FLD0627E  ==> ' FLD0627E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0627E.
           IF FLD0628B (1:)    NOT EQUAL XPC-FLD0628B
              DISPLAY 'FLD0628B ==> ' HEX-OF (FLD0628B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0628B).
           IF FLD0628E   NOT EQUAL XPC-FLD0628E
              DISPLAY 'FLD0628E  ==> ' FLD0628E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0628E.
           IF FLD0629B (1:)    NOT EQUAL XPC-FLD0629B
              DISPLAY 'FLD0629B ==> ' HEX-OF (FLD0629B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0629B).
           IF FLD0629E   NOT EQUAL XPC-FLD0629E
              DISPLAY 'FLD0629E  ==> ' FLD0629E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0629E.
           IF FLD0630B (1:)    NOT EQUAL XPC-FLD0630B
              DISPLAY 'FLD0630B ==> ' HEX-OF (FLD0630B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0630B).
           IF FLD0630E   NOT EQUAL XPC-FLD0630E
              DISPLAY 'FLD0630E  ==> ' FLD0630E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0630E.
           IF FLD0631B (1:)    NOT EQUAL XPC-FLD0631B
              DISPLAY 'FLD0631B ==> ' HEX-OF (FLD0631B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0631B).
           IF FLD0631E   NOT EQUAL XPC-FLD0631E
              DISPLAY 'FLD0631E  ==> ' FLD0631E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0631E.
           IF FLD0632B (1:)    NOT EQUAL XPC-FLD0632B
              DISPLAY 'FLD0632B ==> ' HEX-OF (FLD0632B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0632B).
           IF FLD0632E   NOT EQUAL XPC-FLD0632E
              DISPLAY 'FLD0632E  ==> ' FLD0632E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0632E.
           IF FLD0633B (1:)    NOT EQUAL XPC-FLD0633B
              DISPLAY 'FLD0633B ==> ' HEX-OF (FLD0633B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0633B).
           IF FLD0633E   NOT EQUAL XPC-FLD0633E
              DISPLAY 'FLD0633E  ==> ' FLD0633E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0633E.
           IF FLD0634B (1:)    NOT EQUAL XPC-FLD0634B
              DISPLAY 'FLD0634B ==> ' HEX-OF (FLD0634B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0634B).
           IF FLD0634E   NOT EQUAL XPC-FLD0634E
              DISPLAY 'FLD0634E  ==> ' FLD0634E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0634E.
           IF FLD0635B (1:)    NOT EQUAL XPC-FLD0635B
              DISPLAY 'FLD0635B ==> ' HEX-OF (FLD0635B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0635B).
           IF FLD0635E   NOT EQUAL XPC-FLD0635E
              DISPLAY 'FLD0635E  ==> ' FLD0635E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0635E.
           IF FLD0636B (1:)    NOT EQUAL XPC-FLD0636B
              DISPLAY 'FLD0636B ==> ' HEX-OF (FLD0636B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0636B).
           IF FLD0636E   NOT EQUAL XPC-FLD0636E
              DISPLAY 'FLD0636E  ==> ' FLD0636E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0636E.
           IF FLD0637B (1:)    NOT EQUAL XPC-FLD0637B
              DISPLAY 'FLD0637B ==> ' HEX-OF (FLD0637B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0637B).
           IF FLD0637E   NOT EQUAL XPC-FLD0637E
              DISPLAY 'FLD0637E  ==> ' FLD0637E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0637E.
           IF FLD0638B (1:)    NOT EQUAL XPC-FLD0638B
              DISPLAY 'FLD0638B ==> ' HEX-OF (FLD0638B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0638B).
           IF FLD0638E   NOT EQUAL XPC-FLD0638E
              DISPLAY 'FLD0638E  ==> ' FLD0638E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0638E.
           IF FLD0639B (1:)    NOT EQUAL XPC-FLD0639B
              DISPLAY 'FLD0639B ==> ' HEX-OF (FLD0639B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0639B).
           IF FLD0639E   NOT EQUAL XPC-FLD0639E
              DISPLAY 'FLD0639E  ==> ' FLD0639E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0639E.
           IF FLD0640B (1:)    NOT EQUAL XPC-FLD0640B
              DISPLAY 'FLD0640B ==> ' HEX-OF (FLD0640B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0640B).
           IF FLD0640E   NOT EQUAL XPC-FLD0640E
              DISPLAY 'FLD0640E  ==> ' FLD0640E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0640E.
           IF FLD0641B (1:)    NOT EQUAL XPC-FLD0641B
              DISPLAY 'FLD0641B ==> ' HEX-OF (FLD0641B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0641B).
           IF FLD0641E   NOT EQUAL XPC-FLD0641E
              DISPLAY 'FLD0641E  ==> ' FLD0641E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0641E.
           IF FLD0642B (1:)    NOT EQUAL XPC-FLD0642B
              DISPLAY 'FLD0642B ==> ' HEX-OF (FLD0642B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0642B).
           IF FLD0642E   NOT EQUAL XPC-FLD0642E
              DISPLAY 'FLD0642E  ==> ' FLD0642E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0642E.
           IF FLD0643B (1:)    NOT EQUAL XPC-FLD0643B
              DISPLAY 'FLD0643B ==> ' HEX-OF (FLD0643B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0643B).
           IF FLD0643E   NOT EQUAL XPC-FLD0643E
              DISPLAY 'FLD0643E  ==> ' FLD0643E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0643E.
           IF FLD0644B (1:)    NOT EQUAL XPC-FLD0644B
              DISPLAY 'FLD0644B ==> ' HEX-OF (FLD0644B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0644B).
           IF FLD0644E   NOT EQUAL XPC-FLD0644E
              DISPLAY 'FLD0644E  ==> ' FLD0644E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0644E.
           IF FLD0645B (1:)    NOT EQUAL XPC-FLD0645B
              DISPLAY 'FLD0645B ==> ' HEX-OF (FLD0645B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0645B).
           IF FLD0645E   NOT EQUAL XPC-FLD0645E
              DISPLAY 'FLD0645E  ==> ' FLD0645E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0645E.
           IF FLD0646B (1:)    NOT EQUAL XPC-FLD0646B
              DISPLAY 'FLD0646B ==> ' HEX-OF (FLD0646B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0646B).
           IF FLD0646E   NOT EQUAL XPC-FLD0646E
              DISPLAY 'FLD0646E  ==> ' FLD0646E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0646E.
           IF FLD0647B (1:)    NOT EQUAL XPC-FLD0647B
              DISPLAY 'FLD0647B ==> ' HEX-OF (FLD0647B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0647B).
           IF FLD0647E   NOT EQUAL XPC-FLD0647E
              DISPLAY 'FLD0647E  ==> ' FLD0647E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0647E.
           IF FLD0648B (1:)    NOT EQUAL XPC-FLD0648B
              DISPLAY 'FLD0648B ==> ' HEX-OF (FLD0648B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0648B).
           IF FLD0648E   NOT EQUAL XPC-FLD0648E
              DISPLAY 'FLD0648E  ==> ' FLD0648E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0648E.
           IF FLD0649B (1:)    NOT EQUAL XPC-FLD0649B
              DISPLAY 'FLD0649B ==> ' HEX-OF (FLD0649B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0649B).
           IF FLD0649E   NOT EQUAL XPC-FLD0649E
              DISPLAY 'FLD0649E  ==> ' FLD0649E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0649E.
           IF FLD0650B (1:)    NOT EQUAL XPC-FLD0650B
              DISPLAY 'FLD0650B ==> ' HEX-OF (FLD0650B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0650B).
           IF FLD0650E   NOT EQUAL XPC-FLD0650E
              DISPLAY 'FLD0650E  ==> ' FLD0650E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0650E.
           IF FLD0651B (1:)    NOT EQUAL XPC-FLD0651B
              DISPLAY 'FLD0651B ==> ' HEX-OF (FLD0651B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0651B).
           IF FLD0651E   NOT EQUAL XPC-FLD0651E
              DISPLAY 'FLD0651E  ==> ' FLD0651E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0651E.
           IF FLD0652B (1:)    NOT EQUAL XPC-FLD0652B
              DISPLAY 'FLD0652B ==> ' HEX-OF (FLD0652B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0652B).
           IF FLD0652E   NOT EQUAL XPC-FLD0652E
              DISPLAY 'FLD0652E  ==> ' FLD0652E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0652E.
           IF FLD0653B (1:)    NOT EQUAL XPC-FLD0653B
              DISPLAY 'FLD0653B ==> ' HEX-OF (FLD0653B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0653B).
           IF FLD0653E   NOT EQUAL XPC-FLD0653E
              DISPLAY 'FLD0653E  ==> ' FLD0653E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0653E.
           IF FLD0654B (1:)    NOT EQUAL XPC-FLD0654B
              DISPLAY 'FLD0654B ==> ' HEX-OF (FLD0654B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0654B).
           IF FLD0654E   NOT EQUAL XPC-FLD0654E
              DISPLAY 'FLD0654E  ==> ' FLD0654E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0654E.
           IF FLD0655B (1:)    NOT EQUAL XPC-FLD0655B
              DISPLAY 'FLD0655B ==> ' HEX-OF (FLD0655B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0655B).
           IF FLD0655E   NOT EQUAL XPC-FLD0655E
              DISPLAY 'FLD0655E  ==> ' FLD0655E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0655E.
           IF FLD0656B (1:)    NOT EQUAL XPC-FLD0656B
              DISPLAY 'FLD0656B ==> ' HEX-OF (FLD0656B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0656B).
           IF FLD0656E   NOT EQUAL XPC-FLD0656E
              DISPLAY 'FLD0656E  ==> ' FLD0656E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0656E.
           IF FLD0657B (1:)    NOT EQUAL XPC-FLD0657B
              DISPLAY 'FLD0657B ==> ' HEX-OF (FLD0657B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0657B).
           IF FLD0657E   NOT EQUAL XPC-FLD0657E
              DISPLAY 'FLD0657E  ==> ' FLD0657E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0657E.
           IF FLD0658B (1:)    NOT EQUAL XPC-FLD0658B
              DISPLAY 'FLD0658B ==> ' HEX-OF (FLD0658B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0658B).
           IF FLD0658E   NOT EQUAL XPC-FLD0658E
              DISPLAY 'FLD0658E  ==> ' FLD0658E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0658E.
           IF FLD0659B (1:)    NOT EQUAL XPC-FLD0659B
              DISPLAY 'FLD0659B ==> ' HEX-OF (FLD0659B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0659B).
           IF FLD0659E   NOT EQUAL XPC-FLD0659E
              DISPLAY 'FLD0659E  ==> ' FLD0659E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0659E.
           IF FLD0660B (1:)    NOT EQUAL XPC-FLD0660B
              DISPLAY 'FLD0660B ==> ' HEX-OF (FLD0660B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0660B).
           IF FLD0660E   NOT EQUAL XPC-FLD0660E
              DISPLAY 'FLD0660E  ==> ' FLD0660E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0660E.
           IF FLD0661B (1:)    NOT EQUAL XPC-FLD0661B
              DISPLAY 'FLD0661B ==> ' HEX-OF (FLD0661B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0661B).
           IF FLD0661E   NOT EQUAL XPC-FLD0661E
              DISPLAY 'FLD0661E  ==> ' FLD0661E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0661E.
           IF FLD0662B (1:)    NOT EQUAL XPC-FLD0662B
              DISPLAY 'FLD0662B ==> ' HEX-OF (FLD0662B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0662B).
           IF FLD0662E   NOT EQUAL XPC-FLD0662E
              DISPLAY 'FLD0662E  ==> ' FLD0662E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0662E.
           IF FLD0663B (1:)    NOT EQUAL XPC-FLD0663B
              DISPLAY 'FLD0663B ==> ' HEX-OF (FLD0663B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0663B).
           IF FLD0663E   NOT EQUAL XPC-FLD0663E
              DISPLAY 'FLD0663E  ==> ' FLD0663E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0663E.
           IF FLD0664B (1:)    NOT EQUAL XPC-FLD0664B
              DISPLAY 'FLD0664B ==> ' HEX-OF (FLD0664B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0664B).
           IF FLD0664E   NOT EQUAL XPC-FLD0664E
              DISPLAY 'FLD0664E  ==> ' FLD0664E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0664E.
           IF FLD0665B (1:)    NOT EQUAL XPC-FLD0665B
              DISPLAY 'FLD0665B ==> ' HEX-OF (FLD0665B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0665B).
           IF FLD0665E   NOT EQUAL XPC-FLD0665E
              DISPLAY 'FLD0665E  ==> ' FLD0665E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0665E.
           IF FLD0666B (1:)    NOT EQUAL XPC-FLD0666B
              DISPLAY 'FLD0666B ==> ' HEX-OF (FLD0666B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0666B).
           IF FLD0666E   NOT EQUAL XPC-FLD0666E
              DISPLAY 'FLD0666E  ==> ' FLD0666E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0666E.
           IF FLD0667B (1:)    NOT EQUAL XPC-FLD0667B
              DISPLAY 'FLD0667B ==> ' HEX-OF (FLD0667B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0667B).
           IF FLD0667E   NOT EQUAL XPC-FLD0667E
              DISPLAY 'FLD0667E  ==> ' FLD0667E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0667E.
           IF FLD0668B (1:)    NOT EQUAL XPC-FLD0668B
              DISPLAY 'FLD0668B ==> ' HEX-OF (FLD0668B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0668B).
           IF FLD0668E   NOT EQUAL XPC-FLD0668E
              DISPLAY 'FLD0668E  ==> ' FLD0668E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0668E.
           IF FLD0669B (1:)    NOT EQUAL XPC-FLD0669B
              DISPLAY 'FLD0669B ==> ' HEX-OF (FLD0669B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0669B).
           IF FLD0669E   NOT EQUAL XPC-FLD0669E
              DISPLAY 'FLD0669E  ==> ' FLD0669E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0669E.
           IF FLD0670B (1:)    NOT EQUAL XPC-FLD0670B
              DISPLAY 'FLD0670B ==> ' HEX-OF (FLD0670B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0670B).
           IF FLD0670E   NOT EQUAL XPC-FLD0670E
              DISPLAY 'FLD0670E  ==> ' FLD0670E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0670E.
           IF FLD0671B (1:)    NOT EQUAL XPC-FLD0671B
              DISPLAY 'FLD0671B ==> ' HEX-OF (FLD0671B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0671B).
           IF FLD0671E   NOT EQUAL XPC-FLD0671E
              DISPLAY 'FLD0671E  ==> ' FLD0671E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0671E.
           IF FLD0672B (1:)    NOT EQUAL XPC-FLD0672B
              DISPLAY 'FLD0672B ==> ' HEX-OF (FLD0672B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0672B).
           IF FLD0672E   NOT EQUAL XPC-FLD0672E
              DISPLAY 'FLD0672E  ==> ' FLD0672E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0672E.
           IF FLD0673B (1:)    NOT EQUAL XPC-FLD0673B
              DISPLAY 'FLD0673B ==> ' HEX-OF (FLD0673B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0673B).
           IF FLD0673E   NOT EQUAL XPC-FLD0673E
              DISPLAY 'FLD0673E  ==> ' FLD0673E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0673E.
           IF FLD0674B (1:)    NOT EQUAL XPC-FLD0674B
              DISPLAY 'FLD0674B ==> ' HEX-OF (FLD0674B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0674B).
           IF FLD0674E   NOT EQUAL XPC-FLD0674E
              DISPLAY 'FLD0674E  ==> ' FLD0674E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0674E.
           IF FLD0675B (1:)    NOT EQUAL XPC-FLD0675B
              DISPLAY 'FLD0675B ==> ' HEX-OF (FLD0675B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0675B).
           IF FLD0675E   NOT EQUAL XPC-FLD0675E
              DISPLAY 'FLD0675E  ==> ' FLD0675E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0675E.
           IF FLD0676B (1:)    NOT EQUAL XPC-FLD0676B
              DISPLAY 'FLD0676B ==> ' HEX-OF (FLD0676B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0676B).
           IF FLD0676E   NOT EQUAL XPC-FLD0676E
              DISPLAY 'FLD0676E  ==> ' FLD0676E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0676E.
           IF FLD0677B (1:)    NOT EQUAL XPC-FLD0677B
              DISPLAY 'FLD0677B ==> ' HEX-OF (FLD0677B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0677B).
           IF FLD0677E   NOT EQUAL XPC-FLD0677E
              DISPLAY 'FLD0677E  ==> ' FLD0677E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0677E.
           IF FLD0678B (1:)    NOT EQUAL XPC-FLD0678B
              DISPLAY 'FLD0678B ==> ' HEX-OF (FLD0678B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0678B).
           IF FLD0678E   NOT EQUAL XPC-FLD0678E
              DISPLAY 'FLD0678E  ==> ' FLD0678E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0678E.
           IF FLD0679B (1:)    NOT EQUAL XPC-FLD0679B
              DISPLAY 'FLD0679B ==> ' HEX-OF (FLD0679B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0679B).
           IF FLD0679E   NOT EQUAL XPC-FLD0679E
              DISPLAY 'FLD0679E  ==> ' FLD0679E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0679E.
           IF FLD0680B (1:)    NOT EQUAL XPC-FLD0680B
              DISPLAY 'FLD0680B ==> ' HEX-OF (FLD0680B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0680B).
           IF FLD0680E   NOT EQUAL XPC-FLD0680E
              DISPLAY 'FLD0680E  ==> ' FLD0680E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0680E.
           IF FLD0681B (1:)    NOT EQUAL XPC-FLD0681B
              DISPLAY 'FLD0681B ==> ' HEX-OF (FLD0681B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0681B).
           IF FLD0681E   NOT EQUAL XPC-FLD0681E
              DISPLAY 'FLD0681E  ==> ' FLD0681E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0681E.
           IF FLD0682B (1:)    NOT EQUAL XPC-FLD0682B
              DISPLAY 'FLD0682B ==> ' HEX-OF (FLD0682B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0682B).
           IF FLD0682E   NOT EQUAL XPC-FLD0682E
              DISPLAY 'FLD0682E  ==> ' FLD0682E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0682E.
           IF FLD0683B (1:)    NOT EQUAL XPC-FLD0683B
              DISPLAY 'FLD0683B ==> ' HEX-OF (FLD0683B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0683B).
           IF FLD0683E   NOT EQUAL XPC-FLD0683E
              DISPLAY 'FLD0683E  ==> ' FLD0683E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0683E.
           IF FLD0684B (1:)    NOT EQUAL XPC-FLD0684B
              DISPLAY 'FLD0684B ==> ' HEX-OF (FLD0684B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0684B).
           IF FLD0684E   NOT EQUAL XPC-FLD0684E
              DISPLAY 'FLD0684E  ==> ' FLD0684E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0684E.
           IF FLD0685B (1:)    NOT EQUAL XPC-FLD0685B
              DISPLAY 'FLD0685B ==> ' HEX-OF (FLD0685B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0685B).
           IF FLD0685E   NOT EQUAL XPC-FLD0685E
              DISPLAY 'FLD0685E  ==> ' FLD0685E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0685E.
           IF FLD0686B (1:)    NOT EQUAL XPC-FLD0686B
              DISPLAY 'FLD0686B ==> ' HEX-OF (FLD0686B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0686B).
           IF FLD0686E   NOT EQUAL XPC-FLD0686E
              DISPLAY 'FLD0686E  ==> ' FLD0686E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0686E.
           IF FLD0687B (1:)    NOT EQUAL XPC-FLD0687B
              DISPLAY 'FLD0687B ==> ' HEX-OF (FLD0687B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0687B).
           IF FLD0687E   NOT EQUAL XPC-FLD0687E
              DISPLAY 'FLD0687E  ==> ' FLD0687E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0687E.
           IF FLD0688B (1:)    NOT EQUAL XPC-FLD0688B
              DISPLAY 'FLD0688B ==> ' HEX-OF (FLD0688B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0688B).
           IF FLD0688E   NOT EQUAL XPC-FLD0688E
              DISPLAY 'FLD0688E  ==> ' FLD0688E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0688E.
           IF FLD0689B (1:)    NOT EQUAL XPC-FLD0689B
              DISPLAY 'FLD0689B ==> ' HEX-OF (FLD0689B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0689B).
           IF FLD0689E   NOT EQUAL XPC-FLD0689E
              DISPLAY 'FLD0689E  ==> ' FLD0689E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0689E.
           IF FLD0690B (1:)    NOT EQUAL XPC-FLD0690B
              DISPLAY 'FLD0690B ==> ' HEX-OF (FLD0690B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0690B).
           IF FLD0690E   NOT EQUAL XPC-FLD0690E
              DISPLAY 'FLD0690E  ==> ' FLD0690E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0690E.
           IF FLD0691B (1:)    NOT EQUAL XPC-FLD0691B
              DISPLAY 'FLD0691B ==> ' HEX-OF (FLD0691B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0691B).
           IF FLD0691E   NOT EQUAL XPC-FLD0691E
              DISPLAY 'FLD0691E  ==> ' FLD0691E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0691E.
           IF FLD0692B (1:)    NOT EQUAL XPC-FLD0692B
              DISPLAY 'FLD0692B ==> ' HEX-OF (FLD0692B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0692B).
           IF FLD0692E   NOT EQUAL XPC-FLD0692E
              DISPLAY 'FLD0692E  ==> ' FLD0692E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0692E.
           IF FLD0693B (1:)    NOT EQUAL XPC-FLD0693B
              DISPLAY 'FLD0693B ==> ' HEX-OF (FLD0693B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0693B).
           IF FLD0693E   NOT EQUAL XPC-FLD0693E
              DISPLAY 'FLD0693E  ==> ' FLD0693E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0693E.
           IF FLD0694B (1:)    NOT EQUAL XPC-FLD0694B
              DISPLAY 'FLD0694B ==> ' HEX-OF (FLD0694B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0694B).
           IF FLD0694E   NOT EQUAL XPC-FLD0694E
              DISPLAY 'FLD0694E  ==> ' FLD0694E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0694E.
           IF FLD0695B (1:)    NOT EQUAL XPC-FLD0695B
              DISPLAY 'FLD0695B ==> ' HEX-OF (FLD0695B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0695B).
           IF FLD0695E   NOT EQUAL XPC-FLD0695E
              DISPLAY 'FLD0695E  ==> ' FLD0695E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0695E.
           IF FLD0696B (1:)    NOT EQUAL XPC-FLD0696B
              DISPLAY 'FLD0696B ==> ' HEX-OF (FLD0696B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0696B).
           IF FLD0696E   NOT EQUAL XPC-FLD0696E
              DISPLAY 'FLD0696E  ==> ' FLD0696E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0696E.
           IF FLD0697B (1:)    NOT EQUAL XPC-FLD0697B
              DISPLAY 'FLD0697B ==> ' HEX-OF (FLD0697B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0697B).
           IF FLD0697E   NOT EQUAL XPC-FLD0697E
              DISPLAY 'FLD0697E  ==> ' FLD0697E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0697E.
           IF FLD0698B (1:)    NOT EQUAL XPC-FLD0698B
              DISPLAY 'FLD0698B ==> ' HEX-OF (FLD0698B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0698B).
           IF FLD0698E   NOT EQUAL XPC-FLD0698E
              DISPLAY 'FLD0698E  ==> ' FLD0698E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0698E.
           IF FLD0699B (1:)    NOT EQUAL XPC-FLD0699B
              DISPLAY 'FLD0699B ==> ' HEX-OF (FLD0699B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0699B).
           IF FLD0699E   NOT EQUAL XPC-FLD0699E
              DISPLAY 'FLD0699E  ==> ' FLD0699E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0699E.
           IF FLD0700B (1:)    NOT EQUAL XPC-FLD0700B
              DISPLAY 'FLD0700B ==> ' HEX-OF (FLD0700B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0700B).
           IF FLD0700E   NOT EQUAL XPC-FLD0700E
              DISPLAY 'FLD0700E  ==> ' FLD0700E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0700E.
           IF FLD0701B (1:)    NOT EQUAL XPC-FLD0701B
              DISPLAY 'FLD0701B ==> ' HEX-OF (FLD0701B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0701B).
           IF FLD0701E   NOT EQUAL XPC-FLD0701E
              DISPLAY 'FLD0701E  ==> ' FLD0701E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0701E.
           IF FLD0702B (1:)    NOT EQUAL XPC-FLD0702B
              DISPLAY 'FLD0702B ==> ' HEX-OF (FLD0702B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0702B).
           IF FLD0702E   NOT EQUAL XPC-FLD0702E
              DISPLAY 'FLD0702E  ==> ' FLD0702E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0702E.
           IF FLD0703B (1:)    NOT EQUAL XPC-FLD0703B
              DISPLAY 'FLD0703B ==> ' HEX-OF (FLD0703B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0703B).
           IF FLD0703E   NOT EQUAL XPC-FLD0703E
              DISPLAY 'FLD0703E  ==> ' FLD0703E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0703E.
           IF FLD0704B (1:)    NOT EQUAL XPC-FLD0704B
              DISPLAY 'FLD0704B ==> ' HEX-OF (FLD0704B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0704B).
           IF FLD0704E   NOT EQUAL XPC-FLD0704E
              DISPLAY 'FLD0704E  ==> ' FLD0704E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0704E.
           IF FLD0705B (1:)    NOT EQUAL XPC-FLD0705B
              DISPLAY 'FLD0705B ==> ' HEX-OF (FLD0705B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0705B).
           IF FLD0705E   NOT EQUAL XPC-FLD0705E
              DISPLAY 'FLD0705E  ==> ' FLD0705E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0705E.
           IF FLD0706B (1:)    NOT EQUAL XPC-FLD0706B
              DISPLAY 'FLD0706B ==> ' HEX-OF (FLD0706B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0706B).
           IF FLD0706E   NOT EQUAL XPC-FLD0706E
              DISPLAY 'FLD0706E  ==> ' FLD0706E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0706E.
           IF FLD0707B (1:)    NOT EQUAL XPC-FLD0707B
              DISPLAY 'FLD0707B ==> ' HEX-OF (FLD0707B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0707B).
           IF FLD0707E   NOT EQUAL XPC-FLD0707E
              DISPLAY 'FLD0707E  ==> ' FLD0707E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0707E.
           IF FLD0708B (1:)    NOT EQUAL XPC-FLD0708B
              DISPLAY 'FLD0708B ==> ' HEX-OF (FLD0708B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0708B).
           IF FLD0708E   NOT EQUAL XPC-FLD0708E
              DISPLAY 'FLD0708E  ==> ' FLD0708E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0708E.
           IF FLD0709B (1:)    NOT EQUAL XPC-FLD0709B
              DISPLAY 'FLD0709B ==> ' HEX-OF (FLD0709B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0709B).
           IF FLD0709E   NOT EQUAL XPC-FLD0709E
              DISPLAY 'FLD0709E  ==> ' FLD0709E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0709E.
           IF FLD0710B (1:)    NOT EQUAL XPC-FLD0710B
              DISPLAY 'FLD0710B ==> ' HEX-OF (FLD0710B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0710B).
           IF FLD0710E   NOT EQUAL XPC-FLD0710E
              DISPLAY 'FLD0710E  ==> ' FLD0710E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0710E.
           IF FLD0711B (1:)    NOT EQUAL XPC-FLD0711B
              DISPLAY 'FLD0711B ==> ' HEX-OF (FLD0711B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0711B).
           IF FLD0711E   NOT EQUAL XPC-FLD0711E
              DISPLAY 'FLD0711E  ==> ' FLD0711E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0711E.
           IF FLD0712B (1:)    NOT EQUAL XPC-FLD0712B
              DISPLAY 'FLD0712B ==> ' HEX-OF (FLD0712B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0712B).
           IF FLD0712E   NOT EQUAL XPC-FLD0712E
              DISPLAY 'FLD0712E  ==> ' FLD0712E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0712E.
           IF FLD0713B (1:)    NOT EQUAL XPC-FLD0713B
              DISPLAY 'FLD0713B ==> ' HEX-OF (FLD0713B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0713B).
           IF FLD0713E   NOT EQUAL XPC-FLD0713E
              DISPLAY 'FLD0713E  ==> ' FLD0713E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0713E.
           IF FLD0714B (1:)    NOT EQUAL XPC-FLD0714B
              DISPLAY 'FLD0714B ==> ' HEX-OF (FLD0714B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0714B).
           IF FLD0714E   NOT EQUAL XPC-FLD0714E
              DISPLAY 'FLD0714E  ==> ' FLD0714E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0714E.
           IF FLD0715B (1:)    NOT EQUAL XPC-FLD0715B
              DISPLAY 'FLD0715B ==> ' HEX-OF (FLD0715B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0715B).
           IF FLD0715E   NOT EQUAL XPC-FLD0715E
              DISPLAY 'FLD0715E  ==> ' FLD0715E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0715E.
           IF FLD0716B (1:)    NOT EQUAL XPC-FLD0716B
              DISPLAY 'FLD0716B ==> ' HEX-OF (FLD0716B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0716B).
           IF FLD0716E   NOT EQUAL XPC-FLD0716E
              DISPLAY 'FLD0716E  ==> ' FLD0716E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0716E.
           IF FLD0717B (1:)    NOT EQUAL XPC-FLD0717B
              DISPLAY 'FLD0717B ==> ' HEX-OF (FLD0717B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0717B).
           IF FLD0717E   NOT EQUAL XPC-FLD0717E
              DISPLAY 'FLD0717E  ==> ' FLD0717E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0717E.
           IF FLD0718B (1:)    NOT EQUAL XPC-FLD0718B
              DISPLAY 'FLD0718B ==> ' HEX-OF (FLD0718B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0718B).
           IF FLD0718E   NOT EQUAL XPC-FLD0718E
              DISPLAY 'FLD0718E  ==> ' FLD0718E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0718E.
           IF FLD0719B (1:)    NOT EQUAL XPC-FLD0719B
              DISPLAY 'FLD0719B ==> ' HEX-OF (FLD0719B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0719B).
           IF FLD0719E   NOT EQUAL XPC-FLD0719E
              DISPLAY 'FLD0719E  ==> ' FLD0719E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0719E.
           IF FLD0720B (1:)    NOT EQUAL XPC-FLD0720B
              DISPLAY 'FLD0720B ==> ' HEX-OF (FLD0720B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0720B).
           IF FLD0720E   NOT EQUAL XPC-FLD0720E
              DISPLAY 'FLD0720E  ==> ' FLD0720E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0720E.
           IF FLD0721B (1:)    NOT EQUAL XPC-FLD0721B
              DISPLAY 'FLD0721B ==> ' HEX-OF (FLD0721B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0721B).
           IF FLD0721E   NOT EQUAL XPC-FLD0721E
              DISPLAY 'FLD0721E  ==> ' FLD0721E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0721E.
           IF FLD0722B (1:)    NOT EQUAL XPC-FLD0722B
              DISPLAY 'FLD0722B ==> ' HEX-OF (FLD0722B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0722B).
           IF FLD0722E   NOT EQUAL XPC-FLD0722E
              DISPLAY 'FLD0722E  ==> ' FLD0722E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0722E.
           IF FLD0723B (1:)    NOT EQUAL XPC-FLD0723B
              DISPLAY 'FLD0723B ==> ' HEX-OF (FLD0723B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0723B).
           IF FLD0723E   NOT EQUAL XPC-FLD0723E
              DISPLAY 'FLD0723E  ==> ' FLD0723E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0723E.
           IF FLD0724B (1:)    NOT EQUAL XPC-FLD0724B
              DISPLAY 'FLD0724B ==> ' HEX-OF (FLD0724B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0724B).
           IF FLD0724E   NOT EQUAL XPC-FLD0724E
              DISPLAY 'FLD0724E  ==> ' FLD0724E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0724E.
           IF FLD0725B (1:)    NOT EQUAL XPC-FLD0725B
              DISPLAY 'FLD0725B ==> ' HEX-OF (FLD0725B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0725B).
           IF FLD0725E   NOT EQUAL XPC-FLD0725E
              DISPLAY 'FLD0725E  ==> ' FLD0725E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0725E.
           IF FLD0726B (1:)    NOT EQUAL XPC-FLD0726B
              DISPLAY 'FLD0726B ==> ' HEX-OF (FLD0726B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0726B).
           IF FLD0726E   NOT EQUAL XPC-FLD0726E
              DISPLAY 'FLD0726E  ==> ' FLD0726E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0726E.
           IF FLD0727B (1:)    NOT EQUAL XPC-FLD0727B
              DISPLAY 'FLD0727B ==> ' HEX-OF (FLD0727B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0727B).
           IF FLD0727E   NOT EQUAL XPC-FLD0727E
              DISPLAY 'FLD0727E  ==> ' FLD0727E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0727E.
           IF FLD0728B (1:)    NOT EQUAL XPC-FLD0728B
              DISPLAY 'FLD0728B ==> ' HEX-OF (FLD0728B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0728B).
           IF FLD0728E   NOT EQUAL XPC-FLD0728E
              DISPLAY 'FLD0728E  ==> ' FLD0728E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0728E.
           IF FLD0729B (1:)    NOT EQUAL XPC-FLD0729B
              DISPLAY 'FLD0729B ==> ' HEX-OF (FLD0729B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0729B).
           IF FLD0729E   NOT EQUAL XPC-FLD0729E
              DISPLAY 'FLD0729E  ==> ' FLD0729E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0729E.
           IF FLD0730B (1:)    NOT EQUAL XPC-FLD0730B
              DISPLAY 'FLD0730B ==> ' HEX-OF (FLD0730B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0730B).
           IF FLD0730E   NOT EQUAL XPC-FLD0730E
              DISPLAY 'FLD0730E  ==> ' FLD0730E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0730E.
           IF FLD0731B (1:)    NOT EQUAL XPC-FLD0731B
              DISPLAY 'FLD0731B ==> ' HEX-OF (FLD0731B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0731B).
           IF FLD0731E   NOT EQUAL XPC-FLD0731E
              DISPLAY 'FLD0731E  ==> ' FLD0731E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0731E.
           IF FLD0732B (1:)    NOT EQUAL XPC-FLD0732B
              DISPLAY 'FLD0732B ==> ' HEX-OF (FLD0732B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0732B).
           IF FLD0732E   NOT EQUAL XPC-FLD0732E
              DISPLAY 'FLD0732E  ==> ' FLD0732E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0732E.
           IF FLD0733B (1:)    NOT EQUAL XPC-FLD0733B
              DISPLAY 'FLD0733B ==> ' HEX-OF (FLD0733B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0733B).
           IF FLD0733E   NOT EQUAL XPC-FLD0733E
              DISPLAY 'FLD0733E  ==> ' FLD0733E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0733E.
           IF FLD0734B (1:)    NOT EQUAL XPC-FLD0734B
              DISPLAY 'FLD0734B ==> ' HEX-OF (FLD0734B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0734B).
           IF FLD0734E   NOT EQUAL XPC-FLD0734E
              DISPLAY 'FLD0734E  ==> ' FLD0734E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0734E.
           IF FLD0735B (1:)    NOT EQUAL XPC-FLD0735B
              DISPLAY 'FLD0735B ==> ' HEX-OF (FLD0735B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0735B).
           IF FLD0735E   NOT EQUAL XPC-FLD0735E
              DISPLAY 'FLD0735E  ==> ' FLD0735E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0735E.
           IF FLD0736B (1:)    NOT EQUAL XPC-FLD0736B
              DISPLAY 'FLD0736B ==> ' HEX-OF (FLD0736B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0736B).
           IF FLD0736E   NOT EQUAL XPC-FLD0736E
              DISPLAY 'FLD0736E  ==> ' FLD0736E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0736E.
           IF FLD0737B (1:)    NOT EQUAL XPC-FLD0737B
              DISPLAY 'FLD0737B ==> ' HEX-OF (FLD0737B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0737B).
           IF FLD0737E   NOT EQUAL XPC-FLD0737E
              DISPLAY 'FLD0737E  ==> ' FLD0737E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0737E.
           IF FLD0738B (1:)    NOT EQUAL XPC-FLD0738B
              DISPLAY 'FLD0738B ==> ' HEX-OF (FLD0738B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0738B).
           IF FLD0738E   NOT EQUAL XPC-FLD0738E
              DISPLAY 'FLD0738E  ==> ' FLD0738E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0738E.
           IF FLD0739B (1:)    NOT EQUAL XPC-FLD0739B
              DISPLAY 'FLD0739B ==> ' HEX-OF (FLD0739B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0739B).
           IF FLD0739E   NOT EQUAL XPC-FLD0739E
              DISPLAY 'FLD0739E  ==> ' FLD0739E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0739E.
           IF FLD0740B (1:)    NOT EQUAL XPC-FLD0740B
              DISPLAY 'FLD0740B ==> ' HEX-OF (FLD0740B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0740B).
           IF FLD0740E   NOT EQUAL XPC-FLD0740E
              DISPLAY 'FLD0740E  ==> ' FLD0740E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0740E.
           IF FLD0741B (1:)    NOT EQUAL XPC-FLD0741B
              DISPLAY 'FLD0741B ==> ' HEX-OF (FLD0741B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0741B).
           IF FLD0741E   NOT EQUAL XPC-FLD0741E
              DISPLAY 'FLD0741E  ==> ' FLD0741E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0741E.
           IF FLD0742B (1:)    NOT EQUAL XPC-FLD0742B
              DISPLAY 'FLD0742B ==> ' HEX-OF (FLD0742B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0742B).
           IF FLD0742E   NOT EQUAL XPC-FLD0742E
              DISPLAY 'FLD0742E  ==> ' FLD0742E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0742E.
           IF FLD0743B (1:)    NOT EQUAL XPC-FLD0743B
              DISPLAY 'FLD0743B ==> ' HEX-OF (FLD0743B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0743B).
           IF FLD0743E   NOT EQUAL XPC-FLD0743E
              DISPLAY 'FLD0743E  ==> ' FLD0743E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0743E.
           IF FLD0744B (1:)    NOT EQUAL XPC-FLD0744B
              DISPLAY 'FLD0744B ==> ' HEX-OF (FLD0744B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0744B).
           IF FLD0744E   NOT EQUAL XPC-FLD0744E
              DISPLAY 'FLD0744E  ==> ' FLD0744E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0744E.
           IF FLD0745B (1:)    NOT EQUAL XPC-FLD0745B
              DISPLAY 'FLD0745B ==> ' HEX-OF (FLD0745B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0745B).
           IF FLD0745E   NOT EQUAL XPC-FLD0745E
              DISPLAY 'FLD0745E  ==> ' FLD0745E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0745E.
           IF FLD0746B (1:)    NOT EQUAL XPC-FLD0746B
              DISPLAY 'FLD0746B ==> ' HEX-OF (FLD0746B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0746B).
           IF FLD0746E   NOT EQUAL XPC-FLD0746E
              DISPLAY 'FLD0746E  ==> ' FLD0746E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0746E.
           IF FLD0747B (1:)    NOT EQUAL XPC-FLD0747B
              DISPLAY 'FLD0747B ==> ' HEX-OF (FLD0747B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0747B).
           IF FLD0747E   NOT EQUAL XPC-FLD0747E
              DISPLAY 'FLD0747E  ==> ' FLD0747E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0747E.
           IF FLD0748B (1:)    NOT EQUAL XPC-FLD0748B
              DISPLAY 'FLD0748B ==> ' HEX-OF (FLD0748B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0748B).
           IF FLD0748E   NOT EQUAL XPC-FLD0748E
              DISPLAY 'FLD0748E  ==> ' FLD0748E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0748E.
           IF FLD0749B (1:)    NOT EQUAL XPC-FLD0749B
              DISPLAY 'FLD0749B ==> ' HEX-OF (FLD0749B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0749B).
           IF FLD0749E   NOT EQUAL XPC-FLD0749E
              DISPLAY 'FLD0749E  ==> ' FLD0749E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0749E.
           IF FLD0750B (1:)    NOT EQUAL XPC-FLD0750B
              DISPLAY 'FLD0750B ==> ' HEX-OF (FLD0750B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0750B).
           IF FLD0750E   NOT EQUAL XPC-FLD0750E
              DISPLAY 'FLD0750E  ==> ' FLD0750E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0750E.
           IF FLD0751B (1:)    NOT EQUAL XPC-FLD0751B
              DISPLAY 'FLD0751B ==> ' HEX-OF (FLD0751B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0751B).
           IF FLD0751E   NOT EQUAL XPC-FLD0751E
              DISPLAY 'FLD0751E  ==> ' FLD0751E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0751E.
           IF FLD0752B (1:)    NOT EQUAL XPC-FLD0752B
              DISPLAY 'FLD0752B ==> ' HEX-OF (FLD0752B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0752B).
           IF FLD0752E   NOT EQUAL XPC-FLD0752E
              DISPLAY 'FLD0752E  ==> ' FLD0752E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0752E.
           IF FLD0753B (1:)    NOT EQUAL XPC-FLD0753B
              DISPLAY 'FLD0753B ==> ' HEX-OF (FLD0753B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0753B).
           IF FLD0753E   NOT EQUAL XPC-FLD0753E
              DISPLAY 'FLD0753E  ==> ' FLD0753E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0753E.
           IF FLD0754B (1:)    NOT EQUAL XPC-FLD0754B
              DISPLAY 'FLD0754B ==> ' HEX-OF (FLD0754B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0754B).
           IF FLD0754E   NOT EQUAL XPC-FLD0754E
              DISPLAY 'FLD0754E  ==> ' FLD0754E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0754E.
           IF FLD0755B (1:)    NOT EQUAL XPC-FLD0755B
              DISPLAY 'FLD0755B ==> ' HEX-OF (FLD0755B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0755B).
           IF FLD0755E   NOT EQUAL XPC-FLD0755E
              DISPLAY 'FLD0755E  ==> ' FLD0755E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0755E.
           IF FLD0756B (1:)    NOT EQUAL XPC-FLD0756B
              DISPLAY 'FLD0756B ==> ' HEX-OF (FLD0756B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0756B).
           IF FLD0756E   NOT EQUAL XPC-FLD0756E
              DISPLAY 'FLD0756E  ==> ' FLD0756E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0756E.
           IF FLD0757B (1:)    NOT EQUAL XPC-FLD0757B
              DISPLAY 'FLD0757B ==> ' HEX-OF (FLD0757B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0757B).
           IF FLD0757E   NOT EQUAL XPC-FLD0757E
              DISPLAY 'FLD0757E  ==> ' FLD0757E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0757E.
           IF FLD0758B (1:)    NOT EQUAL XPC-FLD0758B
              DISPLAY 'FLD0758B ==> ' HEX-OF (FLD0758B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0758B).
           IF FLD0758E   NOT EQUAL XPC-FLD0758E
              DISPLAY 'FLD0758E  ==> ' FLD0758E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0758E.
           IF FLD0759B (1:)    NOT EQUAL XPC-FLD0759B
              DISPLAY 'FLD0759B ==> ' HEX-OF (FLD0759B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0759B).
           IF FLD0759E   NOT EQUAL XPC-FLD0759E
              DISPLAY 'FLD0759E  ==> ' FLD0759E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0759E.
           IF FLD0760B (1:)    NOT EQUAL XPC-FLD0760B
              DISPLAY 'FLD0760B ==> ' HEX-OF (FLD0760B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0760B).
           IF FLD0760E   NOT EQUAL XPC-FLD0760E
              DISPLAY 'FLD0760E  ==> ' FLD0760E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0760E.
           IF FLD0761B (1:)    NOT EQUAL XPC-FLD0761B
              DISPLAY 'FLD0761B ==> ' HEX-OF (FLD0761B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0761B).
           IF FLD0761E   NOT EQUAL XPC-FLD0761E
              DISPLAY 'FLD0761E  ==> ' FLD0761E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0761E.
           IF FLD0762B (1:)    NOT EQUAL XPC-FLD0762B
              DISPLAY 'FLD0762B ==> ' HEX-OF (FLD0762B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0762B).
           IF FLD0762E   NOT EQUAL XPC-FLD0762E
              DISPLAY 'FLD0762E  ==> ' FLD0762E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0762E.
           IF FLD0763B (1:)    NOT EQUAL XPC-FLD0763B
              DISPLAY 'FLD0763B ==> ' HEX-OF (FLD0763B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0763B).
           IF FLD0763E   NOT EQUAL XPC-FLD0763E
              DISPLAY 'FLD0763E  ==> ' FLD0763E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0763E.
           IF FLD0764B (1:)    NOT EQUAL XPC-FLD0764B
              DISPLAY 'FLD0764B ==> ' HEX-OF (FLD0764B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0764B).
           IF FLD0764E   NOT EQUAL XPC-FLD0764E
              DISPLAY 'FLD0764E  ==> ' FLD0764E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0764E.
           IF FLD0765B (1:)    NOT EQUAL XPC-FLD0765B
              DISPLAY 'FLD0765B ==> ' HEX-OF (FLD0765B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0765B).
           IF FLD0765E   NOT EQUAL XPC-FLD0765E
              DISPLAY 'FLD0765E  ==> ' FLD0765E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0765E.
           IF FLD0766B (1:)    NOT EQUAL XPC-FLD0766B
              DISPLAY 'FLD0766B ==> ' HEX-OF (FLD0766B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0766B).
           IF FLD0766E   NOT EQUAL XPC-FLD0766E
              DISPLAY 'FLD0766E  ==> ' FLD0766E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0766E.
           IF FLD0767B (1:)    NOT EQUAL XPC-FLD0767B
              DISPLAY 'FLD0767B ==> ' HEX-OF (FLD0767B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0767B).
           IF FLD0767E   NOT EQUAL XPC-FLD0767E
              DISPLAY 'FLD0767E  ==> ' FLD0767E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0767E.
           IF FLD0768B (1:)    NOT EQUAL XPC-FLD0768B
              DISPLAY 'FLD0768B ==> ' HEX-OF (FLD0768B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0768B).
           IF FLD0768E   NOT EQUAL XPC-FLD0768E
              DISPLAY 'FLD0768E  ==> ' FLD0768E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0768E.
           IF FLD0769B (1:)    NOT EQUAL XPC-FLD0769B
              DISPLAY 'FLD0769B ==> ' HEX-OF (FLD0769B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0769B).
           IF FLD0769E   NOT EQUAL XPC-FLD0769E
              DISPLAY 'FLD0769E  ==> ' FLD0769E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0769E.
           IF FLD0770B (1:)    NOT EQUAL XPC-FLD0770B
              DISPLAY 'FLD0770B ==> ' HEX-OF (FLD0770B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0770B).
           IF FLD0770E   NOT EQUAL XPC-FLD0770E
              DISPLAY 'FLD0770E  ==> ' FLD0770E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0770E.
           IF FLD0771B (1:)    NOT EQUAL XPC-FLD0771B
              DISPLAY 'FLD0771B ==> ' HEX-OF (FLD0771B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0771B).
           IF FLD0771E   NOT EQUAL XPC-FLD0771E
              DISPLAY 'FLD0771E  ==> ' FLD0771E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0771E.
           IF FLD0772B (1:)    NOT EQUAL XPC-FLD0772B
              DISPLAY 'FLD0772B ==> ' HEX-OF (FLD0772B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0772B).
           IF FLD0772E   NOT EQUAL XPC-FLD0772E
              DISPLAY 'FLD0772E  ==> ' FLD0772E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0772E.
           IF FLD0773B (1:)    NOT EQUAL XPC-FLD0773B
              DISPLAY 'FLD0773B ==> ' HEX-OF (FLD0773B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0773B).
           IF FLD0773E   NOT EQUAL XPC-FLD0773E
              DISPLAY 'FLD0773E  ==> ' FLD0773E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0773E.
           IF FLD0774B (1:)    NOT EQUAL XPC-FLD0774B
              DISPLAY 'FLD0774B ==> ' HEX-OF (FLD0774B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0774B).
           IF FLD0774E   NOT EQUAL XPC-FLD0774E
              DISPLAY 'FLD0774E  ==> ' FLD0774E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0774E.
           IF FLD0775B (1:)    NOT EQUAL XPC-FLD0775B
              DISPLAY 'FLD0775B ==> ' HEX-OF (FLD0775B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0775B).
           IF FLD0775E   NOT EQUAL XPC-FLD0775E
              DISPLAY 'FLD0775E  ==> ' FLD0775E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0775E.
           IF FLD0776B (1:)    NOT EQUAL XPC-FLD0776B
              DISPLAY 'FLD0776B ==> ' HEX-OF (FLD0776B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0776B).
           IF FLD0776E   NOT EQUAL XPC-FLD0776E
              DISPLAY 'FLD0776E  ==> ' FLD0776E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0776E.
           IF FLD0777B (1:)    NOT EQUAL XPC-FLD0777B
              DISPLAY 'FLD0777B ==> ' HEX-OF (FLD0777B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0777B).
           IF FLD0777E   NOT EQUAL XPC-FLD0777E
              DISPLAY 'FLD0777E  ==> ' FLD0777E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0777E.
           IF FLD0778B (1:)    NOT EQUAL XPC-FLD0778B
              DISPLAY 'FLD0778B ==> ' HEX-OF (FLD0778B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0778B).
           IF FLD0778E   NOT EQUAL XPC-FLD0778E
              DISPLAY 'FLD0778E  ==> ' FLD0778E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0778E.
           IF FLD0779B (1:)    NOT EQUAL XPC-FLD0779B
              DISPLAY 'FLD0779B ==> ' HEX-OF (FLD0779B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0779B).
           IF FLD0779E   NOT EQUAL XPC-FLD0779E
              DISPLAY 'FLD0779E  ==> ' FLD0779E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0779E.
           IF FLD0780B (1:)    NOT EQUAL XPC-FLD0780B
              DISPLAY 'FLD0780B ==> ' HEX-OF (FLD0780B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0780B).
           IF FLD0780E   NOT EQUAL XPC-FLD0780E
              DISPLAY 'FLD0780E  ==> ' FLD0780E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0780E.
           IF FLD0781B (1:)    NOT EQUAL XPC-FLD0781B
              DISPLAY 'FLD0781B ==> ' HEX-OF (FLD0781B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0781B).
           IF FLD0781E   NOT EQUAL XPC-FLD0781E
              DISPLAY 'FLD0781E  ==> ' FLD0781E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0781E.
           IF FLD0782B (1:)    NOT EQUAL XPC-FLD0782B
              DISPLAY 'FLD0782B ==> ' HEX-OF (FLD0782B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0782B).
           IF FLD0782E   NOT EQUAL XPC-FLD0782E
              DISPLAY 'FLD0782E  ==> ' FLD0782E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0782E.
           IF FLD0783B (1:)    NOT EQUAL XPC-FLD0783B
              DISPLAY 'FLD0783B ==> ' HEX-OF (FLD0783B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0783B).
           IF FLD0783E   NOT EQUAL XPC-FLD0783E
              DISPLAY 'FLD0783E  ==> ' FLD0783E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0783E.
           IF FLD0784B (1:)    NOT EQUAL XPC-FLD0784B
              DISPLAY 'FLD0784B ==> ' HEX-OF (FLD0784B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0784B).
           IF FLD0784E   NOT EQUAL XPC-FLD0784E
              DISPLAY 'FLD0784E  ==> ' FLD0784E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0784E.
           IF FLD0785B (1:)    NOT EQUAL XPC-FLD0785B
              DISPLAY 'FLD0785B ==> ' HEX-OF (FLD0785B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0785B).
           IF FLD0785E   NOT EQUAL XPC-FLD0785E
              DISPLAY 'FLD0785E  ==> ' FLD0785E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0785E.
           IF FLD0786B (1:)    NOT EQUAL XPC-FLD0786B
              DISPLAY 'FLD0786B ==> ' HEX-OF (FLD0786B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0786B).
           IF FLD0786E   NOT EQUAL XPC-FLD0786E
              DISPLAY 'FLD0786E  ==> ' FLD0786E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0786E.
           IF FLD0787B (1:)    NOT EQUAL XPC-FLD0787B
              DISPLAY 'FLD0787B ==> ' HEX-OF (FLD0787B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0787B).
           IF FLD0787E   NOT EQUAL XPC-FLD0787E
              DISPLAY 'FLD0787E  ==> ' FLD0787E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0787E.
           IF FLD0788B (1:)    NOT EQUAL XPC-FLD0788B
              DISPLAY 'FLD0788B ==> ' HEX-OF (FLD0788B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0788B).
           IF FLD0788E   NOT EQUAL XPC-FLD0788E
              DISPLAY 'FLD0788E  ==> ' FLD0788E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0788E.
           IF FLD0789B (1:)    NOT EQUAL XPC-FLD0789B
              DISPLAY 'FLD0789B ==> ' HEX-OF (FLD0789B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0789B).
           IF FLD0789E   NOT EQUAL XPC-FLD0789E
              DISPLAY 'FLD0789E  ==> ' FLD0789E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0789E.
           IF FLD0790B (1:)    NOT EQUAL XPC-FLD0790B
              DISPLAY 'FLD0790B ==> ' HEX-OF (FLD0790B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0790B).
           IF FLD0790E   NOT EQUAL XPC-FLD0790E
              DISPLAY 'FLD0790E  ==> ' FLD0790E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0790E.
           IF FLD0791B (1:)    NOT EQUAL XPC-FLD0791B
              DISPLAY 'FLD0791B ==> ' HEX-OF (FLD0791B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0791B).
           IF FLD0791E   NOT EQUAL XPC-FLD0791E
              DISPLAY 'FLD0791E  ==> ' FLD0791E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0791E.
           IF FLD0792B (1:)    NOT EQUAL XPC-FLD0792B
              DISPLAY 'FLD0792B ==> ' HEX-OF (FLD0792B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0792B).
           IF FLD0792E   NOT EQUAL XPC-FLD0792E
              DISPLAY 'FLD0792E  ==> ' FLD0792E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0792E.
           IF FLD0793B (1:)    NOT EQUAL XPC-FLD0793B
              DISPLAY 'FLD0793B ==> ' HEX-OF (FLD0793B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0793B).
           IF FLD0793E   NOT EQUAL XPC-FLD0793E
              DISPLAY 'FLD0793E  ==> ' FLD0793E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0793E.
           IF FLD0794B (1:)    NOT EQUAL XPC-FLD0794B
              DISPLAY 'FLD0794B ==> ' HEX-OF (FLD0794B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0794B).
           IF FLD0794E   NOT EQUAL XPC-FLD0794E
              DISPLAY 'FLD0794E  ==> ' FLD0794E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0794E.
           IF FLD0795B (1:)    NOT EQUAL XPC-FLD0795B
              DISPLAY 'FLD0795B ==> ' HEX-OF (FLD0795B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0795B).
           IF FLD0795E   NOT EQUAL XPC-FLD0795E
              DISPLAY 'FLD0795E  ==> ' FLD0795E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0795E.
           IF FLD0796B (1:)    NOT EQUAL XPC-FLD0796B
              DISPLAY 'FLD0796B ==> ' HEX-OF (FLD0796B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0796B).
           IF FLD0796E   NOT EQUAL XPC-FLD0796E
              DISPLAY 'FLD0796E  ==> ' FLD0796E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0796E.
           IF FLD0797B (1:)    NOT EQUAL XPC-FLD0797B
              DISPLAY 'FLD0797B ==> ' HEX-OF (FLD0797B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0797B).
           IF FLD0797E   NOT EQUAL XPC-FLD0797E
              DISPLAY 'FLD0797E  ==> ' FLD0797E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0797E.
           IF FLD0798B (1:)    NOT EQUAL XPC-FLD0798B
              DISPLAY 'FLD0798B ==> ' HEX-OF (FLD0798B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0798B).
           IF FLD0798E   NOT EQUAL XPC-FLD0798E
              DISPLAY 'FLD0798E  ==> ' FLD0798E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0798E.
           IF FLD0799B (1:)    NOT EQUAL XPC-FLD0799B
              DISPLAY 'FLD0799B ==> ' HEX-OF (FLD0799B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0799B).
           IF FLD0799E   NOT EQUAL XPC-FLD0799E
              DISPLAY 'FLD0799E  ==> ' FLD0799E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0799E.
           IF FLD0800B (1:)    NOT EQUAL XPC-FLD0800B
              DISPLAY 'FLD0800B ==> ' HEX-OF (FLD0800B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0800B).
           IF FLD0800E   NOT EQUAL XPC-FLD0800E
              DISPLAY 'FLD0800E  ==> ' FLD0800E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0800E.
           IF FLD0801B (1:)    NOT EQUAL XPC-FLD0801B
              DISPLAY 'FLD0801B ==> ' HEX-OF (FLD0801B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0801B).
           IF FLD0801E   NOT EQUAL XPC-FLD0801E
              DISPLAY 'FLD0801E  ==> ' FLD0801E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0801E.
           IF FLD0802B (1:)    NOT EQUAL XPC-FLD0802B
              DISPLAY 'FLD0802B ==> ' HEX-OF (FLD0802B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0802B).
           IF FLD0802E   NOT EQUAL XPC-FLD0802E
              DISPLAY 'FLD0802E  ==> ' FLD0802E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0802E.
           IF FLD0803B (1:)    NOT EQUAL XPC-FLD0803B
              DISPLAY 'FLD0803B ==> ' HEX-OF (FLD0803B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0803B).
           IF FLD0803E   NOT EQUAL XPC-FLD0803E
              DISPLAY 'FLD0803E  ==> ' FLD0803E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0803E.
           IF FLD0804B (1:)    NOT EQUAL XPC-FLD0804B
              DISPLAY 'FLD0804B ==> ' HEX-OF (FLD0804B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0804B).
           IF FLD0804E   NOT EQUAL XPC-FLD0804E
              DISPLAY 'FLD0804E  ==> ' FLD0804E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0804E.
           IF FLD0805B (1:)    NOT EQUAL XPC-FLD0805B
              DISPLAY 'FLD0805B ==> ' HEX-OF (FLD0805B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0805B).
           IF FLD0805E   NOT EQUAL XPC-FLD0805E
              DISPLAY 'FLD0805E  ==> ' FLD0805E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0805E.
           IF FLD0806B (1:)    NOT EQUAL XPC-FLD0806B
              DISPLAY 'FLD0806B ==> ' HEX-OF (FLD0806B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0806B).
           IF FLD0806E   NOT EQUAL XPC-FLD0806E
              DISPLAY 'FLD0806E  ==> ' FLD0806E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0806E.
           IF FLD0807B (1:)    NOT EQUAL XPC-FLD0807B
              DISPLAY 'FLD0807B ==> ' HEX-OF (FLD0807B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0807B).
           IF FLD0807E   NOT EQUAL XPC-FLD0807E
              DISPLAY 'FLD0807E  ==> ' FLD0807E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0807E.
           IF FLD0808B (1:)    NOT EQUAL XPC-FLD0808B
              DISPLAY 'FLD0808B ==> ' HEX-OF (FLD0808B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0808B).
           IF FLD0808E   NOT EQUAL XPC-FLD0808E
              DISPLAY 'FLD0808E  ==> ' FLD0808E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0808E.
           IF FLD0809B (1:)    NOT EQUAL XPC-FLD0809B
              DISPLAY 'FLD0809B ==> ' HEX-OF (FLD0809B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0809B).
           IF FLD0809E   NOT EQUAL XPC-FLD0809E
              DISPLAY 'FLD0809E  ==> ' FLD0809E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0809E.
           IF FLD0810B (1:)    NOT EQUAL XPC-FLD0810B
              DISPLAY 'FLD0810B ==> ' HEX-OF (FLD0810B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0810B).
           IF FLD0810E   NOT EQUAL XPC-FLD0810E
              DISPLAY 'FLD0810E  ==> ' FLD0810E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0810E.
           IF FLD0811B (1:)    NOT EQUAL XPC-FLD0811B
              DISPLAY 'FLD0811B ==> ' HEX-OF (FLD0811B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0811B).
           IF FLD0811E   NOT EQUAL XPC-FLD0811E
              DISPLAY 'FLD0811E  ==> ' FLD0811E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0811E.
           IF FLD0812B (1:)    NOT EQUAL XPC-FLD0812B
              DISPLAY 'FLD0812B ==> ' HEX-OF (FLD0812B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0812B).
           IF FLD0812E   NOT EQUAL XPC-FLD0812E
              DISPLAY 'FLD0812E  ==> ' FLD0812E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0812E.
           IF FLD0813B (1:)    NOT EQUAL XPC-FLD0813B
              DISPLAY 'FLD0813B ==> ' HEX-OF (FLD0813B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0813B).
           IF FLD0813E   NOT EQUAL XPC-FLD0813E
              DISPLAY 'FLD0813E  ==> ' FLD0813E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0813E.
           IF FLD0814B (1:)    NOT EQUAL XPC-FLD0814B
              DISPLAY 'FLD0814B ==> ' HEX-OF (FLD0814B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0814B).
           IF FLD0814E   NOT EQUAL XPC-FLD0814E
              DISPLAY 'FLD0814E  ==> ' FLD0814E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0814E.
           IF FLD0815B (1:)    NOT EQUAL XPC-FLD0815B
              DISPLAY 'FLD0815B ==> ' HEX-OF (FLD0815B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0815B).
           IF FLD0815E   NOT EQUAL XPC-FLD0815E
              DISPLAY 'FLD0815E  ==> ' FLD0815E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0815E.
           IF FLD0816B (1:)    NOT EQUAL XPC-FLD0816B
              DISPLAY 'FLD0816B ==> ' HEX-OF (FLD0816B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0816B).
           IF FLD0816E   NOT EQUAL XPC-FLD0816E
              DISPLAY 'FLD0816E  ==> ' FLD0816E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0816E.
           IF FLD0817B (1:)    NOT EQUAL XPC-FLD0817B
              DISPLAY 'FLD0817B ==> ' HEX-OF (FLD0817B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0817B).
           IF FLD0817E   NOT EQUAL XPC-FLD0817E
              DISPLAY 'FLD0817E  ==> ' FLD0817E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0817E.
           IF FLD0818B (1:)    NOT EQUAL XPC-FLD0818B
              DISPLAY 'FLD0818B ==> ' HEX-OF (FLD0818B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0818B).
           IF FLD0818E   NOT EQUAL XPC-FLD0818E
              DISPLAY 'FLD0818E  ==> ' FLD0818E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0818E.
           IF FLD0819B (1:)    NOT EQUAL XPC-FLD0819B
              DISPLAY 'FLD0819B ==> ' HEX-OF (FLD0819B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0819B).
           IF FLD0819E   NOT EQUAL XPC-FLD0819E
              DISPLAY 'FLD0819E  ==> ' FLD0819E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0819E.
           IF FLD0820B (1:)    NOT EQUAL XPC-FLD0820B
              DISPLAY 'FLD0820B ==> ' HEX-OF (FLD0820B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0820B).
           IF FLD0820E   NOT EQUAL XPC-FLD0820E
              DISPLAY 'FLD0820E  ==> ' FLD0820E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0820E.
           IF FLD0821B (1:)    NOT EQUAL XPC-FLD0821B
              DISPLAY 'FLD0821B ==> ' HEX-OF (FLD0821B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0821B).
           IF FLD0821E   NOT EQUAL XPC-FLD0821E
              DISPLAY 'FLD0821E  ==> ' FLD0821E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0821E.
           IF FLD0822B (1:)    NOT EQUAL XPC-FLD0822B
              DISPLAY 'FLD0822B ==> ' HEX-OF (FLD0822B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0822B).
           IF FLD0822E   NOT EQUAL XPC-FLD0822E
              DISPLAY 'FLD0822E  ==> ' FLD0822E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0822E.
           IF FLD0823B (1:)    NOT EQUAL XPC-FLD0823B
              DISPLAY 'FLD0823B ==> ' HEX-OF (FLD0823B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0823B).
           IF FLD0823E   NOT EQUAL XPC-FLD0823E
              DISPLAY 'FLD0823E  ==> ' FLD0823E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0823E.
           IF FLD0824B (1:)    NOT EQUAL XPC-FLD0824B
              DISPLAY 'FLD0824B ==> ' HEX-OF (FLD0824B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0824B).
           IF FLD0824E   NOT EQUAL XPC-FLD0824E
              DISPLAY 'FLD0824E  ==> ' FLD0824E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0824E.
           IF FLD0825B (1:)    NOT EQUAL XPC-FLD0825B
              DISPLAY 'FLD0825B ==> ' HEX-OF (FLD0825B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0825B).
           IF FLD0825E   NOT EQUAL XPC-FLD0825E
              DISPLAY 'FLD0825E  ==> ' FLD0825E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0825E.
           IF FLD0826B (1:)    NOT EQUAL XPC-FLD0826B
              DISPLAY 'FLD0826B ==> ' HEX-OF (FLD0826B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0826B).
           IF FLD0826E   NOT EQUAL XPC-FLD0826E
              DISPLAY 'FLD0826E  ==> ' FLD0826E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0826E.
           IF FLD0827B (1:)    NOT EQUAL XPC-FLD0827B
              DISPLAY 'FLD0827B ==> ' HEX-OF (FLD0827B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0827B).
           IF FLD0827E   NOT EQUAL XPC-FLD0827E
              DISPLAY 'FLD0827E  ==> ' FLD0827E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0827E.
           IF FLD0828B (1:)    NOT EQUAL XPC-FLD0828B
              DISPLAY 'FLD0828B ==> ' HEX-OF (FLD0828B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0828B).
           IF FLD0828E   NOT EQUAL XPC-FLD0828E
              DISPLAY 'FLD0828E  ==> ' FLD0828E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0828E.
           IF FLD0829B (1:)    NOT EQUAL XPC-FLD0829B
              DISPLAY 'FLD0829B ==> ' HEX-OF (FLD0829B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0829B).
           IF FLD0829E   NOT EQUAL XPC-FLD0829E
              DISPLAY 'FLD0829E  ==> ' FLD0829E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0829E.
           IF FLD0830B (1:)    NOT EQUAL XPC-FLD0830B
              DISPLAY 'FLD0830B ==> ' HEX-OF (FLD0830B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0830B).
           IF FLD0830E   NOT EQUAL XPC-FLD0830E
              DISPLAY 'FLD0830E  ==> ' FLD0830E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0830E.
           IF FLD0831B (1:)    NOT EQUAL XPC-FLD0831B
              DISPLAY 'FLD0831B ==> ' HEX-OF (FLD0831B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0831B).
           IF FLD0831E   NOT EQUAL XPC-FLD0831E
              DISPLAY 'FLD0831E  ==> ' FLD0831E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0831E.
           IF FLD0832B (1:)    NOT EQUAL XPC-FLD0832B
              DISPLAY 'FLD0832B ==> ' HEX-OF (FLD0832B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0832B).
           IF FLD0832E   NOT EQUAL XPC-FLD0832E
              DISPLAY 'FLD0832E  ==> ' FLD0832E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0832E.
           IF FLD0833B (1:)    NOT EQUAL XPC-FLD0833B
              DISPLAY 'FLD0833B ==> ' HEX-OF (FLD0833B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0833B).
           IF FLD0833E   NOT EQUAL XPC-FLD0833E
              DISPLAY 'FLD0833E  ==> ' FLD0833E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0833E.
           IF FLD0834B (1:)    NOT EQUAL XPC-FLD0834B
              DISPLAY 'FLD0834B ==> ' HEX-OF (FLD0834B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0834B).
           IF FLD0834E   NOT EQUAL XPC-FLD0834E
              DISPLAY 'FLD0834E  ==> ' FLD0834E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0834E.
           IF FLD0835B (1:)    NOT EQUAL XPC-FLD0835B
              DISPLAY 'FLD0835B ==> ' HEX-OF (FLD0835B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0835B).
           IF FLD0835E   NOT EQUAL XPC-FLD0835E
              DISPLAY 'FLD0835E  ==> ' FLD0835E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0835E.
           IF FLD0836B (1:)    NOT EQUAL XPC-FLD0836B
              DISPLAY 'FLD0836B ==> ' HEX-OF (FLD0836B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0836B).
           IF FLD0836E   NOT EQUAL XPC-FLD0836E
              DISPLAY 'FLD0836E  ==> ' FLD0836E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0836E.
           IF FLD0837B (1:)    NOT EQUAL XPC-FLD0837B
              DISPLAY 'FLD0837B ==> ' HEX-OF (FLD0837B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0837B).
           IF FLD0837E   NOT EQUAL XPC-FLD0837E
              DISPLAY 'FLD0837E  ==> ' FLD0837E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0837E.
           IF FLD0838B (1:)    NOT EQUAL XPC-FLD0838B
              DISPLAY 'FLD0838B ==> ' HEX-OF (FLD0838B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0838B).
           IF FLD0838E   NOT EQUAL XPC-FLD0838E
              DISPLAY 'FLD0838E  ==> ' FLD0838E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0838E.
           IF FLD0839B (1:)    NOT EQUAL XPC-FLD0839B
              DISPLAY 'FLD0839B ==> ' HEX-OF (FLD0839B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0839B).
           IF FLD0839E   NOT EQUAL XPC-FLD0839E
              DISPLAY 'FLD0839E  ==> ' FLD0839E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0839E.
           IF FLD0840B (1:)    NOT EQUAL XPC-FLD0840B
              DISPLAY 'FLD0840B ==> ' HEX-OF (FLD0840B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0840B).
           IF FLD0840E   NOT EQUAL XPC-FLD0840E
              DISPLAY 'FLD0840E  ==> ' FLD0840E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0840E.
           IF FLD0841B (1:)    NOT EQUAL XPC-FLD0841B
              DISPLAY 'FLD0841B ==> ' HEX-OF (FLD0841B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0841B).
           IF FLD0841E   NOT EQUAL XPC-FLD0841E
              DISPLAY 'FLD0841E  ==> ' FLD0841E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0841E.
           IF FLD0842B (1:)    NOT EQUAL XPC-FLD0842B
              DISPLAY 'FLD0842B ==> ' HEX-OF (FLD0842B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0842B).
           IF FLD0842E   NOT EQUAL XPC-FLD0842E
              DISPLAY 'FLD0842E  ==> ' FLD0842E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0842E.
           IF FLD0843B (1:)    NOT EQUAL XPC-FLD0843B
              DISPLAY 'FLD0843B ==> ' HEX-OF (FLD0843B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0843B).
           IF FLD0843E   NOT EQUAL XPC-FLD0843E
              DISPLAY 'FLD0843E  ==> ' FLD0843E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0843E.
           IF FLD0844B (1:)    NOT EQUAL XPC-FLD0844B
              DISPLAY 'FLD0844B ==> ' HEX-OF (FLD0844B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0844B).
           IF FLD0844E   NOT EQUAL XPC-FLD0844E
              DISPLAY 'FLD0844E  ==> ' FLD0844E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0844E.
           IF FLD0845B (1:)    NOT EQUAL XPC-FLD0845B
              DISPLAY 'FLD0845B ==> ' HEX-OF (FLD0845B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0845B).
           IF FLD0845E   NOT EQUAL XPC-FLD0845E
              DISPLAY 'FLD0845E  ==> ' FLD0845E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0845E.
           IF FLD0846B (1:)    NOT EQUAL XPC-FLD0846B
              DISPLAY 'FLD0846B ==> ' HEX-OF (FLD0846B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0846B).
           IF FLD0846E   NOT EQUAL XPC-FLD0846E
              DISPLAY 'FLD0846E  ==> ' FLD0846E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0846E.
           IF FLD0847B (1:)    NOT EQUAL XPC-FLD0847B
              DISPLAY 'FLD0847B ==> ' HEX-OF (FLD0847B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0847B).
           IF FLD0847E   NOT EQUAL XPC-FLD0847E
              DISPLAY 'FLD0847E  ==> ' FLD0847E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0847E.
           IF FLD0848B (1:)    NOT EQUAL XPC-FLD0848B
              DISPLAY 'FLD0848B ==> ' HEX-OF (FLD0848B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0848B).
           IF FLD0848E   NOT EQUAL XPC-FLD0848E
              DISPLAY 'FLD0848E  ==> ' FLD0848E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0848E.
           IF FLD0849B (1:)    NOT EQUAL XPC-FLD0849B
              DISPLAY 'FLD0849B ==> ' HEX-OF (FLD0849B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0849B).
           IF FLD0849E   NOT EQUAL XPC-FLD0849E
              DISPLAY 'FLD0849E  ==> ' FLD0849E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0849E.
           IF FLD0850B (1:)    NOT EQUAL XPC-FLD0850B
              DISPLAY 'FLD0850B ==> ' HEX-OF (FLD0850B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0850B).
           IF FLD0850E   NOT EQUAL XPC-FLD0850E
              DISPLAY 'FLD0850E  ==> ' FLD0850E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0850E.
           IF FLD0851B (1:)    NOT EQUAL XPC-FLD0851B
              DISPLAY 'FLD0851B ==> ' HEX-OF (FLD0851B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0851B).
           IF FLD0851E   NOT EQUAL XPC-FLD0851E
              DISPLAY 'FLD0851E  ==> ' FLD0851E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0851E.
           IF FLD0852B (1:)    NOT EQUAL XPC-FLD0852B
              DISPLAY 'FLD0852B ==> ' HEX-OF (FLD0852B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0852B).
           IF FLD0852E   NOT EQUAL XPC-FLD0852E
              DISPLAY 'FLD0852E  ==> ' FLD0852E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0852E.
           IF FLD0853B (1:)    NOT EQUAL XPC-FLD0853B
              DISPLAY 'FLD0853B ==> ' HEX-OF (FLD0853B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0853B).
           IF FLD0853E   NOT EQUAL XPC-FLD0853E
              DISPLAY 'FLD0853E  ==> ' FLD0853E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0853E.
           IF FLD0854B (1:)    NOT EQUAL XPC-FLD0854B
              DISPLAY 'FLD0854B ==> ' HEX-OF (FLD0854B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0854B).
           IF FLD0854E   NOT EQUAL XPC-FLD0854E
              DISPLAY 'FLD0854E  ==> ' FLD0854E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0854E.
           IF FLD0855B (1:)    NOT EQUAL XPC-FLD0855B
              DISPLAY 'FLD0855B ==> ' HEX-OF (FLD0855B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0855B).
           IF FLD0855E   NOT EQUAL XPC-FLD0855E
              DISPLAY 'FLD0855E  ==> ' FLD0855E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0855E.
           IF FLD0856B (1:)    NOT EQUAL XPC-FLD0856B
              DISPLAY 'FLD0856B ==> ' HEX-OF (FLD0856B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0856B).
           IF FLD0856E   NOT EQUAL XPC-FLD0856E
              DISPLAY 'FLD0856E  ==> ' FLD0856E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0856E.
           IF FLD0857B (1:)    NOT EQUAL XPC-FLD0857B
              DISPLAY 'FLD0857B ==> ' HEX-OF (FLD0857B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0857B).
           IF FLD0857E   NOT EQUAL XPC-FLD0857E
              DISPLAY 'FLD0857E  ==> ' FLD0857E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0857E.
           IF FLD0858B (1:)    NOT EQUAL XPC-FLD0858B
              DISPLAY 'FLD0858B ==> ' HEX-OF (FLD0858B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0858B).
           IF FLD0858E   NOT EQUAL XPC-FLD0858E
              DISPLAY 'FLD0858E  ==> ' FLD0858E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0858E.
           IF FLD0859B (1:)    NOT EQUAL XPC-FLD0859B
              DISPLAY 'FLD0859B ==> ' HEX-OF (FLD0859B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0859B).
           IF FLD0859E   NOT EQUAL XPC-FLD0859E
              DISPLAY 'FLD0859E  ==> ' FLD0859E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0859E.
           IF FLD0860B (1:)    NOT EQUAL XPC-FLD0860B
              DISPLAY 'FLD0860B ==> ' HEX-OF (FLD0860B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0860B).
           IF FLD0860E   NOT EQUAL XPC-FLD0860E
              DISPLAY 'FLD0860E  ==> ' FLD0860E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0860E.
           IF FLD0861B (1:)    NOT EQUAL XPC-FLD0861B
              DISPLAY 'FLD0861B ==> ' HEX-OF (FLD0861B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0861B).
           IF FLD0861E   NOT EQUAL XPC-FLD0861E
              DISPLAY 'FLD0861E  ==> ' FLD0861E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0861E.
           IF FLD0862B (1:)    NOT EQUAL XPC-FLD0862B
              DISPLAY 'FLD0862B ==> ' HEX-OF (FLD0862B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0862B).
           IF FLD0862E   NOT EQUAL XPC-FLD0862E
              DISPLAY 'FLD0862E  ==> ' FLD0862E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0862E.
           IF FLD0863B (1:)    NOT EQUAL XPC-FLD0863B
              DISPLAY 'FLD0863B ==> ' HEX-OF (FLD0863B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0863B).
           IF FLD0863E   NOT EQUAL XPC-FLD0863E
              DISPLAY 'FLD0863E  ==> ' FLD0863E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0863E.
           IF FLD0864B (1:)    NOT EQUAL XPC-FLD0864B
              DISPLAY 'FLD0864B ==> ' HEX-OF (FLD0864B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0864B).
           IF FLD0864E   NOT EQUAL XPC-FLD0864E
              DISPLAY 'FLD0864E  ==> ' FLD0864E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0864E.
           IF FLD0865B (1:)    NOT EQUAL XPC-FLD0865B
              DISPLAY 'FLD0865B ==> ' HEX-OF (FLD0865B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0865B).
           IF FLD0865E   NOT EQUAL XPC-FLD0865E
              DISPLAY 'FLD0865E  ==> ' FLD0865E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0865E.
           IF FLD0866B (1:)    NOT EQUAL XPC-FLD0866B
              DISPLAY 'FLD0866B ==> ' HEX-OF (FLD0866B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0866B).
           IF FLD0866E   NOT EQUAL XPC-FLD0866E
              DISPLAY 'FLD0866E  ==> ' FLD0866E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0866E.
           IF FLD0867B (1:)    NOT EQUAL XPC-FLD0867B
              DISPLAY 'FLD0867B ==> ' HEX-OF (FLD0867B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0867B).
           IF FLD0867E   NOT EQUAL XPC-FLD0867E
              DISPLAY 'FLD0867E  ==> ' FLD0867E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0867E.
           IF FLD0868B (1:)    NOT EQUAL XPC-FLD0868B
              DISPLAY 'FLD0868B ==> ' HEX-OF (FLD0868B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0868B).
           IF FLD0868E   NOT EQUAL XPC-FLD0868E
              DISPLAY 'FLD0868E  ==> ' FLD0868E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0868E.
           IF FLD0869B (1:)    NOT EQUAL XPC-FLD0869B
              DISPLAY 'FLD0869B ==> ' HEX-OF (FLD0869B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0869B).
           IF FLD0869E   NOT EQUAL XPC-FLD0869E
              DISPLAY 'FLD0869E  ==> ' FLD0869E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0869E.
           IF FLD0870B (1:)    NOT EQUAL XPC-FLD0870B
              DISPLAY 'FLD0870B ==> ' HEX-OF (FLD0870B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0870B).
           IF FLD0870E   NOT EQUAL XPC-FLD0870E
              DISPLAY 'FLD0870E  ==> ' FLD0870E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0870E.
           IF FLD0871B (1:)    NOT EQUAL XPC-FLD0871B
              DISPLAY 'FLD0871B ==> ' HEX-OF (FLD0871B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0871B).
           IF FLD0871E   NOT EQUAL XPC-FLD0871E
              DISPLAY 'FLD0871E  ==> ' FLD0871E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0871E.
           IF FLD0872B (1:)    NOT EQUAL XPC-FLD0872B
              DISPLAY 'FLD0872B ==> ' HEX-OF (FLD0872B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0872B).
           IF FLD0872E   NOT EQUAL XPC-FLD0872E
              DISPLAY 'FLD0872E  ==> ' FLD0872E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0872E.
           IF FLD0873B (1:)    NOT EQUAL XPC-FLD0873B
              DISPLAY 'FLD0873B ==> ' HEX-OF (FLD0873B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0873B).
           IF FLD0873E   NOT EQUAL XPC-FLD0873E
              DISPLAY 'FLD0873E  ==> ' FLD0873E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0873E.
           IF FLD0874B (1:)    NOT EQUAL XPC-FLD0874B
              DISPLAY 'FLD0874B ==> ' HEX-OF (FLD0874B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0874B).
           IF FLD0874E   NOT EQUAL XPC-FLD0874E
              DISPLAY 'FLD0874E  ==> ' FLD0874E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0874E.
           IF FLD0875B (1:)    NOT EQUAL XPC-FLD0875B
              DISPLAY 'FLD0875B ==> ' HEX-OF (FLD0875B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0875B).
           IF FLD0875E   NOT EQUAL XPC-FLD0875E
              DISPLAY 'FLD0875E  ==> ' FLD0875E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0875E.
           IF FLD0876B (1:)    NOT EQUAL XPC-FLD0876B
              DISPLAY 'FLD0876B ==> ' HEX-OF (FLD0876B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0876B).
           IF FLD0876E   NOT EQUAL XPC-FLD0876E
              DISPLAY 'FLD0876E  ==> ' FLD0876E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0876E.
           IF FLD0877B (1:)    NOT EQUAL XPC-FLD0877B
              DISPLAY 'FLD0877B ==> ' HEX-OF (FLD0877B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0877B).
           IF FLD0877E   NOT EQUAL XPC-FLD0877E
              DISPLAY 'FLD0877E  ==> ' FLD0877E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0877E.
           IF FLD0878B (1:)    NOT EQUAL XPC-FLD0878B
              DISPLAY 'FLD0878B ==> ' HEX-OF (FLD0878B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0878B).
           IF FLD0878E   NOT EQUAL XPC-FLD0878E
              DISPLAY 'FLD0878E  ==> ' FLD0878E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0878E.
           IF FLD0879B (1:)    NOT EQUAL XPC-FLD0879B
              DISPLAY 'FLD0879B ==> ' HEX-OF (FLD0879B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0879B).
           IF FLD0879E   NOT EQUAL XPC-FLD0879E
              DISPLAY 'FLD0879E  ==> ' FLD0879E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0879E.
           IF FLD0880B (1:)    NOT EQUAL XPC-FLD0880B
              DISPLAY 'FLD0880B ==> ' HEX-OF (FLD0880B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0880B).
           IF FLD0880E   NOT EQUAL XPC-FLD0880E
              DISPLAY 'FLD0880E  ==> ' FLD0880E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0880E.
           IF FLD0881B (1:)    NOT EQUAL XPC-FLD0881B
              DISPLAY 'FLD0881B ==> ' HEX-OF (FLD0881B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0881B).
           IF FLD0881E   NOT EQUAL XPC-FLD0881E
              DISPLAY 'FLD0881E  ==> ' FLD0881E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0881E.
           IF FLD0882B (1:)    NOT EQUAL XPC-FLD0882B
              DISPLAY 'FLD0882B ==> ' HEX-OF (FLD0882B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0882B).
           IF FLD0882E   NOT EQUAL XPC-FLD0882E
              DISPLAY 'FLD0882E  ==> ' FLD0882E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0882E.
           IF FLD0883B (1:)    NOT EQUAL XPC-FLD0883B
              DISPLAY 'FLD0883B ==> ' HEX-OF (FLD0883B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0883B).
           IF FLD0883E   NOT EQUAL XPC-FLD0883E
              DISPLAY 'FLD0883E  ==> ' FLD0883E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0883E.
           IF FLD0884B (1:)    NOT EQUAL XPC-FLD0884B
              DISPLAY 'FLD0884B ==> ' HEX-OF (FLD0884B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0884B).
           IF FLD0884E   NOT EQUAL XPC-FLD0884E
              DISPLAY 'FLD0884E  ==> ' FLD0884E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0884E.
           IF FLD0885B (1:)    NOT EQUAL XPC-FLD0885B
              DISPLAY 'FLD0885B ==> ' HEX-OF (FLD0885B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0885B).
           IF FLD0885E   NOT EQUAL XPC-FLD0885E
              DISPLAY 'FLD0885E  ==> ' FLD0885E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0885E.
           IF FLD0886B (1:)    NOT EQUAL XPC-FLD0886B
              DISPLAY 'FLD0886B ==> ' HEX-OF (FLD0886B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0886B).
           IF FLD0886E   NOT EQUAL XPC-FLD0886E
              DISPLAY 'FLD0886E  ==> ' FLD0886E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0886E.
           IF FLD0887B (1:)    NOT EQUAL XPC-FLD0887B
              DISPLAY 'FLD0887B ==> ' HEX-OF (FLD0887B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0887B).
           IF FLD0887E   NOT EQUAL XPC-FLD0887E
              DISPLAY 'FLD0887E  ==> ' FLD0887E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0887E.
           IF FLD0888B (1:)    NOT EQUAL XPC-FLD0888B
              DISPLAY 'FLD0888B ==> ' HEX-OF (FLD0888B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0888B).
           IF FLD0888E   NOT EQUAL XPC-FLD0888E
              DISPLAY 'FLD0888E  ==> ' FLD0888E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0888E.
           IF FLD0889B (1:)    NOT EQUAL XPC-FLD0889B
              DISPLAY 'FLD0889B ==> ' HEX-OF (FLD0889B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0889B).
           IF FLD0889E   NOT EQUAL XPC-FLD0889E
              DISPLAY 'FLD0889E  ==> ' FLD0889E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0889E.
           IF FLD0890B (1:)    NOT EQUAL XPC-FLD0890B
              DISPLAY 'FLD0890B ==> ' HEX-OF (FLD0890B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0890B).
           IF FLD0890E   NOT EQUAL XPC-FLD0890E
              DISPLAY 'FLD0890E  ==> ' FLD0890E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0890E.
           IF FLD0891B (1:)    NOT EQUAL XPC-FLD0891B
              DISPLAY 'FLD0891B ==> ' HEX-OF (FLD0891B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0891B).
           IF FLD0891E   NOT EQUAL XPC-FLD0891E
              DISPLAY 'FLD0891E  ==> ' FLD0891E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0891E.
           IF FLD0892B (1:)    NOT EQUAL XPC-FLD0892B
              DISPLAY 'FLD0892B ==> ' HEX-OF (FLD0892B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0892B).
           IF FLD0892E   NOT EQUAL XPC-FLD0892E
              DISPLAY 'FLD0892E  ==> ' FLD0892E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0892E.
           IF FLD0893B (1:)    NOT EQUAL XPC-FLD0893B
              DISPLAY 'FLD0893B ==> ' HEX-OF (FLD0893B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0893B).
           IF FLD0893E   NOT EQUAL XPC-FLD0893E
              DISPLAY 'FLD0893E  ==> ' FLD0893E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0893E.
           IF FLD0894B (1:)    NOT EQUAL XPC-FLD0894B
              DISPLAY 'FLD0894B ==> ' HEX-OF (FLD0894B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0894B).
           IF FLD0894E   NOT EQUAL XPC-FLD0894E
              DISPLAY 'FLD0894E  ==> ' FLD0894E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0894E.
           IF FLD0895B (1:)    NOT EQUAL XPC-FLD0895B
              DISPLAY 'FLD0895B ==> ' HEX-OF (FLD0895B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0895B).
           IF FLD0895E   NOT EQUAL XPC-FLD0895E
              DISPLAY 'FLD0895E  ==> ' FLD0895E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0895E.
           IF FLD0896B (1:)    NOT EQUAL XPC-FLD0896B
              DISPLAY 'FLD0896B ==> ' HEX-OF (FLD0896B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0896B).
           IF FLD0896E   NOT EQUAL XPC-FLD0896E
              DISPLAY 'FLD0896E  ==> ' FLD0896E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0896E.
           IF FLD0897B (1:)    NOT EQUAL XPC-FLD0897B
              DISPLAY 'FLD0897B ==> ' HEX-OF (FLD0897B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0897B).
           IF FLD0897E   NOT EQUAL XPC-FLD0897E
              DISPLAY 'FLD0897E  ==> ' FLD0897E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0897E.
           IF FLD0898B (1:)    NOT EQUAL XPC-FLD0898B
              DISPLAY 'FLD0898B ==> ' HEX-OF (FLD0898B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0898B).
           IF FLD0898E   NOT EQUAL XPC-FLD0898E
              DISPLAY 'FLD0898E  ==> ' FLD0898E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0898E.
           IF FLD0899B (1:)    NOT EQUAL XPC-FLD0899B
              DISPLAY 'FLD0899B ==> ' HEX-OF (FLD0899B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0899B).
           IF FLD0899E   NOT EQUAL XPC-FLD0899E
              DISPLAY 'FLD0899E  ==> ' FLD0899E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0899E.
           IF FLD0900B (1:)    NOT EQUAL XPC-FLD0900B
              DISPLAY 'FLD0900B ==> ' HEX-OF (FLD0900B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0900B).
           IF FLD0900E   NOT EQUAL XPC-FLD0900E
              DISPLAY 'FLD0900E  ==> ' FLD0900E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0900E.
           IF FLD0901B (1:)    NOT EQUAL XPC-FLD0901B
              DISPLAY 'FLD0901B ==> ' HEX-OF (FLD0901B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0901B).
           IF FLD0901E   NOT EQUAL XPC-FLD0901E
              DISPLAY 'FLD0901E  ==> ' FLD0901E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0901E.
           IF FLD0902B (1:)    NOT EQUAL XPC-FLD0902B
              DISPLAY 'FLD0902B ==> ' HEX-OF (FLD0902B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0902B).
           IF FLD0902E   NOT EQUAL XPC-FLD0902E
              DISPLAY 'FLD0902E  ==> ' FLD0902E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0902E.
           IF FLD0903B (1:)    NOT EQUAL XPC-FLD0903B
              DISPLAY 'FLD0903B ==> ' HEX-OF (FLD0903B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0903B).
           IF FLD0903E   NOT EQUAL XPC-FLD0903E
              DISPLAY 'FLD0903E  ==> ' FLD0903E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0903E.
           IF FLD0904B (1:)    NOT EQUAL XPC-FLD0904B
              DISPLAY 'FLD0904B ==> ' HEX-OF (FLD0904B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0904B).
           IF FLD0904E   NOT EQUAL XPC-FLD0904E
              DISPLAY 'FLD0904E  ==> ' FLD0904E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0904E.
           IF FLD0905B (1:)    NOT EQUAL XPC-FLD0905B
              DISPLAY 'FLD0905B ==> ' HEX-OF (FLD0905B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0905B).
           IF FLD0905E   NOT EQUAL XPC-FLD0905E
              DISPLAY 'FLD0905E  ==> ' FLD0905E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0905E.
           IF FLD0906B (1:)    NOT EQUAL XPC-FLD0906B
              DISPLAY 'FLD0906B ==> ' HEX-OF (FLD0906B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0906B).
           IF FLD0906E   NOT EQUAL XPC-FLD0906E
              DISPLAY 'FLD0906E  ==> ' FLD0906E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0906E.
           IF FLD0907B (1:)    NOT EQUAL XPC-FLD0907B
              DISPLAY 'FLD0907B ==> ' HEX-OF (FLD0907B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0907B).
           IF FLD0907E   NOT EQUAL XPC-FLD0907E
              DISPLAY 'FLD0907E  ==> ' FLD0907E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0907E.
           IF FLD0908B (1:)    NOT EQUAL XPC-FLD0908B
              DISPLAY 'FLD0908B ==> ' HEX-OF (FLD0908B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0908B).
           IF FLD0908E   NOT EQUAL XPC-FLD0908E
              DISPLAY 'FLD0908E  ==> ' FLD0908E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0908E.
           IF FLD0909B (1:)    NOT EQUAL XPC-FLD0909B
              DISPLAY 'FLD0909B ==> ' HEX-OF (FLD0909B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0909B).
           IF FLD0909E   NOT EQUAL XPC-FLD0909E
              DISPLAY 'FLD0909E  ==> ' FLD0909E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0909E.
           IF FLD0910B (1:)    NOT EQUAL XPC-FLD0910B
              DISPLAY 'FLD0910B ==> ' HEX-OF (FLD0910B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0910B).
           IF FLD0910E   NOT EQUAL XPC-FLD0910E
              DISPLAY 'FLD0910E  ==> ' FLD0910E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0910E.
           IF FLD0911B (1:)    NOT EQUAL XPC-FLD0911B
              DISPLAY 'FLD0911B ==> ' HEX-OF (FLD0911B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0911B).
           IF FLD0911E   NOT EQUAL XPC-FLD0911E
              DISPLAY 'FLD0911E  ==> ' FLD0911E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0911E.
           IF FLD0912B (1:)    NOT EQUAL XPC-FLD0912B
              DISPLAY 'FLD0912B ==> ' HEX-OF (FLD0912B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0912B).
           IF FLD0912E   NOT EQUAL XPC-FLD0912E
              DISPLAY 'FLD0912E  ==> ' FLD0912E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0912E.
           IF FLD0913B (1:)    NOT EQUAL XPC-FLD0913B
              DISPLAY 'FLD0913B ==> ' HEX-OF (FLD0913B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0913B).
           IF FLD0913E   NOT EQUAL XPC-FLD0913E
              DISPLAY 'FLD0913E  ==> ' FLD0913E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0913E.
           IF FLD0914B (1:)    NOT EQUAL XPC-FLD0914B
              DISPLAY 'FLD0914B ==> ' HEX-OF (FLD0914B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0914B).
           IF FLD0914E   NOT EQUAL XPC-FLD0914E
              DISPLAY 'FLD0914E  ==> ' FLD0914E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0914E.
           IF FLD0915B (1:)    NOT EQUAL XPC-FLD0915B
              DISPLAY 'FLD0915B ==> ' HEX-OF (FLD0915B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0915B).
           IF FLD0915E   NOT EQUAL XPC-FLD0915E
              DISPLAY 'FLD0915E  ==> ' FLD0915E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0915E.
           IF FLD0916B (1:)    NOT EQUAL XPC-FLD0916B
              DISPLAY 'FLD0916B ==> ' HEX-OF (FLD0916B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0916B).
           IF FLD0916E   NOT EQUAL XPC-FLD0916E
              DISPLAY 'FLD0916E  ==> ' FLD0916E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0916E.
           IF FLD0917B (1:)    NOT EQUAL XPC-FLD0917B
              DISPLAY 'FLD0917B ==> ' HEX-OF (FLD0917B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0917B).
           IF FLD0917E   NOT EQUAL XPC-FLD0917E
              DISPLAY 'FLD0917E  ==> ' FLD0917E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0917E.
           IF FLD0918B (1:)    NOT EQUAL XPC-FLD0918B
              DISPLAY 'FLD0918B ==> ' HEX-OF (FLD0918B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0918B).
           IF FLD0918E   NOT EQUAL XPC-FLD0918E
              DISPLAY 'FLD0918E  ==> ' FLD0918E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0918E.
           IF FLD0919B (1:)    NOT EQUAL XPC-FLD0919B
              DISPLAY 'FLD0919B ==> ' HEX-OF (FLD0919B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0919B).
           IF FLD0919E   NOT EQUAL XPC-FLD0919E
              DISPLAY 'FLD0919E  ==> ' FLD0919E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0919E.
           IF FLD0920B (1:)    NOT EQUAL XPC-FLD0920B
              DISPLAY 'FLD0920B ==> ' HEX-OF (FLD0920B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0920B).
           IF FLD0920E   NOT EQUAL XPC-FLD0920E
              DISPLAY 'FLD0920E  ==> ' FLD0920E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0920E.
           IF FLD0921B (1:)    NOT EQUAL XPC-FLD0921B
              DISPLAY 'FLD0921B ==> ' HEX-OF (FLD0921B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0921B).
           IF FLD0921E   NOT EQUAL XPC-FLD0921E
              DISPLAY 'FLD0921E  ==> ' FLD0921E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0921E.
           IF FLD0922B (1:)    NOT EQUAL XPC-FLD0922B
              DISPLAY 'FLD0922B ==> ' HEX-OF (FLD0922B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0922B).
           IF FLD0922E   NOT EQUAL XPC-FLD0922E
              DISPLAY 'FLD0922E  ==> ' FLD0922E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0922E.
           IF FLD0923B (1:)    NOT EQUAL XPC-FLD0923B
              DISPLAY 'FLD0923B ==> ' HEX-OF (FLD0923B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0923B).
           IF FLD0923E   NOT EQUAL XPC-FLD0923E
              DISPLAY 'FLD0923E  ==> ' FLD0923E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0923E.
           IF FLD0924B (1:)    NOT EQUAL XPC-FLD0924B
              DISPLAY 'FLD0924B ==> ' HEX-OF (FLD0924B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0924B).
           IF FLD0924E   NOT EQUAL XPC-FLD0924E
              DISPLAY 'FLD0924E  ==> ' FLD0924E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0924E.
           IF FLD0925B (1:)    NOT EQUAL XPC-FLD0925B
              DISPLAY 'FLD0925B ==> ' HEX-OF (FLD0925B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0925B).
           IF FLD0925E   NOT EQUAL XPC-FLD0925E
              DISPLAY 'FLD0925E  ==> ' FLD0925E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0925E.
           IF FLD0926B (1:)    NOT EQUAL XPC-FLD0926B
              DISPLAY 'FLD0926B ==> ' HEX-OF (FLD0926B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0926B).
           IF FLD0926E   NOT EQUAL XPC-FLD0926E
              DISPLAY 'FLD0926E  ==> ' FLD0926E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0926E.
           IF FLD0927B (1:)    NOT EQUAL XPC-FLD0927B
              DISPLAY 'FLD0927B ==> ' HEX-OF (FLD0927B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0927B).
           IF FLD0927E   NOT EQUAL XPC-FLD0927E
              DISPLAY 'FLD0927E  ==> ' FLD0927E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0927E.
           IF FLD0928B (1:)    NOT EQUAL XPC-FLD0928B
              DISPLAY 'FLD0928B ==> ' HEX-OF (FLD0928B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0928B).
           IF FLD0928E   NOT EQUAL XPC-FLD0928E
              DISPLAY 'FLD0928E  ==> ' FLD0928E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0928E.
           IF FLD0929B (1:)    NOT EQUAL XPC-FLD0929B
              DISPLAY 'FLD0929B ==> ' HEX-OF (FLD0929B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0929B).
           IF FLD0929E   NOT EQUAL XPC-FLD0929E
              DISPLAY 'FLD0929E  ==> ' FLD0929E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0929E.
           IF FLD0930B (1:)    NOT EQUAL XPC-FLD0930B
              DISPLAY 'FLD0930B ==> ' HEX-OF (FLD0930B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0930B).
           IF FLD0930E   NOT EQUAL XPC-FLD0930E
              DISPLAY 'FLD0930E  ==> ' FLD0930E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0930E.
           IF FLD0931B (1:)    NOT EQUAL XPC-FLD0931B
              DISPLAY 'FLD0931B ==> ' HEX-OF (FLD0931B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0931B).
           IF FLD0931E   NOT EQUAL XPC-FLD0931E
              DISPLAY 'FLD0931E  ==> ' FLD0931E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0931E.
           IF FLD0932B (1:)    NOT EQUAL XPC-FLD0932B
              DISPLAY 'FLD0932B ==> ' HEX-OF (FLD0932B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0932B).
           IF FLD0932E   NOT EQUAL XPC-FLD0932E
              DISPLAY 'FLD0932E  ==> ' FLD0932E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0932E.
           IF FLD0933B (1:)    NOT EQUAL XPC-FLD0933B
              DISPLAY 'FLD0933B ==> ' HEX-OF (FLD0933B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0933B).
           IF FLD0933E   NOT EQUAL XPC-FLD0933E
              DISPLAY 'FLD0933E  ==> ' FLD0933E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0933E.
           IF FLD0934B (1:)    NOT EQUAL XPC-FLD0934B
              DISPLAY 'FLD0934B ==> ' HEX-OF (FLD0934B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0934B).
           IF FLD0934E   NOT EQUAL XPC-FLD0934E
              DISPLAY 'FLD0934E  ==> ' FLD0934E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0934E.
           IF FLD0935B (1:)    NOT EQUAL XPC-FLD0935B
              DISPLAY 'FLD0935B ==> ' HEX-OF (FLD0935B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0935B).
           IF FLD0935E   NOT EQUAL XPC-FLD0935E
              DISPLAY 'FLD0935E  ==> ' FLD0935E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0935E.
           IF FLD0936B (1:)    NOT EQUAL XPC-FLD0936B
              DISPLAY 'FLD0936B ==> ' HEX-OF (FLD0936B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0936B).
           IF FLD0936E   NOT EQUAL XPC-FLD0936E
              DISPLAY 'FLD0936E  ==> ' FLD0936E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0936E.
           IF FLD0937B (1:)    NOT EQUAL XPC-FLD0937B
              DISPLAY 'FLD0937B ==> ' HEX-OF (FLD0937B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0937B).
           IF FLD0937E   NOT EQUAL XPC-FLD0937E
              DISPLAY 'FLD0937E  ==> ' FLD0937E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0937E.
           IF FLD0938B (1:)    NOT EQUAL XPC-FLD0938B
              DISPLAY 'FLD0938B ==> ' HEX-OF (FLD0938B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0938B).
           IF FLD0938E   NOT EQUAL XPC-FLD0938E
              DISPLAY 'FLD0938E  ==> ' FLD0938E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0938E.
           IF FLD0939B (1:)    NOT EQUAL XPC-FLD0939B
              DISPLAY 'FLD0939B ==> ' HEX-OF (FLD0939B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0939B).
           IF FLD0939E   NOT EQUAL XPC-FLD0939E
              DISPLAY 'FLD0939E  ==> ' FLD0939E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0939E.
           IF FLD0940B (1:)    NOT EQUAL XPC-FLD0940B
              DISPLAY 'FLD0940B ==> ' HEX-OF (FLD0940B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0940B).
           IF FLD0940E   NOT EQUAL XPC-FLD0940E
              DISPLAY 'FLD0940E  ==> ' FLD0940E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0940E.
           IF FLD0941B (1:)    NOT EQUAL XPC-FLD0941B
              DISPLAY 'FLD0941B ==> ' HEX-OF (FLD0941B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0941B).
           IF FLD0941E   NOT EQUAL XPC-FLD0941E
              DISPLAY 'FLD0941E  ==> ' FLD0941E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0941E.
           IF FLD0942B (1:)    NOT EQUAL XPC-FLD0942B
              DISPLAY 'FLD0942B ==> ' HEX-OF (FLD0942B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0942B).
           IF FLD0942E   NOT EQUAL XPC-FLD0942E
              DISPLAY 'FLD0942E  ==> ' FLD0942E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0942E.
           IF FLD0943B (1:)    NOT EQUAL XPC-FLD0943B
              DISPLAY 'FLD0943B ==> ' HEX-OF (FLD0943B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0943B).
           IF FLD0943E   NOT EQUAL XPC-FLD0943E
              DISPLAY 'FLD0943E  ==> ' FLD0943E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0943E.
           IF FLD0944B (1:)    NOT EQUAL XPC-FLD0944B
              DISPLAY 'FLD0944B ==> ' HEX-OF (FLD0944B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0944B).
           IF FLD0944E   NOT EQUAL XPC-FLD0944E
              DISPLAY 'FLD0944E  ==> ' FLD0944E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0944E.
           IF FLD0945B (1:)    NOT EQUAL XPC-FLD0945B
              DISPLAY 'FLD0945B ==> ' HEX-OF (FLD0945B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0945B).
           IF FLD0945E   NOT EQUAL XPC-FLD0945E
              DISPLAY 'FLD0945E  ==> ' FLD0945E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0945E.
           IF FLD0946B (1:)    NOT EQUAL XPC-FLD0946B
              DISPLAY 'FLD0946B ==> ' HEX-OF (FLD0946B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0946B).
           IF FLD0946E   NOT EQUAL XPC-FLD0946E
              DISPLAY 'FLD0946E  ==> ' FLD0946E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0946E.
           IF FLD0947B (1:)    NOT EQUAL XPC-FLD0947B
              DISPLAY 'FLD0947B ==> ' HEX-OF (FLD0947B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0947B).
           IF FLD0947E   NOT EQUAL XPC-FLD0947E
              DISPLAY 'FLD0947E  ==> ' FLD0947E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0947E.
           IF FLD0948B (1:)    NOT EQUAL XPC-FLD0948B
              DISPLAY 'FLD0948B ==> ' HEX-OF (FLD0948B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0948B).
           IF FLD0948E   NOT EQUAL XPC-FLD0948E
              DISPLAY 'FLD0948E  ==> ' FLD0948E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0948E.
           IF FLD0949B (1:)    NOT EQUAL XPC-FLD0949B
              DISPLAY 'FLD0949B ==> ' HEX-OF (FLD0949B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0949B).
           IF FLD0949E   NOT EQUAL XPC-FLD0949E
              DISPLAY 'FLD0949E  ==> ' FLD0949E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0949E.
           IF FLD0950B (1:)    NOT EQUAL XPC-FLD0950B
              DISPLAY 'FLD0950B ==> ' HEX-OF (FLD0950B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0950B).
           IF FLD0950E   NOT EQUAL XPC-FLD0950E
              DISPLAY 'FLD0950E  ==> ' FLD0950E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0950E.
           IF FLD0951B (1:)    NOT EQUAL XPC-FLD0951B
              DISPLAY 'FLD0951B ==> ' HEX-OF (FLD0951B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0951B).
           IF FLD0951E   NOT EQUAL XPC-FLD0951E
              DISPLAY 'FLD0951E  ==> ' FLD0951E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0951E.
           IF FLD0952B (1:)    NOT EQUAL XPC-FLD0952B
              DISPLAY 'FLD0952B ==> ' HEX-OF (FLD0952B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0952B).
           IF FLD0952E   NOT EQUAL XPC-FLD0952E
              DISPLAY 'FLD0952E  ==> ' FLD0952E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0952E.
           IF FLD0953B (1:)    NOT EQUAL XPC-FLD0953B
              DISPLAY 'FLD0953B ==> ' HEX-OF (FLD0953B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0953B).
           IF FLD0953E   NOT EQUAL XPC-FLD0953E
              DISPLAY 'FLD0953E  ==> ' FLD0953E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0953E.
           IF FLD0954B (1:)    NOT EQUAL XPC-FLD0954B
              DISPLAY 'FLD0954B ==> ' HEX-OF (FLD0954B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0954B).
           IF FLD0954E   NOT EQUAL XPC-FLD0954E
              DISPLAY 'FLD0954E  ==> ' FLD0954E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0954E.
           IF FLD0955B (1:)    NOT EQUAL XPC-FLD0955B
              DISPLAY 'FLD0955B ==> ' HEX-OF (FLD0955B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0955B).
           IF FLD0955E   NOT EQUAL XPC-FLD0955E
              DISPLAY 'FLD0955E  ==> ' FLD0955E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0955E.
           IF FLD0956B (1:)    NOT EQUAL XPC-FLD0956B
              DISPLAY 'FLD0956B ==> ' HEX-OF (FLD0956B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0956B).
           IF FLD0956E   NOT EQUAL XPC-FLD0956E
              DISPLAY 'FLD0956E  ==> ' FLD0956E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0956E.
           IF FLD0957B (1:)    NOT EQUAL XPC-FLD0957B
              DISPLAY 'FLD0957B ==> ' HEX-OF (FLD0957B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0957B).
           IF FLD0957E   NOT EQUAL XPC-FLD0957E
              DISPLAY 'FLD0957E  ==> ' FLD0957E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0957E.
           IF FLD0958B (1:)    NOT EQUAL XPC-FLD0958B
              DISPLAY 'FLD0958B ==> ' HEX-OF (FLD0958B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0958B).
           IF FLD0958E   NOT EQUAL XPC-FLD0958E
              DISPLAY 'FLD0958E  ==> ' FLD0958E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0958E.
           IF FLD0959B (1:)    NOT EQUAL XPC-FLD0959B
              DISPLAY 'FLD0959B ==> ' HEX-OF (FLD0959B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0959B).
           IF FLD0959E   NOT EQUAL XPC-FLD0959E
              DISPLAY 'FLD0959E  ==> ' FLD0959E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0959E.
           IF FLD0960B (1:)    NOT EQUAL XPC-FLD0960B
              DISPLAY 'FLD0960B ==> ' HEX-OF (FLD0960B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0960B).
           IF FLD0960E   NOT EQUAL XPC-FLD0960E
              DISPLAY 'FLD0960E  ==> ' FLD0960E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0960E.
           IF FLD0961B (1:)    NOT EQUAL XPC-FLD0961B
              DISPLAY 'FLD0961B ==> ' HEX-OF (FLD0961B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0961B).
           IF FLD0961E   NOT EQUAL XPC-FLD0961E
              DISPLAY 'FLD0961E  ==> ' FLD0961E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0961E.
           IF FLD0962B (1:)    NOT EQUAL XPC-FLD0962B
              DISPLAY 'FLD0962B ==> ' HEX-OF (FLD0962B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0962B).
           IF FLD0962E   NOT EQUAL XPC-FLD0962E
              DISPLAY 'FLD0962E  ==> ' FLD0962E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0962E.
           IF FLD0963B (1:)    NOT EQUAL XPC-FLD0963B
              DISPLAY 'FLD0963B ==> ' HEX-OF (FLD0963B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0963B).
           IF FLD0963E   NOT EQUAL XPC-FLD0963E
              DISPLAY 'FLD0963E  ==> ' FLD0963E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0963E.
           IF FLD0964B (1:)    NOT EQUAL XPC-FLD0964B
              DISPLAY 'FLD0964B ==> ' HEX-OF (FLD0964B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0964B).
           IF FLD0964E   NOT EQUAL XPC-FLD0964E
              DISPLAY 'FLD0964E  ==> ' FLD0964E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0964E.
           IF FLD0965B (1:)    NOT EQUAL XPC-FLD0965B
              DISPLAY 'FLD0965B ==> ' HEX-OF (FLD0965B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0965B).
           IF FLD0965E   NOT EQUAL XPC-FLD0965E
              DISPLAY 'FLD0965E  ==> ' FLD0965E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0965E.
           IF FLD0966B (1:)    NOT EQUAL XPC-FLD0966B
              DISPLAY 'FLD0966B ==> ' HEX-OF (FLD0966B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0966B).
           IF FLD0966E   NOT EQUAL XPC-FLD0966E
              DISPLAY 'FLD0966E  ==> ' FLD0966E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0966E.
           IF FLD0967B (1:)    NOT EQUAL XPC-FLD0967B
              DISPLAY 'FLD0967B ==> ' HEX-OF (FLD0967B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0967B).
           IF FLD0967E   NOT EQUAL XPC-FLD0967E
              DISPLAY 'FLD0967E  ==> ' FLD0967E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0967E.
           IF FLD0968B (1:)    NOT EQUAL XPC-FLD0968B
              DISPLAY 'FLD0968B ==> ' HEX-OF (FLD0968B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0968B).
           IF FLD0968E   NOT EQUAL XPC-FLD0968E
              DISPLAY 'FLD0968E  ==> ' FLD0968E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0968E.
           IF FLD0969B (1:)    NOT EQUAL XPC-FLD0969B
              DISPLAY 'FLD0969B ==> ' HEX-OF (FLD0969B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0969B).
           IF FLD0969E   NOT EQUAL XPC-FLD0969E
              DISPLAY 'FLD0969E  ==> ' FLD0969E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0969E.
           IF FLD0970B (1:)    NOT EQUAL XPC-FLD0970B
              DISPLAY 'FLD0970B ==> ' HEX-OF (FLD0970B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0970B).
           IF FLD0970E   NOT EQUAL XPC-FLD0970E
              DISPLAY 'FLD0970E  ==> ' FLD0970E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0970E.
           IF FLD0971B (1:)    NOT EQUAL XPC-FLD0971B
              DISPLAY 'FLD0971B ==> ' HEX-OF (FLD0971B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0971B).
           IF FLD0971E   NOT EQUAL XPC-FLD0971E
              DISPLAY 'FLD0971E  ==> ' FLD0971E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0971E.
           IF FLD0972B (1:)    NOT EQUAL XPC-FLD0972B
              DISPLAY 'FLD0972B ==> ' HEX-OF (FLD0972B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0972B).
           IF FLD0972E   NOT EQUAL XPC-FLD0972E
              DISPLAY 'FLD0972E  ==> ' FLD0972E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0972E.
           IF FLD0973B (1:)    NOT EQUAL XPC-FLD0973B
              DISPLAY 'FLD0973B ==> ' HEX-OF (FLD0973B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0973B).
           IF FLD0973E   NOT EQUAL XPC-FLD0973E
              DISPLAY 'FLD0973E  ==> ' FLD0973E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0973E.
           IF FLD0974B (1:)    NOT EQUAL XPC-FLD0974B
              DISPLAY 'FLD0974B ==> ' HEX-OF (FLD0974B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0974B).
           IF FLD0974E   NOT EQUAL XPC-FLD0974E
              DISPLAY 'FLD0974E  ==> ' FLD0974E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0974E.
           IF FLD0975B (1:)    NOT EQUAL XPC-FLD0975B
              DISPLAY 'FLD0975B ==> ' HEX-OF (FLD0975B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0975B).
           IF FLD0975E   NOT EQUAL XPC-FLD0975E
              DISPLAY 'FLD0975E  ==> ' FLD0975E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0975E.
           IF FLD0976B (1:)    NOT EQUAL XPC-FLD0976B
              DISPLAY 'FLD0976B ==> ' HEX-OF (FLD0976B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0976B).
           IF FLD0976E   NOT EQUAL XPC-FLD0976E
              DISPLAY 'FLD0976E  ==> ' FLD0976E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0976E.
           IF FLD0977B (1:)    NOT EQUAL XPC-FLD0977B
              DISPLAY 'FLD0977B ==> ' HEX-OF (FLD0977B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0977B).
           IF FLD0977E   NOT EQUAL XPC-FLD0977E
              DISPLAY 'FLD0977E  ==> ' FLD0977E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0977E.
           IF FLD0978B (1:)    NOT EQUAL XPC-FLD0978B
              DISPLAY 'FLD0978B ==> ' HEX-OF (FLD0978B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0978B).
           IF FLD0978E   NOT EQUAL XPC-FLD0978E
              DISPLAY 'FLD0978E  ==> ' FLD0978E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0978E.
           IF FLD0979B (1:)    NOT EQUAL XPC-FLD0979B
              DISPLAY 'FLD0979B ==> ' HEX-OF (FLD0979B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0979B).
           IF FLD0979E   NOT EQUAL XPC-FLD0979E
              DISPLAY 'FLD0979E  ==> ' FLD0979E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0979E.
           IF FLD0980B (1:)    NOT EQUAL XPC-FLD0980B
              DISPLAY 'FLD0980B ==> ' HEX-OF (FLD0980B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0980B).
           IF FLD0980E   NOT EQUAL XPC-FLD0980E
              DISPLAY 'FLD0980E  ==> ' FLD0980E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0980E.
           IF FLD0981B (1:)    NOT EQUAL XPC-FLD0981B
              DISPLAY 'FLD0981B ==> ' HEX-OF (FLD0981B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0981B).
           IF FLD0981E   NOT EQUAL XPC-FLD0981E
              DISPLAY 'FLD0981E  ==> ' FLD0981E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0981E.
           IF FLD0982B (1:)    NOT EQUAL XPC-FLD0982B
              DISPLAY 'FLD0982B ==> ' HEX-OF (FLD0982B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0982B).
           IF FLD0982E   NOT EQUAL XPC-FLD0982E
              DISPLAY 'FLD0982E  ==> ' FLD0982E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0982E.
           IF FLD0983B (1:)    NOT EQUAL XPC-FLD0983B
              DISPLAY 'FLD0983B ==> ' HEX-OF (FLD0983B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0983B).
           IF FLD0983E   NOT EQUAL XPC-FLD0983E
              DISPLAY 'FLD0983E  ==> ' FLD0983E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0983E.
           IF FLD0984B (1:)    NOT EQUAL XPC-FLD0984B
              DISPLAY 'FLD0984B ==> ' HEX-OF (FLD0984B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0984B).
           IF FLD0984E   NOT EQUAL XPC-FLD0984E
              DISPLAY 'FLD0984E  ==> ' FLD0984E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0984E.
           IF FLD0985B (1:)    NOT EQUAL XPC-FLD0985B
              DISPLAY 'FLD0985B ==> ' HEX-OF (FLD0985B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0985B).
           IF FLD0985E   NOT EQUAL XPC-FLD0985E
              DISPLAY 'FLD0985E  ==> ' FLD0985E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0985E.
           IF FLD0986B (1:)    NOT EQUAL XPC-FLD0986B
              DISPLAY 'FLD0986B ==> ' HEX-OF (FLD0986B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0986B).
           IF FLD0986E   NOT EQUAL XPC-FLD0986E
              DISPLAY 'FLD0986E  ==> ' FLD0986E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0986E.
           IF FLD0987B (1:)    NOT EQUAL XPC-FLD0987B
              DISPLAY 'FLD0987B ==> ' HEX-OF (FLD0987B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0987B).
           IF FLD0987E   NOT EQUAL XPC-FLD0987E
              DISPLAY 'FLD0987E  ==> ' FLD0987E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0987E.
           IF FLD0988B (1:)    NOT EQUAL XPC-FLD0988B
              DISPLAY 'FLD0988B ==> ' HEX-OF (FLD0988B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0988B).
           IF FLD0988E   NOT EQUAL XPC-FLD0988E
              DISPLAY 'FLD0988E  ==> ' FLD0988E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0988E.
           IF FLD0989B (1:)    NOT EQUAL XPC-FLD0989B
              DISPLAY 'FLD0989B ==> ' HEX-OF (FLD0989B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0989B).
           IF FLD0989E   NOT EQUAL XPC-FLD0989E
              DISPLAY 'FLD0989E  ==> ' FLD0989E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0989E.
           IF FLD0990B (1:)    NOT EQUAL XPC-FLD0990B
              DISPLAY 'FLD0990B ==> ' HEX-OF (FLD0990B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0990B).
           IF FLD0990E   NOT EQUAL XPC-FLD0990E
              DISPLAY 'FLD0990E  ==> ' FLD0990E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0990E.
           IF FLD0991B (1:)    NOT EQUAL XPC-FLD0991B
              DISPLAY 'FLD0991B ==> ' HEX-OF (FLD0991B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0991B).
           IF FLD0991E   NOT EQUAL XPC-FLD0991E
              DISPLAY 'FLD0991E  ==> ' FLD0991E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0991E.
           IF FLD0992B (1:)    NOT EQUAL XPC-FLD0992B
              DISPLAY 'FLD0992B ==> ' HEX-OF (FLD0992B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0992B).
           IF FLD0992E   NOT EQUAL XPC-FLD0992E
              DISPLAY 'FLD0992E  ==> ' FLD0992E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0992E.
           IF FLD0993B (1:)    NOT EQUAL XPC-FLD0993B
              DISPLAY 'FLD0993B ==> ' HEX-OF (FLD0993B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0993B).
           IF FLD0993E   NOT EQUAL XPC-FLD0993E
              DISPLAY 'FLD0993E  ==> ' FLD0993E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0993E.
           IF FLD0994B (1:)    NOT EQUAL XPC-FLD0994B
              DISPLAY 'FLD0994B ==> ' HEX-OF (FLD0994B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0994B).
           IF FLD0994E   NOT EQUAL XPC-FLD0994E
              DISPLAY 'FLD0994E  ==> ' FLD0994E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0994E.
           IF FLD0995B (1:)    NOT EQUAL XPC-FLD0995B
              DISPLAY 'FLD0995B ==> ' HEX-OF (FLD0995B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0995B).
           IF FLD0995E   NOT EQUAL XPC-FLD0995E
              DISPLAY 'FLD0995E  ==> ' FLD0995E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0995E.
           IF FLD0996B (1:)    NOT EQUAL XPC-FLD0996B
              DISPLAY 'FLD0996B ==> ' HEX-OF (FLD0996B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0996B).
           IF FLD0996E   NOT EQUAL XPC-FLD0996E
              DISPLAY 'FLD0996E  ==> ' FLD0996E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0996E.
           IF FLD0997B (1:)    NOT EQUAL XPC-FLD0997B
              DISPLAY 'FLD0997B ==> ' HEX-OF (FLD0997B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0997B).
           IF FLD0997E   NOT EQUAL XPC-FLD0997E
              DISPLAY 'FLD0997E  ==> ' FLD0997E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0997E.
           IF FLD0998B (1:)    NOT EQUAL XPC-FLD0998B
              DISPLAY 'FLD0998B ==> ' HEX-OF (FLD0998B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0998B).
           IF FLD0998E   NOT EQUAL XPC-FLD0998E
              DISPLAY 'FLD0998E  ==> ' FLD0998E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0998E.
           IF FLD0999B (1:)    NOT EQUAL XPC-FLD0999B
              DISPLAY 'FLD0999B ==> ' HEX-OF (FLD0999B)
              DISPLAY 'EXPECTED ==> ' HEX-OF (XPC-FLD0999B).
           IF FLD0999E   NOT EQUAL XPC-FLD0999E
              DISPLAY 'FLD0999E  ==> ' FLD0999E
              DISPLAY 'EXPECTED  ==> ' XPC-FLD0999E.
