       IDENTIFICATION   DIVISION.
       PROGRAM-ID.      prog.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WORK-UDWORD-1 PIC 9(18) COMP.
       PROCEDURE        DIVISION.
           MOVE 18446744073709551615 TO WORK-UDWORD-1.
           DISPLAY WORK-UDWORD-1.
           COMPUTE  WORK-UDWORD-1 = WORK-UDWORD-1 / 2.
           DISPLAY WORK-UDWORD-1.
           STOP RUN.
