       IDENTIFICATION   DIVISION.
       PROGRAM-ID.      prog.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WORK-DWORD-1  PIC S9(18) COMP-5 VALUE -9223372036854775808.
       PROCEDURE        DIVISION.
           DISPLAY WORK-DWORD-1 WITH NO ADVANCING.
           STOP RUN.
