       IDENTIFICATION   DIVISION.
       PROGRAM-ID.      prog.
       DATA             DIVISION.
       WORKING-STORAGE SECTION.
       77  myfloat       usage float
                         value is 3.97E+24.
       77  mydouble      usage double
                         value is 3.97E+44.
       PROCEDURE DIVISION.
       MAIN.
      *
           STOP RUN.
