       IDENTIFICATION  DIVISION.
       PROGRAM-ID.     prog.

       DATA            DIVISION.
       WORKING-STORAGE SECTION.
       01  hello       PIC X.
       01  foo         PIC X.
       01  bars        PIC X.
       01  file        PIC X.
       01  background-color PIC X.

       PROCEDURE       DIVISION.
           CONTINUE
           .
