       IDENTIFICATION DIVISION.
       PROGRAM-ID.    prog2.

       DATA           DIVISION.
       LINKAGE        SECTION.
       01  str        ANY LENGTH PIC X.

       PROCEDURE DIVISION.
           GOBACK
           .
