       IDENTIFICATION   DIVISION.
       PROGRAM-ID.      prog.
      * this is a comment
       PROCEDURE        DIVISION.
          DISPLAY "OK" NO ADVANCING
          END-DISPLAY.
          STOP RUN.
