       IDENTIFICATION DIVISION.
       PROGRAM-ID.    prog.
       PROCEDURE      DIVISION.
       >>IF A IS DEFINED
           CONTINUE
           .
       >>else
           CONTINUE
           .
       >>eNd-If
