      *CONTROL LIST
        *CONTROL SOURCE
      *CBL MAP LIST
000100 *CBL NOMAP NOSOURCE NOLIST
000200 IDENTIFICATION  DIVISION.
000300 PROGRAM-ID. VALID.
