       CONTROL		DIVISION.
       DEFAULT		SECTION.
       IDENTIFICATION   DIVISION.
       PROGRAM-ID.      prog.
       DATA             DIVISION.
       WORKING-STORAGE  SECTION.
       01 VAR PIC X(2) VALUE "OK".
       PROCEDURE        DIVISION.
           DISPLAY VAR NO ADVANCING
           END-DISPLAY.
           STOP RUN.
