       IDENTIFICATION   DIVISION.
       PROGRAM-ID.      prog.
       PROCEDURE DIVISION.
           DISPLAY OMITTED WITH BELL
           DISPLAY OMITTED LINE 10 COL 15 ERASE EOL
      *
           STOP RUN.
