       IDENTIFICATION DIVISION.
       PROGRAM-ID.    prog.
       PROCEDURE      DIVISION.
       >> IF BANANA
         >>DISPLAY "Who throws bananas?"
       >> ELSE
         >> DISPLAY "No BANANA here."
         >> DEFINE X 1
       >> END-IF
           CONTINUE
           .
