       IDENTIFICATION DIVISION.
       PROGRAM-ID. prog.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  x  PIC X(10).
       01  y  PIC X.
       01  yy PIC XX.

       PROCEDURE DIVISION.
           EXAMINE x TALLYING ALL "AA" REPLACING BY "CC"
           EXAMINE x TALLYING UNTIL FIRST SPACE
           EXAMINE x TALLYING UNTIL FIRST y
           EXAMINE x TALLYING LEADING yy
           EXAMINE y TALLYING ALL x (1).
           EXAMINE y TALLYING ALL x (3:2).
           EXAMINE x TALLYING UNTIL FIRST ALL
