       IDENTIFICATION   DIVISION.
       PROGRAM-ID.      prog.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       DATA             DIVISION.
       WORKING-STORAGE  SECTION.
       PROCEDURE        DIVISION.
      *    DISPLAY 'COMMENT'      END-DISPLAY
      /    DISPLAY 'COMMENTSLASH' END-DISPLAY
*          DISPLAY 'MFCOMMENT'    END-DISPLAY
 *         DISPLAY 'NOMFCOMMENT'  END-DISPLAY
        *> DISPLAY 'FLOATING'     END-DISPLAY
 *>        DISPLAY 'NOFLOATING'   END-DISPLAY
           STOP RUN.
