IDENTIFICATION   DIVISION.
PROGRAM-ID.      prog3.
ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
DATA             DIVISION.
WORKING-STORAGE  SECTION.
PROCEDURE        DIVISION.
      * DISPLAY 'NOCOMMENT'        END-DISPLAY
      / DISPLAY 'NOCOMMENTSLASH'   END-DISPLAY
$       DISPLAY 'ACUCOMMENTDOLLAR' END-DISPLAY
*       DISPLAY 'NOMFCOMMENT'      END-DISPLAY
 |      DISPLAY 'ACUFLOATING'      END-DISPLAY
 *>     DISPLAY 'FLOATING'         END-DISPLAY
      x DISPLAY 'WRONGINDICATOR'   END-DISPLAY
        STOP RUN.
