       IDENTIFICATION DIVISION
       PROGRAM-ID. prog.
       DATA DIVISION
       WORKING-STORAGE SECTION
       77 PMODE   PIC X
       PROCEDURE DIVISION.
          STOP RUN.
