       IDENTIFICATION DIVISION.
       PROGRAM-ID.  prog2.

       PROCEDURE DIVISION.
           COMP-1 "Hello, world!".
           DISPLAY "Hello, world!".
