       IDENTIFICATION DIVISION.
       PROGRAM-ID.  prog.

       PROCEDURE DIVISION.
           COMP-1 "Hello, world!"
           DISPLAY "Hello, world!".
