       IDENTIFICATION   DIVISION.
       PROGRAM-ID.      prog.
       DATA             DIVISION.
       WORKING-STORAGE  SECTION.
       1 LGS            PICTURE 9(10).
       1 L-DAT          PICTURE LX(10) DEPENDING ON LGS.
       PROCEDURE        DIVISION.
           STOP RUN.
