#Process codepage(1047)
#CBL CODEPAGE(1047)
#Process
#  Process codepage(1208)
#  CBL CODEPAGE(1208)
#000100 Process codepage(1047)
#000200 CBL CODEPAGE(1047)
#000300 CBL
#000400 IDENTIFICATION  DIVISION.
#000500 PROGRAM-ID. VALID.
#
