       IDENTIFICATION   DIVISION.
       PROGRAM-ID.      prog.
       DATA             DIVISION.
       WORKING-STORAGE  SECTION.
       01  CURSOR-POSITION IS SPECIAL-NAMES CURSOR.
           03  CURSOR-ROW   PIC 999.
           03  CURSOR-COL   PIC 999.
       77  CRT-STATUS       PIC 9(5) IS SPECIAL-NAMES CRT STATUS.
       PROCEDURE        DIVISION.
           ACCEPT OMITTED END-ACCEPT.
           STOP RUN.
