       IDENTIFICATION  DIVISION.
       PROGRAM-ID. prog.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 VAR1  PIC 9.
       01 VAR2  PIC 9.
       01 VAR3  PIC 9.
       01 VAR4  PIC 9.
       PROCEDURE DIVISION.
        CALL X"91" USING VAR1 VAR2 VAR3 VAR4.
        CALL X"91" USING VAR1.
        CALL "C$TOUPPER" USING VAR1 VAR2 VAR3.
        CALL "CBL_GC_FORK" USING VAR1.
