       IDENTIFICATION DIVISION.
       PROGRAM-ID.    TESTING.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT TSTFIL1 ASSIGN TO "TSTFIL1"
               ORGANIZATION LINE SEQUENTIAL.
           SELECT TSTFIL2 ASSIGN TO "TSTFIL2"
               ORGANIZATION LINE SEQUENTIAL.

       DATA DIVISION.
       FILE SECTION.
       FD TSTFIL1.
       01 TSTREC1              PIC X(256).
       FD TSTFIL2.
       01 TSTREC2              PIC X(256).
       WORKING-STORAGE SECTION.
       01 OODB-RESULT                   PIC X(07).

       PROCEDURE DIVISION.
       DECLARATIVES.
       MY-TEST SECTION.
           USE FOR DEBUGGING ON ALL REFERENCES OF OODB-RESULT.
       I-O-TEST-OODB-RESULT.
           EVALUATE OODB-RESULT
           WHEN SPACES
               DISPLAY "LINE 1"
           WHEN OTHER
               DISPLAY "LINE 2" END-DISPLAY
           END-EVALUATE.
           CLOSE TSTFIL1, TSTFIL2.
       END DECLARATIVES.

       MAIN SECTION.
       000-BEGIN.
           STOP RUN.
