       IDENTIFICATION  DIVISION.
       PROGRAM-ID.     prog2.

       ENVIRONMENT     DIVISION.
       CONFIGURATION   SECTION.

       PROCEDURE DIVISION.
       MAIN.
           DISPLAY DEBUG-ITEM.
           DISPLAY DEBUG-NAME " AT " DEBUG-LINE " WITH " DEBUG-CONTENTS.
           DISPLAY DEBUG-SUB-1 DEBUG-SUB-2 DEBUG-SUB-3.
           STOP RUN.
